[{"description": "Description", "talk_perm": "Don't record my talk", "language": "English", "author": "wenlien1001@gmail.com", "speech_type": "Regular Talk", "tags": "Test, Stanley", "abstract": "Abstract", "additional_info": "Reference", "reviews": [], "id": 107, "duration": "40 mins", "title": "Test from Stanley", "decision": "Undecided", "slide_perm": "Don't publish my slide", "audience_level": "Extreme"}, {"description": "This talk is modeled after a blog post I wrote on my own statically generated blog:\r\n\r\nhttp://nafiulis.me/making-a-static-blog-with-pelican.html\r\n\r\nParts of the talk:\r\n\r\n- Benefits of having a static blog\r\n- Why pelican is a good choice\r\n- Starting with pelican, the initial setup\r\n- Automation tools available\r\n- Themes, and how you can hack them\r\n- How settings work\r\n- Writing Content\r\n- Previewing content\r\n- Using and creating plugins\r\n- Hosting on github pages", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "gamesbrainiac@gmail.com", "speech_type": "Regular Talk", "tags": "Pelican, Static-Site-Generator", "abstract": "Static Site Generators are now used by many developers. If you see a .github.io domain, it means that their site is statically generated and version controlled. What I want to talk about in this lecture is why static blog generators are so popular and so powerful if you want something hackable. I'll talk about pelican, its good parts, its pitfalls as well as some custom suggestions to make your workflow faster.", "additional_info": "http://nafiulis.me/making-a-static-blog-with-pelican.html\r\nhttp://docs.getpelican.com/en/3.5.0/\r\nhttps://www.staticgen.com/", "reviews": [{"comment": "* The provided blog post about the experience in pelican is really detailed with some hints.\r\n* It is not just a step-by-step talk, but with some additional scripting to achieve some tasks. Quite good.\r\n* It might be even great if the author can think about providing some more advanced theme customization.", "reviewer": "drakeguan", "rank": 4}, {"comment": "I like the Pelican framework, it's a good static site generator worth more attention.", "reviewer": "liang2", "rank": 4}, {"comment": "I look the introduction about this package on YouTube. It's really amazing and convenient for people who want to create static webs without (complicated? ) python programming.  ", "reviewer": "yudalin", "rank": 4}], "id": 14, "duration": "40 mins", "title": "Building Static Blogs using Pelican", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Description:\r\n------------\r\n\r\nAs a researcher using programming as an aid for more than 2 decades, I found the Pyhton (version 3) programming language in 2011, about 4 years ago. At beginning, I just used it to replace Perl which was used to glue some of my research programs in C/C++. Little by little, I have been attracted by the Python language itself more and more. It is so simple, friendly, beautiful, and elegant. It is also so powerful in many aspects. At last, I found it is far more than just as a glue language. It is itself the total solution for my research career. Last year (2014), after 3 years of experience of Python, I successfully implemented a real-time audio spectrogram in Python 3 and gave a talk about it in Pycon APAC 2014.  [https://tw.pycon.org/2014apac/zh/program/45] [https://github.com/renyuanL/realTimeSpectrogram]  [http://youtu.be/bjISlxO93Ns]\r\n\t\r\nOne of the most attractive features of Python (version 3) is that it allows me to use Chinese as identifiers to name variables, functions and classes in the codes. As a learner of English as a second language for more than 3 decades, I have to confess that I am not still as fluent in English as I am in Chinese. This is partially due to the difference of the vocabulary capability of mine in these 2 languages. While programming, I am often struggled in finding a good English word or phrase to name a function or variable. This usually hinders me much from thinking and coding fluently.\r\n\t\r\nIn fact, not only Python (version 3) has such a feature, many modern computer programming languages adopt Unicode as the source coding, such as Java, Ruby, Javascript, or even the new Swift language proposed by Apple Corp last year (2014). This means that programmers can use non-English like Chinese as identifiers. In other words, we can almost directly use Chinese to write programs, except for a small number of keywords, which is usually not a literate problem since those keywords are usually simple, short, and common grammatically functional words in English, such as “for”, “while”, “class”, “import”, …, etc. All of a sudden, I thought this would be a key point to make the programming education more widespread globally, especially for those kids in high schools or even those adults who are not fluent (like me) in English as their second language.\r\n\r\nIn this project, we will choose Python-3 programming language for its Unicode source coding, with one of the famous turtle graphic module as an example.  By adding Chinese alias for functions and classes in the module, we will create a Chinese coding environment, which will be compatible with current and future versions of Python. If this has been done, it will really help programming education to more people in Chinese-speaking areas.\r\n\r\nSome previous efforts for similar purpose have been done in Python 2, which is in ASCII source coding. “ChinesePython” and “zhpy” are two of them. [http://www.chinesepython.org/] [https://code.google.com/p/zhpy/] Compared with these efforts, the major goal of this project is to create a more concise, simpler Chinese Python environment, including a set of 18 translated official sample programs, with a complete program description, and ultimately provides the online help function.\r\n\r\nThe methodology is to dive into the source code of “turtle.py” , a famous module included in the standard library of the official Python distribution. By fully understanding the “turtle” module, we created an accompanied module called “turtle_tc” , where we provided a full list of alias in traditional Chinese for all identifiers used in “turtle”. By this way, as long as the programmer “import  turtle_tc”, he can use all Chinese names of functions or classes in his/her programs. By providing additional document files, the programmers are also allowed to use on-line help functions, all in traditional Chinese. Here is an example. It is translated from \"yinyang.py\" distributed as a demo program in official python distribution.\r\n\r\nCode Example:\r\n------------\r\n\r\nfrom turtle_tc import * \r\n\r\ndef 陰(半徑, 顏色1, 顏色2): \r\n    筆寬(3) \r\n    顏色(黑, 顏色1) \r\n    開始填() \r\n    畫圓(半徑/2., 180) \r\n    畫圓(半徑, 180) \r\n    左轉(180) \r\n    畫圓(-半徑/2., 180) \r\n    結束填() \r\n    左轉(90) \r\n    提筆() \r\n    前進(半徑*0.35) \r\n    右轉(90) \r\n    下筆() \r\n    顏色(顏色1, 顏色2) \r\n    開始填() \r\n    畫圓(半徑*0.15) \r\n    結束填() \r\n    左轉(90) \r\n    提筆() \r\n    後退(半徑*0.35) \r\n    下筆() \r\n    左轉(90) \r\n　 \r\ndef 主函數(): \r\n    重設() \r\n    陰(200, 黑, 白) \r\n    陰(200, 白, 黑) \r\n    藏龜() \r\n    return \"完成！\" \r\n　 \r\nif __name__ == '__main__': \r\n    主函數() \r\n    主迴圈() \r\n\r\nHelp online:\r\n------------\r\n\r\n>>> help(前進) \r\nHelp on function 前進 in module turtle_tc: \r\n前進(distance) \r\n    『0053  中文說明』 \r\n    龜前進指定的距離。 \r\n            別名: 前進 | forward | fd \r\n            參數: \r\n            距離, distance - 一個數字(整數或浮點數) \r\n            龜前進指定的距離, 往龜的頭之方向。 \r\n            示例(物件名為「小龜」的實例): \r\n            >>> from turtle_tc import * \r\n            >>> 小龜= 龜類() \r\n            >>> 小龜.位置() \r\n            (0.00,0.00) \r\n            >>> 小龜.前進(25) \r\n            >>> 小龜.位置() \r\n            (25.00,0.00) \r\n            >>> 小龜.前進(-75) \r\n            >>> 小龜.位置() \r\n            (-50.00,0.00) \r\n\r\nIn this project, we will present the whole set of 18 turtle demo programs in the official python distribution translated into traditional Chinese with a convenient viewer program. With such a initial study, we hope to extend such a task to help teach Python programming to a wider audience. For those who learn reading, writing and math in their native language, usually not English, they can also learn Python programming in such a similar way.\r\n\r\n\r\nKeywords:\r\n-------- \r\nChinese programming, Python, Programming education, Turtle Graphics.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "renyuan.lyu@gmail.com", "speech_type": "Regular Talk", "tags": "Education, Turtle Graphics, Python 3,  Traditional Chinese, Translation, English as a Second Language,", "abstract": "In this project, a set of 18 turtle demo programs has been translated into traditional Chinese (tc) as an example to show the possibility to write Python code conveniently in non-English language. In such a way, it will improve code clarity and readability for non-native English speakers, according to Python PEP 3131. In personal belief, this will definitely attract more people without English fluency to programming world. This project has been done by providing a full list of tc alias (turtle_tc.py) for the official python turtle module and also a tc document file for on-line help functions. A viewer program is also provided to browse them for convinience. The whole set of programs can be found in github.\r\n\r\n[https://github.com/renyuanL/pythonTurtleInChinese/tree/master/tcExamples]", "additional_info": "Reference:\r\n---------\r\n\r\n[1] The whole set of 18 turtle demo programs\r\nhttps://github.com/renyuanL/pythonTurtleInChinese/tree/master/examples/tcExamples\r\n\r\nDemo on youtube\r\nhttp://youtu.be/sQFKjlxw2mw\r\n\r\n[2] renyuanL/pythonTurtleInChinese\r\nhttps://github.com/renyuanL/pythonTurtleInChinese\r\n\r\n[3] ChinesePython\r\nhttp://www.chinesepython.org/\r\n\r\n[4] Zhpy\r\nhttps://code.google.com/p/zhpy/\r\n\r\n[5] Computer Programming for Everybody\r\nhttps://www.python.org/doc/essays/cp4e/\r\n\r\n[6] PEP 3131 - Supporting Non-ASCII Identifiers\r\nhttps://www.python.org/dev/peps/pep-3131/\r\n", "reviews": [{"comment": "Old topic but still interesting. Recommend to be part of lightning talk.", "reviewer": "program", "rank": 2}, {"comment": "nice work and clear objective, would draw everyone's attention in a lighting show.", "reviewer": "jin", "rank": 1}, {"comment": "I think this topic is not heavy enough obviously, since there is trivial in Python3.\r\nIf there is more about changing keyword as unicode or invisible characters, it will be more fun and more content.  ", "reviewer": "apua", "rank": 1}], "id": 13, "duration": "40 mins", "title": "Python Programming in non-English Language to improve readability for non-native English speakers", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "有的時候，我們會把我們重複的 django 程式碼抽出來變成 django 套件。 但是要能夠讓人方便的重複使用，卻有很多技巧。這裏會分析 Django 常見第三方套件的製作方式。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "tim.yellow@gmail.com", "speech_type": "Regular Talk", "tags": "django", "abstract": "有的時候，我們會把我們重複的 django 程式碼抽出來變成 django 套件。 但是要能夠讓人方便的重複使用，卻有很多技巧。這裏會分析 Django 常見第三方套件的製作方式。", "additional_info": "https://docs.djangoproject.com/en/1.7/ref/applications/", "reviews": [{"comment": "The abstraction and description is not that enough and attractive, I think.", "reviewer": "drakeguan", "rank": 2}, {"comment": "It feels kind of short and likely to be rejected.", "reviewer": "keitheis", "rank": 1}, {"comment": "Interesting！", "reviewer": "c3h3", "rank": 5}, {"comment": "很難想像 Django 套件方面的技巧可以成為一個太吸引人的主題，", "reviewer": "andy", "rank": 1}], "id": 16, "duration": "40 mins", "title": "教練，我想寫  Django app 給大家用", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "今年工作上需要一個應急的 coloring print function.\r\n在查詢別人都沒有做出我滿意的工具之後, 自己做了一個,\r\n\r\n參考別人做的工具之後, 覺得我可以做更多實用設計與取捨,\r\n在重製的期間發現 Python 的 doctest, unittest, importing system, run module in CLI, pydoc,\r\n這些基本技巧如果掌握了, 能讓程式寫得很優雅, 顧及很全面.\r\n\r\n想在 lightning talk 分享, 利用這幾樣小技巧令撰寫一份小程式以加強品質加速開發, 的心得.\r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "Apua.A.Aa@gmail.com", "speech_type": "Lightning Talk", "tags": "programming", "abstract": "今年因工作需求做了一個小程式叫做 \"Color Print\".\r\n製作此工具有一些心得想要分享.", "additional_info": "Color Print README\r\n    My little project which refers below projects.\r\n    GitHub: https://github.com/apua/colorprint\r\n\r\nColorRex\r\n    A coloring command line tool.\r\n    BitBucket: https://bitbucket.org/linibou/colorex/wiki/Home\r\n\r\nColored\r\n    A module provides coloring functions.\r\n    PyPI: https://pypi.python.org/pypi/colored\r\n\r\nTermColor\r\n    Yet another module provides coloring functions.\r\n    PyPI: https://pypi.python.org/pypi/termcolor", "reviews": [{"comment": "Best practice sharing is always a good topic for lightning talk.", "reviewer": "stanley", "rank": 4}, {"comment": "- Very useful. :p like it.", "reviewer": "AlfredW", "rank": 4}], "id": 28, "duration": "40 mins", "title": "開發小工具的心得", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "內容：\r\n將以在 Taipei.py 的演講（請見 reference）為部分基礎， 再加上實際的程式碼解說（or live coding）與個人的使用經驗分享。\r\n\r\n目標：\r\n讓聽眾學會使用 pytest 的基本功能，及了解基本的測試概念\r\n\r\n\r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "excusemejoe@gmail.com", "speech_type": "Regular Talk", "tags": "py.test , unittest, testing", "abstract": "Python 擁有的 unittest 深受早期 JUnit 測試框架的影響，充斥著不太 Pythonic 的 API 與設計。然而，在近年 JUnit 早已大量使用 annotation/fixtures/asertThat ... 新元素時，難道我們還得繼續用舊方法寫測試嗎？本演講除了介紹測試神器 pytest 的主要功能以外，亦會展示如何善用 pytest  來撰寫各種類型的測試：unit testing, integration testing, functional testing。", "additional_info": "http://www.slideshare.net/excusemejoe/pytest-and-friends", "reviews": [{"comment": "According to speaker's given talk in Taipei.py https://www.youtube.com/watch?v=I2unjlSZUC8\r\n\r\nI believed it's interesting.", "reviewer": "keitheis", "rank": 4}, {"comment": "每位程序員都應該懂 unit test 並瞭解如何操作，根據講者提供的參考資料已說明這場演講的可看性。", "reviewer": "sosorry", "rank": 5}, {"comment": "Because his talk, let me start learning pytest.\r\nI can't wait to listen his wonderful talk.", "reviewer": "stanley", "rank": 5}, {"comment": "Interesting！", "reviewer": "c3h3", "rank": 5}, {"comment": "Refer to the slide in reference, I think this talk is good, and we have a talk about testing this year.\r\nBut I suggest the \"audience level\" should not be \"introduction\"\r\n.", "reviewer": "apua", "rank": 4}], "id": 83, "duration": "40 mins", "title": "快快樂樂成為 Coding Ninja (by pytest)", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "* Encoding: What is it?\r\n* The “string” abstraction.\r\n* Unicode and UTF (many flavours).\r\n* “-*- coding: utf-8 -*-”\r\n* File encoding v. declared encoding.\r\n* Unicode is not UTF-16, unless you use Notepad.\r\n* str/unicode/bytes, Python 2 and 3.\r\n* Python 3 still does it wrong: OS is bytes-based, but we’re (as Python 3 programmers) outputting strings.\r\n* The “io” module and friends (bytes-based and Unicode-based)\r\n* Maybe you need six?\r\n* Windows! All hail the command prompt! Wadaya mean we use CP950 and Big-5 and Big-5 HKSCS?", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "uranusjr@gmail.com", "speech_type": "Regular Talk", "tags": "python, encoding", "abstract": "This talk is just for you if you ever saw that dreaded “UnicodeEncodeError” when you crawl the web, process some text files, or just want to print some things to your terminal window. What is this error, anyway? I saved my file as “Unicode” already! What does this “# coding: utf-8” thing even mean? I will answer all your questions about text. Everything. Come, and fire at me.", "additional_info": "", "reviews": [{"comment": "* I believe there is always huge demand of a talk about Unicode until the next decade.\r\n* The speaker has good experience at coding :)", "reviewer": "drakeguan", "rank": 5}, {"comment": "I want to buy you a 🍺 (beer) and see if any part of our review system fail to deliver :)\r\n\r\nSeriously, a UnicodeError megapack is definitely needed for both beginners and cross-platform developers.\r\nLooking forward to an informative and entertaining talk.", "reviewer": "liang2", "rank": 5}, {"comment": "Unicode 是很容易被忽略的知識，很多人都以為自己懂，卻沒有瞭解全貌。如果講者能完整的介紹，相信一定很精彩。", "reviewer": "sosorry", "rank": 5}, {"comment": "No one is happy to see an error, especially an unicode error. I believe the speaker could turn every frown into a smile.", "reviewer": "jin", "rank": 5}, {"comment": "Definitely a good talk for developers.", "reviewer": "stanley", "rank": 5}, {"comment": "UnicodeEncodeError is the most common error I ran into while crawling the web pages. Actually, I am really curious about this bug.", "reviewer": "yudalin", "rank": 5}], "id": 84, "duration": "40 mins", "title": "UnicodeEncodeError: can't encode character in position 0", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "In this talk, the following topics will be involved\r\n\r\n1. Computational Platform, (What you think what you compute)\r\n2. Web Computation for Dynamical Systems,\r\n3. Data visualisation, (interactivity and animation),\r\n4. Setup of multi-user Python computing Server. ", "talk_perm": "Don't record my talk", "language": "English", "author": "cchuang2009@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "IPython notebook, Computations, DyLabIPy", "abstract": "Abstract\r\nTraditionally, the whole scientific workflow usually requires versatile user interface to work with, professional softwares to do computation, analysis, and make data visualization, and office suite for publication. To build up such working environment, it almost requires plenty of resources involved.\r\n\r\nAfter about ten years' development, IPython brought a breathtaking surge in this problem from its first release at 2012. IPython Notebook provides an interactive notebook interface that runs Python codes and generates the output in one's browser; moreover, output with pretty publication formats is also supported.\r\n\r\nIn this study, the project, \"On-line Laboratory for Dynamical Systems On IPython\" (DyLabIPy), will be introduced how to develop ubiquitous on-line Lab for Dynamic systems, with minimal resources but unlimited gains.\r\n\r\nKey Words: IPython Notebook, DyLabIPy", "additional_info": "[IPython]  http://ipython.org\r\n[DyLabIPy] https://github.com/cchuang2009/DyLabIPy", "reviews": [{"comment": "Good to see a practical usage of ipython and development of DyLabIPy.", "reviewer": "yuanchao", "rank": 3}, {"comment": "IPython is definitely an important tool for computationalists.  It is a good way to organize the introduction to IPython notebook with a research project.", "reviewer": "yungyuc", "rank": 4}, {"comment": "Suited to SciPy track. Although the talk is introductory one, it's IPython based development story will contribute to SciPy audience timely.", "reviewer": "whosaysni", "rank": 4}], "id": 15, "duration": "40 mins", "title": "Interactive Python Computing Integration", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "Implementation\r\ni have also written a cache based django app which mocks the Hacker News website, ranging from user, comment and stories data. This app uses the HN wrapper. It reduces the amount of code and enhances logic .\r\n\r\nIn the end if I have time, I will also talk about the django implementation of this wrapper.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "arindampradhan10@gmail.com", "speech_type": "Regular Talk", "tags": "scraping,web,django,gevent,requests", "abstract": "This talk will give an overview about creating a python wrapper for a simple api such as official hacker news json api. The wrapper is a read only client which uses requests and async gevent requests (grequests) to get a single or multiple json responses asynchronously and parse them to the wrapper model .\r\n\r\nWill speak about, how to structure your modules and writing helper functions and will give an overview about how gevent is better than parallel threaded requests.", "additional_info": "https://github.com/arindampradhan/yaaHN - wrapper for the HN API\r\n\r\nhttps://github.com/arindampradhan/mockHN - django app that uses \r\n\r\nhttps://github.com/HackerNews/API - official hacker news json api.", "reviews": [{"comment": "* We need more talks about asynchronous stuff, the mythic but fundamental technique for future development.", "reviewer": "drakeguan", "rank": 5}, {"comment": "Interesting.", "reviewer": "stanley", "rank": 5}, {"comment": "For introduction, I think showing how to make a simple wrapper is a good example.\r\nAnd it talks about coroutine technique, which will remind audience to try it.", "reviewer": "apua", "rank": 4}], "id": 17, "duration": "40 mins", "title": "python wrapping a json api", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "In this talk we discuss about the areas in which machine learning has been applied in Finance. Python has a rich library for machine learning. Common techniques of machine learning in finance include classification, regression and clustering, which belong to the general class of supervised and unsupervised learning. Classification techniques  are used for example in sentiment analysis of financial news and tweets. Clustering has been used in portfolio selection, whilst general regression has been used in various time series analysis. In this talk, we illustrate a simple example of sentiment analysis on financial news and tweets. \r\nLibraries discussed include statsmodel and sci-kit.", "talk_perm": "Don't record my talk", "language": "English", "author": "erictham115@gmail.com", "speech_type": "Regular Talk", "tags": "machine learning", "abstract": "Python has a rich library for machine learning. Common techniques of machine learning in finance include classification, regression and clustering. Classification techniques  are used for example in sentiment analysis of financial news and tweets. Clustering has been used in portfolio selection, whilst general regression has been used in various time series analysis. ", "additional_info": "", "reviews": [{"comment": "* Machine Learning + Finance!", "reviewer": "drakeguan", "rank": 4}, {"comment": "It is interesting to see how sentiment analysis combines with finance. \r\nHowever the description given is rather shallow, which didn't explicitly provide \r\nthe true detail of the method speaker is going to use.", "reviewer": "liang2", "rank": 3}, {"comment": "I believe it is a must talk for programmers who want to work in Wall Street.", "reviewer": "yudalin", "rank": 4}, {"comment": "How could us miss the chance to learning both machine learning and earning money.", "reviewer": "stanley", "rank": 5}], "id": 20, "duration": "40 mins", "title": "Machine learning in Finance using Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "I found a small feature that was added in CPython 3.4, then I tried it on my machine, but it suddenly work differently ...", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "wdv4758h@gmail.com", "speech_type": "Lightning Talk", "tags": "CPython, tarfile", "abstract": "student in NCTU,\r\nstart using Vim and write Python since 2012,\r\nlike Open Source,\r\nuse Linux all the day", "additional_info": "* https://docs.python.org/3/library/tarfile.html#command-line-interface\r\n* http://bugs.python.org/issue23421", "reviews": [{"comment": "Nice bug resolved!", "reviewer": "keitheis", "rank": 5}, {"comment": "seems interesting", "reviewer": "jin", "rank": 3}], "id": 23, "duration": "40 mins", "title": "CPython's bug in feature that nobody uses", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "- Intro to SpinPunch and our games\r\n- Requirements for our MMO game engine: big scale, low latency, high availability\r\n- MMO server architecture overview\r\n- Writing an asynchronous HTTP server with Twisted\r\n- Profiling for latency\r\n- Adding WebSockets support\r\n- Optional topic: Cross-server RPC with Twisted AMP protocol\r\n- Optional topic: Domain-specific language for builder games\r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "dmaas@maasdigital.com", "speech_type": "Regular Talk", "tags": "Twisted, Asynchronous, Games", "abstract": "Our Python server drives top MMO strategy games like \"Thunder Run: War of Clans\", with 4 million accounts and over 1,000 concurrent logins. This talk will explain the basic architecture of our server-side software, with special focus on how we use the open-source Twisted library to write high-performance, low-latency network code.\r\n\r\n我會講中文，希望可以用中文發表此演講", "additional_info": "Our game studio: http://www.spinpunch.com/\r\nOur top game: http://www.thunderrun.com/", "reviews": [{"comment": "* A topic about asynchronous tasks, seldom mentioned in PyCon APAC/Taiwan, with good and real product.\r\n* It's good to see the intro of Twisted to broaden this conference.\r\n* An foreigner giving a lecture in Chinese. What can we expect then?!", "reviewer": "drakeguan", "rank": 5}, {"comment": "Super exciting. Love to see it!", "reviewer": "keitheis", "rank": 5}, {"comment": "Great Use Case. Every one like to listen real case.  very look froward to attend the talk", "reviewer": "tim", "rank": 5}], "id": 25, "duration": "40 mins", "title": "MMO Game Server Design with Twisted Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "自從去年暑假，我開始接觸Python，正式學習一種程式語言，我發現Python很簡單就可以學起來，特別是Python裡面有個 turtle 作圖功能，與我以前國中時代的Scratch程式比起來，更為精細，能控制的東西很多，好像比較方便表達更複雜的作圖行為。\r\n\r\n過了不久，我也正式進入高中，成為高一新生，在高一的物理課程中，重新複習了國中時代就學過的牛頓力學，像是位置、速度、加速度、圓周運動、行星的軌道運動等等。有一天，我突然有個想法，是否我可以把Python和物理連在一起，把那些物理學上的運動現象，自己透過電腦程式把它們呈現出來。\r\n\r\n我就以高中物理教科書為起點，開始參考網路上有關這些物理觀念的說明，特別是wikipedia 上的文章，整理出一些相關知識，指導老師協助我在python標準函式庫中找到了 一個純用python 撰寫的程式 ”planet_and_moon.py”，就是在做太陽、地球、月球的運轉，我覺得很有價值，就把它特別閱讀清楚，一開始不懂的地方雖然很多，特別是有些特殊的龜作圖指令，我也得一一克服，還有幾個較難的Python語法，像是「類別」(class)的用法也還不大了解，藉由參加Shally老師帶領的程式俱樂部，我有機會與其他更厲害的人請教、討論，因此就越來越能理解，從中學到很多新的程式語法及用法。 因此，我也把這個程式相關的重點和原理在此整理一下並呈現出來。\r\n\r\n接著我就嘗試自己來寫程式了，我打算依序寫出以下這幾種運動的動畫程式，包含平拋運動、圓周運動、二(星)體運動以及三(星)體運動等等。我會先把我在課本上以及網路上的資訊整理下來，之後再列出我的程式碼，最後是執行它們，觀看成果。\r\n\r\n位置、速度、加速度:\r\n平拋運動:\r\n一般的二維曲線運動:\r\n圓周運動 (含簡諧運動):\r\n牛頓萬有引力定律:\r\n二體運動:\r\n三體運動:\r\n\r\n我在老師的指導下逐一完成為以上各種運動撰寫Python 程式碼，並實際運行無誤，從中也可以更改一些參數，來試玩一下，有些參數要是要經過一段時間的實驗，才會得到比較好的運轉效果，每次改過參數還需要重跑程式，雖有些不便，但隨後能直接看到改變後的結果，覺得很有趣。\r\n\r\n目前我還不大會寫圖形使用者介面(GUI)，未來將朝向這方面來學習一下。以上這些程式目前先以附錄方式列於本文後面以供參考，執行的結果的螢幕截圖如下。希望有機會在 Pycon 會議上發表這些學習成果。\r\n\r\n\f", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "calvin.lyu@gmail.com", "speech_type": "Regular Talk", "tags": "物理，作圖，教育", "abstract": "在這個專題研究中，我們打算運用 Python 以及 其龜作圖 (turtle) 模組，撰寫一套動畫程式，來輔助學習高中階段所學到的牛頓力學中與運動有關的部分，包含平拋運動、曲線運動、圓周運動、二體運動以及三體運動等等。 \r\n", "additional_info": "https://docs.python.org/3.4/library/turtle.html\r\nhttp://zh.wikipedia.org/wiki/牛頓萬有引力定律\r\nhttp://zh.wikipedia.org/wiki/牛頓運動定律\r\n http://zh.wikipedia.org/wiki/克卜勒定律\r\n http://zh.wikipedia.org/wiki/平拋運動\r\n http://zh.wikipedia.org/wiki/曲線運動\r\n http://zh.wikipedia.org/wiki/圓周運動\r\n http://zh.wikipedia.org/wiki/簡諧運動\r\n http://zh.wikipedia.org/wiki/二體問題\r\n http://zh.wikipedia.org/wiki/三體問題\r\n http://zh.wikipedia.org/wiki/混沌理論 ", "reviews": [{"comment": "- I think the content is insufficient.", "reviewer": "AlfredW", "rank": 1}, {"comment": "不錯的概念與方向，如果能更深入介紹會是很有意義的演講。適合投 lighting talk。", "reviewer": "sosorry", "rank": 2}, {"comment": " I'm so glad to see our senior high student could self learning Python.\r\nWe should encourage him to give us a talk during lightning talk track.", "reviewer": "stanley", "rank": 2}], "id": 26, "duration": "40 mins", "title": "用 Python Turtle Graphics (龜作圖) 及動畫 來輔助學習 牛頓力學 及運動學", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "先從過去的股市資訊, 配合基本股市技術分析, 以資料回測取得優良策略\r\n\r\n但這都是以過去資料來推估未來, 必需要時常變動策略以取得更好的績效\r\n\r\n新的想法是從大自然的定律推敲出可能的規律\r\n\r\n可直接推演未來走勢, 最終將不用回測資料, 直接預測下個月甚至下年走向\r\n\r\n並可以運用pycuda等分散式運算加快推演速度, 節省大量時間", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "iampf510@gmail.com", "speech_type": "Regular Talk", "tags": "Python, Future, Distributed, Fuzz", "abstract": "運用分散式運算把從日常生活看到的規律結合已知資訊推估未來股市走向\r\n\r\n", "additional_info": "", "reviews": [{"comment": "Too lack of detail, especially the explanation of「大自然的定律」. An algorithm without training, that is, without even looking at data, is generally perceived as random guess from certain probabilistic distribution. In this case a reference of technical paper should be provided so we can know how magical this new idea can be.", "reviewer": "liang2", "rank": 1}, {"comment": "很難從講者所提供的資訊判斷是否適合，無法給予高分。\r\n", "reviewer": "sosorry", "rank": 2}, {"comment": "Can't imagine how good this talk would be by this poorly organized statements.", "reviewer": "drakeguan", "rank": 1}], "id": 19, "duration": "40 mins", "title": "Predict Future", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Outline:\r\n\r\n* Introduction to our Scenario\r\n** Task Set: Bit-encoded Stream Transaction\r\n\r\n* Rapid Prototype Assembly in Python\r\n** Assembly Design Pattern\r\n** Mapping Assembly Design Pattern in Python\r\n\r\n* Converting Python to Assembly in a Week?\r\n** Happy \"Typing\" Assembly\r\n** Is Rapid Prototype Wasted?\r\n\r\n* Concluding Remarks\r\n\r\n* Resource\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "alberthuang314@gmail.com", "speech_type": "Regular Talk", "tags": "embedded", "abstract": "Bit-encoded parser in communication system is not easy to program, and usually written in C. Sometimes for lack of toolchain or reduction of memory footprint, programmers might still need to write it in assembly, and it's definitely not a happy task. The author tries to share his  happy experience on rapid prototyping this kind of parser in Python, and later coded them in assembly running in an embedded processor. ", "additional_info": "", "reviews": [{"comment": "Good topic. I wish I could see more embedded system application with Python.", "reviewer": "sosorry", "rank": 4}, {"comment": "Interesting！", "reviewer": "c3h3", "rank": 4}, {"comment": "Appealing", "reviewer": "yudalin", "rank": 4}], "id": 32, "duration": "40 mins", "title": "Happy rapid prototyping embedded assembly by Python: My Experience", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "A Benchmark report of storage devices or systems is a important thing. Because that may be a key reference for potential customers will ask for before they want to purchase. For a single device is putty easy to do a benchmark. You don't need to consider other impact factors like network bandwidth and cpu. \r\n\r\nThis session will show you what we did and got. ", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "charles0126@gmail.com", "speech_type": "Regular Talk", "tags": "ansible, automation, openstack, swift, cloud, object storage", "abstract": "Using Ansible for OpenStack Swift benchmark\r\n\r\nOutline is here, may be modified in a future.\r\n\r\n* Introduct Openstack Swift\r\n  * What's that?\r\n  * Single Node Swift (SAIO Swift) (http://docs.openstack.org/developer/swift/development_saio.html)\r\n  * Swift Cluster \r\n* Introduce Ansible \r\n  * Why\r\n  * Other tools (Fabric/Slatstack/Chef)\r\n* What's problems and pains\r\n  * Configure multiple swift nodes (swift proxy/object/container servers) without extra packages \r\n  * Deploy/manage multiple benchmark nodes\r\n  * Sweep all data in Swift nodes (Dev Cluster) \r\n  * Run a benchmark test\r\n  * Collecting benchmark result from benchmark nodes and errors from swift nodes\r\n  * Repeat it again, again and again\r\n* Use Ansible\r\n  * Define a cluster and nodes\r\n  * Deploy benchmark nodes\r\n  * Collecting and aggregate result form benchmark node\r\n  * Repeat\r\n* What's next? \r\n  * Move it to Docker?\r\n\r\n", "additional_info": "* https://swiftstack.com/blog/2013/04/18/openstack-summit-benchmarking-swift/\r\n* http://slides.com/charz/pycon2015_purposal (in progress)", "reviews": [{"comment": "Ansible for the first time", "reviewer": "marr", "rank": 4}, {"comment": "Interesting, first time to know Ansible. ", "reviewer": "AlfredW", "rank": 4}, {"comment": "There just should be at least one Ansible talk. Very exciting.", "reviewer": "keitheis", "rank": 5}, {"comment": "I'm looking forward to ansible related talk.", "reviewer": "stanley", "rank": 5}], "id": 12, "duration": "40 mins", "title": "Openstack Swift Benchmark with Ansible", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "* Existed GUI solutions\r\n    - Tkinter.\r\n    - Platform-dependent: Win32 API, Cocoa (via PyObjC), gi (on Ubuntu), etc.\r\n    - Special interpreter implementations: IronPython, Jython.\r\n    - Binding to third-party (fourth-party?) libraries: PyQt and PySide, PyGTK+, etc.\r\n    - Do-it-ourselves: PyGame, Kivy.\r\n* What should it be like:\r\n    - Cross-platform.\r\n    - Write once, install everywhere.\r\n    - Native look-and-feel.\r\n    - Pythonic (sytax-wise and conceptual-wise).\r\n    - “Just works” (no extra libraries and bindings to another language).\r\n* Mayne on the right tracks\r\n    - Pyglet\r\n        - pip-installable (no extra dependencies, no C extensions)\r\n        - Works with Windows, OS X and normal Linux distributions.\r\n        - OpenGL-based.\r\n    - Toga\r\n        - Same API, platform-dependent implementations.\r\n        - pip-installable (uses ctypes)\r\n        - Native UX (because the implementation is native)\r\n* A side issue: Python on mobile\r\n    - Hmm.\r\n    - Mobile platforms need dedicated UIs.\r\n    - Toga has primitive progress.\r\n* Looking forward: What can we do? (Well, you can always contribute.)", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "uranusjr@gmail.com", "speech_type": "Regular Talk", "tags": "gui, desktop, mobile", "abstract": "Python is a great programming language suitable for a wide variety of purposes. Among all these exciting things, however, there is one area with which Python is not great: GUI applications. In this talk, we will first take a look at existed solutions for GUI programming in Python, comparing their characteristics and features. We will then discuss how GUI programming with Python should be done in an ideal world, and what can be done (or is being done) to take us one step closer to our ideal.", "additional_info": "Pyglet: http://www.pyglet.org\r\nToga: http://pybee.org/toga/", "reviews": [{"comment": "- A future topic can fit our theme. \r\n- Now, only few people talk about GUI framework and its future, but it's useful for those who like to write tools or who just starts learning python.", "reviewer": "AlfredW", "rank": 4}, {"comment": "I like the future.", "reviewer": "keitheis", "rank": 5}, {"comment": "Although the current trend of IT is all about Web, the GUI is still the dominating the desktop devices worldwide. As one of the most popular programming languages in the world, Python should provide a solution like others.", "reviewer": "yudalin", "rank": 3}, {"comment": "I think the GUI is always a very interesting topic. It's also a nice issue which role does GUI  play when the mobile become more and more popular. Look forward to your sharing.", "reviewer": "Yen", "rank": 4}], "id": 18, "duration": "40 mins", "title": "The Future of GUI Programming with Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "This talk covers how object detection techniques are applied to discover face-like structures and pseudo-artificial structures from high resolution satellite images of Mars and other planets with python scientific tools.\r\n\r\n1. Face-like structure detection with haar-like feature based method\r\nIn order to detect face-like structures, conventional haar-like feature based detection techniques are applied. We make use of OpenCV-Python bindings with multiple pre-trained cascades, which include frontal face cascades and an anime face cascade.\r\n\r\n2. Pseudo-artificial structure detection with deep learning\r\nDeep learning has become increasingly popular due to its success in the field of visual recognition. We make use of deep convolutional neural networks with a framework called Caffe (http://caffe.berkeleyvision.org/) to detect Pseudo-artificial structures.\r\n\r\n3. About Us\r\nMarsface Project was started as a part of the International Space Apps Challenge organized by NASA (https://2015.spaceappschallenge.org/). In 2014, we were selected as a winner of Microsoft Azure for Research Award program (http://research.microsoft.com/en-us/projects/azure/) and have been offered a large amount of computing power to perform the detection tasks on the cloud platform.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "atelierhide@yahoo.co.jp", "speech_type": "SciPy Talk (English Only)", "tags": "Object Detection, Machine Learning, Deep Learning", "abstract": "The discovery of \"Face on Mars\" by NASA in 1976 has attracted widespread popular and scientific interest over the past few decades. In this project, we apply various object detection techniques, such as conventional haar-like feature based methods and state-of-the-art deep learning methods, in order to detect such pseudo-artificial structures on Mars and other planets. The scientific Python ecosystem plays a crucial role in the exploration.", "additional_info": "Project Website: http://marproject.org/index2.html\r\n\r\nProject Video: https://youtu.be/rwoW6U7GiYY\r\n\r\nFace on Moon South Pole on Wikipedia: http://en.wikipedia.org/wiki/Face_on_Moon_South_Pole\r\n\r\nPaper: https://ipsj.ixsq.nii.ac.jp/ej/index.php?active_action=repository_view_main_item_detail&page_id=13&block_id=8&item_id=102962&item_no=1\r\n\r\nTwitter: @marsfaceproject", "reviews": [{"comment": "Interesting \"entertainment computing\" project. (as declared in the japanese article) I'm interested in knowing how to define a face or an artificial object. Also what are the training samples.", "reviewer": "yuanchao", "rank": 4}, {"comment": "Python has been a popular tool for driving image recognition applications.  I would be curious how the project utilizes the Azure computing power.", "reviewer": "yungyuc", "rank": 4}, {"comment": "Fits as a SciPy talk. Solving fun topic with large scale computing platform. Relevance to Python seems to be limited to use of OpenCV bindings. ", "reviewer": "whosaysni", "rank": 4}], "id": 71, "duration": "40 mins", "title": "Marsface Project: Detecting Pseudo-artificial Structures on Mars", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "1) Keep it simple \r\nA Environment of development becomes increasingly popular with docker. We already know a lot projects of container like docker, vagrant and SaaS or PaaS Services like Google AppEngine, AWS cloud, and Heroku.\r\n\"Keep it simple by REST API on Backend Service\", How could we do this?\r\nWe would like to know what a environment of development use and what a SaaS Serivce use.\r\nAre you wish to set up for these platform?\r\n\r\nThis session will be shown if you use a Mac OS X and compare pros and cons in detail.\r\nIt will explained why the docker are useful for this. furthermore, we already know the docker-py project.\r\nHow it different docker-py and boot2docker, VMwareManager tools. We will describe the differences between.\r\n\r\n2) Web Development Stack :\r\nIt will be shown a Sample Project with Django and Docker and describe the Architecture of sample project.\r\nFor Froentend, We use a AngularJS, and use a Django and MongoDB for Backend. \r\nThis demo has a simple Shopping site. ", "talk_perm": "Don't record my talk", "language": "English", "author": "byungwook.ahn@gmail.com", "speech_type": "Regular Talk", "tags": "Docker Python Django AngularJS", "abstract": "An Environment of development becomes increasingly popular with docker. We already know a lot projects of container like docker, vagrant and SaaS or PaaS Services like Google AppEngine, AWS cloud, and Heroku.\r\nIt will be shown a Sample Project using Django and Docker, and environment of Development for this. We will explain the Architecture of sample project. At the end, it will be proved to be a fast and easy solution to set up our development environment.", "additional_info": "https://www.docker.com/\r\nhttps://github.com/docker/docker-py\r\nhttps://pypi.python.org/pypi/docker-py\r\n", "reviews": [{"comment": "Not sure about the mixed topics will work.", "reviewer": "keitheis", "rank": 1}, {"comment": "This topic should be presented in meetup, because it needs more time to explain the detail. ", "reviewer": "sosorry", "rank": 2}, {"comment": "- I didn't find any special.", "reviewer": "AlfredW", "rank": 2}], "id": 35, "duration": "40 mins", "title": "Keep it Simple, Web Development Stack ", "decision": "Rejected", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "本次跟大家分享一下運用Google Cloud上我們所建置的一套開發流程，希望透過這個流程大量降低開發上重新部署與維運的一些重複性高的動作，加速整體在開發上的速度。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "cage@mitac.com.tw", "speech_type": "Regular Talk", "tags": "GCP, GAE, Python", "abstract": "AppEngine，Googler的開發模式；Container，Googler所有運行的環境，Googler大量運用Container帶來許多架構部署的方便性。", "additional_info": "- https://cloud.google.com/appengine/docs/managed-vms/ (Managed VMs - Google App Engine — Google Cloud Platform)\r\n- https://www.youtube.com/watch?v=VyuRMkHwRTo (DevFest GDG Paris - Boost your App Engine app using Managed VMs technology - YouTube)\r\n- https://www.youtube.com/watch?v=_IeIrQFIyyU (Google Cloud Platform Live: Managed VMs Demo - YouTube)", "reviews": [{"comment": "Not sure about the specificity insight of GCP and GAE due to short description.", "reviewer": "keitheis", "rank": 2}, {"comment": "Description is too short. I'm not sure what will be covered in this talk\r\n.", "reviewer": "andy", "rank": 1}, {"comment": "Didn`t see any about Python", "reviewer": "apua", "rank": 0}], "id": 40, "duration": "40 mins", "title": "Google Managed VMs - DevOps如何在操控性與便利性之間取得彼此的優勢", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Outline (draft)\r\n\r\n- What is GIL[1]?\r\n  - Why GIL?\r\n    - Giant Lock[2]\r\n    - Other implementations: fine-grained lock[3], lock-free[4]\r\n  - What are GIL protected for?\r\n    - Interpreter state, python thread state, reference count, ...\r\n- What is the problem with GIL under MP architecture?[1]\r\n  - Some people are working on how to remove the lock.  Very difficult task.[5][6][7]\r\n=> We need to learn how to live along with GIL.\r\n\r\n- Brainless Solution: multi-process\r\n  - Use money to let you shut up.\r\n  - Example: multiprocessing[8], pp[9], pyCSP[10] (distributed computing)\r\n\r\n- Use Python/C extension to \"leave\" interpreter\r\n  - Especially suitable on CPU-bound tasks.\r\n  - Example: Cython[11], pyrex[12]\r\n\r\n- Coroutine (cooperative computing)\r\n  - Only applicable on IO-bound tasks.\r\n  - Example: pyev[13], greenlet, gevent[14]\r\n\r\n- An interpreter per thread\r\n  - Put interpreter context into Thread Local Storage?\r\n  - Sub-interpreter", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "penvirus@gmail.com", "speech_type": "Regular Talk", "tags": "multi-threading, performance, parallel computing", "abstract": "In order to achieve high throughput, we usually execute independent tasks simultaneously in a process through leveraging multi-threaded technology.  The tasks are truly parallel because multi-processor and hyper-threading technologies are quite mature in modern x86 CPU.  While thing happens within CPython, the behavior will not be what we think.  The talk addresses on CPython limitation of parallelism and enumerates some common practices to evade the seal.", "additional_info": "[1]: https://wiki.python.org/moin/GlobalInterpreterLock\r\n[2]: http://en.wikipedia.org/wiki/Giant_lock\r\n[3]: http://en.wikipedia.org/wiki/Fine-grained_locking\r\n[4]: http://en.wikipedia.org/wiki/Non-blocking_algorithm\r\n[5]: https://docs.python.org/2/faq/library.html#can-t-we-get-rid-of-the-global-interpreter-lock\r\n[6]: http://www.artima.com/weblogs/viewpost.jsp?thread=214235\r\n[7]: http://dabeaz.blogspot.tw/2011/08/inside-look-at-gil-removal-patch-of.html\r\n[8]: https://docs.python.org/2/library/multiprocessing.html\r\n[9]: http://www.parallelpython.com/\r\n[10]: https://code.google.com/p/pycsp/\r\n[11]: http://cython.org/\r\n[12]: http://www.cosc.canterbury.ac.nz/greg.ewing/python/Pyrex/\r\n[13]: https://code.google.com/p/pyev/\r\n[14]: http://www.gevent.org/", "reviews": [{"comment": "* It's an introduction-level talk? can't believe it.\r\n* Well-prepared agenda and references. It saves us time to study those essays.", "reviewer": "drakeguan", "rank": 5}, {"comment": "Great context, but hard for the python beginners.", "reviewer": "yudalin", "rank": 4}, {"comment": "It's a great topic and hard to believe just an introduction level.", "reviewer": "stanley", "rank": 5}], "id": 41, "duration": "40 mins", "title": "Global Interpreter Lock: Episode I - Break the Seal", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "ceph 提供一個免費自由，exabyte，scalable,  fault tolerant 的儲存系統，提供物件，檔案，區塊儲存功能。ceph 也是 openstack 熱門的儲存選項之一。這次演講，會介紹 ceph ，crush 演算法介紹，ceph 運作方式，以及如何用透過 python 使用 ceph 與 openstack 如何應用 ceph。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "kjellytw@gmail.com", "speech_type": "Regular Talk", "tags": "storage", "abstract": "# storage system 簡介\r\n# 簡介 ceph\r\n# ceph 運作方式\r\n# rados 介紹\r\n# rbd 介紹\r\n# 快速佈署單機版 ceph\r\n# 如何利用 python 連接 ceph", "additional_info": "", "reviews": [{"comment": "Ceph is also used by Firefox to collect crash reports. I'm very looking forward for this interesting issue.", "reviewer": "keitheis", "rank": 4}, {"comment": "The package should be interesting but the abstract and description is a little bit weak. I cannot guarantee the quality of this proposal from them. Let's cross our fingers.", "reviewer": "drakeguan", "rank": 3}, {"comment": "Look interesting.", "reviewer": "liang2", "rank": 4}, {"comment": "We should have some topics related to OpenStack :)\r\nIt is one of our silver sponsor", "reviewer": "lucemia", "rank": 5}], "id": 37, "duration": "40 mins", "title": "ceph 介紹", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "fuse 讓你可以在 userspace 下寫一個 linux 檔案系統。透過 llfuse 的 python library，你可以用 python 做一個完整的 linux 檔案系統。最後會介紹 fuse 的應用案例。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "kjellytw@gmail.com", "speech_type": "Regular Talk", "tags": "filesystm", "abstract": "1. fuse 介紹\r\n2. 示範如何用 python + llfuse 寫一個檔案系統\r\n3. fuse 的應用\r\n", "additional_info": "", "reviews": [{"comment": "用 Python 及fuse 寫檔案系統很直接簡單。\r\n由於 Abstract 和 Description 太過簡略，不清楚應用是否有趣以及是否會更深入探討。", "reviewer": "tjw", "rank": 3}, {"comment": "- 感覺是簡單的介紹", "reviewer": "AlfredW", "rank": 2}, {"comment": "I think there is a talk about FUSE in PyCon is good, but it seems there will only demo and a few application and not talk about what is FUSE, why using FUSE, how it bring benefit", "reviewer": "apua", "rank": 2}], "id": 38, "duration": "40 mins", "title": "自己的的檔案系統自己寫 - fuse 介紹", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "內容除了列出用 IPython Notebook 取代 Slides 的優缺點外，將會包含展示實際利用 IPython 來演講及教學的經驗，還有個種可能的展現方式示範。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "tzerjen@gmail.com", "speech_type": "Regular Talk", "tags": "IPython notebook, presentation, education", "abstract": "介紹利用 IPython notebook 來讓簡報更加有互動性的經驗。讓 Demo 與剪報流程合而為一，利用 IPython notebook 的互動特性，即時的讓內容呈現，每一次都能呈現最新的資訊。\r\n用 Python code 取代 Pseudo Code\r\n將實際的執行結果視覺化逐步呈現，而不是事先弄好畫好的模擬結果。", "additional_info": "", "reviews": [{"comment": "Should be fun and informative by my experience on Wei's talks. Also, IPython is 3.0 now.", "reviewer": "keitheis", "rank": 4}, {"comment": "a very practical experience sharing for IPython heavy user, like me. ", "reviewer": "jin", "rank": 5}, {"comment": "Impressive and Useful! Interactive reading experience.", "reviewer": "yudalin", "rank": 4}, {"comment": "iPython is a power tool and worth to promote it.", "reviewer": "stanley", "rank": 5}], "id": 42, "duration": "40 mins", "title": "利用 IPython Notebook 來互動簡報與教學", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "The Mega Python Tutorial", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "uranusjr@gmail.com", "speech_type": "Tutorial", "tags": "python", "abstract": "The Mega Python Tutorial", "additional_info": "http://www.codecademy.com/en/tracks/python\r\nhttps://speakerdeck.com/mosky/programming-with-python-basic\r\nhttp://tutorial.djangogirls.org/en/python_introduction/README.html", "reviews": [{"comment": "描寫太過簡略，不過相信講者能處理好這個 tutorial。Recording Perm 為 CC-BY-NC-SA 加分。", "reviewer": "tjw", "rank": 4}, {"comment": "先附上後來整理出來的新稿子:\r\n\r\n## 課程簡介\r\n\r\n不論你是否已經會寫程式，Python 都是讓你提高自身能力的絕佳工具！\r\n\r\n由於 Python 在設計初期，便針對非專業程式設計師的學習而規劃語法，因此十分注重程式碼本身易學、易讀、清晰等特性。這也使得 Python 在近年來，逐漸被廣泛作為「第一個程式語言」教授，讓第一次接觸程式的人，可以避免被太多語法規則分心，專注於程式的概念本身。\r\n\r\n對於已有程式設計經驗的人而言，Python 也可以是一個強大的助力。Python 在基本語法之上，規劃了非常豐富的標準函式庫，且經過多年的開發與修正，可以很方便達成、簡化許多任務。這種「batteries included」的特性，讓程式設計師只需要擁有 Python，就可以迅速、簡單的完成各種日常工作，而不需投入過多精力撰寫、管理實作基礎功能所需的程式碼。而對於稍微專門的應用，Python 也提供了管理第三方套件的機制「pip」，讓使用者能夠輕鬆取得超過五萬個函式庫，足以應付絕大多數的程式設計需求。\r\n\r\n但 Python 也不只是一個用來撰寫小工具的簡單語言。許多大、中型專案中，都十分大量的使用 Python，尤其在網頁伺服器端開發上，隨著 WSGI 介面被廣泛應用，越來越多網站開始選擇以 Python 建構。在 Python 不足以單獨應付需求的情況下，Python 也提供了與 C、C++、甚至 C# 或者 Java 程式溝通的介面。\r\n\r\n## 適合對象\r\n\r\n這個課程最適合已經有一點點程式經驗的人；我們會在這個課程中，逐步了解 Python 的各種特性，讓你完整發揮 Python 的功能，完成程式設計時會遇到的問題。但即使你沒有太多程式經驗，也能夠在這個課程中學到基本的 Python 技能，是入門程式設計的好方法。\r\n\r\n## 課程大綱\r\n\r\n* Python 直譯器基礎\r\n* 基本型別、物件、變數\r\n* 函式\r\n* 例外處理\r\n* Python 程式風格指南：PEP 8\r\n* 內建函式與函式庫\r\n* 如何使用第三方函式庫\r\n\r\n## 注意事項\r\n\r\n為了課程順暢，教學當天將會假設你已經將 Python 安裝完成。若你擁有自己的筆記型電腦，我們強烈建議可以先在上面安裝 Python 3.4.3，並在教學當天攜帶至課堂上使用。這樣可以保證你未來能夠在自己的電腦上，繼續使用相同的環境，或者也可以經由這次經驗，了解未來如何在其他電腦上建構同樣的環境。\r\n\r\n如果你沒有筆記型電腦，教學當天將會提供已經安裝 Python 的桌上型電腦。雖然如此，我們同樣希望你同樣能在自己的電腦上先完成安裝 Python 3.4.3。這樣子，如果在安裝或設定上遇到問題，我們也可以在課程當天協助排除，讓你能夠在未來使用。\r\n\r\n注意：本教學將使用 Python 3 進行。即使已經安裝 Python 2，也請麻煩另外按照教學安裝此版本。\r\n\r\nPython 3.4.3 安裝教學：https://gist.github.com/uranusjr/6fa2770a8c8651192e93", "reviewer": "marr", "rank": 4}], "id": 43, "duration": "Whole Day", "title": "Python Tutorial", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": ">Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.\r\n\r\n-- Brian W. Kernighan has written in his book \"The Elements of Programming Style\".\r\n\r\nAlmost everybody who has fought any strange and mysterious bug will agree with that. But what help us to overcome this challenge? These are our helpers - debugging tools, that are commonly known as debuggers. Everybody know about them and many use constantly. But how are they actually implemented?\r\n\r\nIn the talk we will look inside a Python debugger used by modern Python IDEs like PyCharm and Pydev and learn about it's internals.\r\n\r\nWe start by learning what means of code tracing are provided by Python standard library and will try to implement a simple command-line debugger from scratch.\r\n\r\nThen we proceed to a full fledged debugger and will think a bit about it's architecture and how it can be implemented.\r\n\r\nAfter that we will focus on some interesting features:\r\n\r\nDebugging of multiple processes We have seen how to debug multithreaded code. But what about multiple processes? How can we deal with that? We will learn that it is easy.\r\n\r\nDebugging of Python code is ok. But what if we work with Django or Jinja2 templates and want to debug them too? We will learn how can be debugger extended to allow doing that.\r\n\r\nAttaching to a process We can launch a process in debug mode. But what if we need to attach to already running process? That is also possible and we will see how.\r\n\r\nIn the end we will look where to find the sources of the real debuggers and how to contribute if we want to do that. \r\n\r\n\r\n\r\n\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "trofimov.dmitry@gmail.com", "speech_type": "Regular Talk", "tags": "Python, debugger, IDE, Django, developer tools", "abstract": "This talk will explain how to implement a debugger for Python. We'll start with simple command line debugger, then look how it is implemented in modern IDEs like PyCharm and Pydev. Then we go further in the details and uncover the tricks used to implement some interesting features like multiprocess debugging, debugging of Django and Jinja2 templates and attaching to a launched Python process. ", "additional_info": "This is the debugger project I will be talking about: https://github.com/fabioz/PyDev.Debugger\r\n\r\n", "reviews": [{"comment": "I generally like this topic, and description seems to be written thoroughly. ", "reviewer": "tjw", "rank": 4}, {"comment": "It's very exciting to hear the maintainer of PyDev and LiClipse to talk about debug.", "reviewer": "keitheis", "rank": 5}, {"comment": "As for me, debugging is as three times as hard as writing the code. So a professional way of debugging is really appealing.", "reviewer": "yudalin", "rank": 4}], "id": 39, "duration": "40 mins", "title": "Python Debugger Uncovered", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "從最基礎的一般網頁抓取技巧到Ajax頁面的抓取技巧", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "iampf510@gmail.com", "speech_type": "Lightning Talk", "tags": "Python, Crawler", "abstract": "講一些平常在做網頁爬蟲時的小技巧", "additional_info": "", "reviews": [{"comment": "Seems to be ok as a lightning talk", "reviewer": "tjw", "rank": 4}], "id": 44, "duration": "40 mins", "title": "網頁爬蟲由淺入淺", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "This session would conver the following topics:\r\n1. The features of MySQL Fabric\r\n2. MySQL Fabric architecture\r\n3. The procedures using MySQL Fabric to support manage MySQL server farm\r\n4. How MySQL Fabric supports high availablity by auto confiure replication and auto failover\r\n5. How MySQL supports scalability by auto sharding data across multiple MySQL database\r\n6. The road map and next steps", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "tu.ivan@gmail.com", "speech_type": "Regular Talk", "tags": "MySQL Fabric ", "abstract": "MySQL Fabric is the latest GPL product that offered by MySQL develop team, it is a extensible framework developed by Python that manages farms of MySQL Servers. Two primary features have been implemented - High Availability (HA) and scaling out using data sharding. MySQL Fabric also provides server provisioning using cloud frameworks such as OpenStack. By join this session the audience would knows how to create highly scalable, highly available and resilient database service with MySQL Fabric", "additional_info": "\r\nhttp://voicefromoldsoul.blogspot.jp/2014/08/mysql-fabric.html\r\nhttp://voicefromoldsoul.blogspot.jp/2014/07/mysql-fabric.html", "reviews": [{"comment": "* I'm not MySQL expert such that I can't evaluate the value and future of MySQL Fabric.", "reviewer": "drakeguan", "rank": 3}, {"comment": "The interesting point to me is to see how Python is used in MySQL Fabric by its design and implement.", "reviewer": "keitheis", "rank": 3}, {"comment": "MySQL Fabric is for grouping database servers to be a server farm. It use the concept of \"data shading\" to replicate data to different server group to make sure the data has HA. Any programmer using MySQL to be their core database system is recommend to has the concept of MySQL Fabric.", "reviewer": "stanley", "rank": 3}, {"comment": "Looks like it will not talk about Python, but just written in Python.\r\nFurthermore, it doesn`t desire to describe the technique and how it works.", "reviewer": "apua", "rank": 1}], "id": 45, "duration": "40 mins", "title": "MySQL Fabric, next generation application transplant high scalable and fault tourant solution", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": " - Reasons and problems of using multiple IaaS providers\r\nSince country regulations play an important role in IaaS services, hosting worldwide cloud services inevitably result in running the service on different IaaS providers.\r\n\r\nHowever, running cloud services across IaaS providers would involve dealing with different IaaS structure, utilities and API. This could get things complicated and messy when the service scale grows large. Service operation team requires new generation automation tools to help service managements.\r\n\r\n - Why Ccloud\r\nA well-designed automation cloud service deployment tool not only increases the efficiency of deployments and maintenances, but also significantly reduces the chances of human error.\r\n\r\nTraditionally, server management relies on IT automation tools such as Ansible or Salt to help reduce performing routine jobs during server deployment. They work well when parallel run batches of commands on virtual machines from one IaaS provider. But the script complexity would dramatically increase when virtual machines from different IaaS providers joined.\r\n\r\nMoreover, different IaaS providers tend to build their unique management utilities. This introduces additional effort when operation team intends to monitor and maintain services. After surveyed different solutions, we decided to build our own utility, which provides a universal interface across different IaaS provider.\r\n\r\n - What Ccloud does\r\nThe Ccloud covers most of the frequently used functionally for maintaining cloud services, from cluster deployment to virtual machine status check and service update.\r\n\r\nTaking the advantage of ‘glue language’ property of Python, the Ccloud runs the utilities from different IaaS providers, and return a clean and universal user interface to the service management team. The users can easily define the clusters they need in a Json formatted configuration file. The Ccloud will then translate the commands from users to the specified IaaS provider utilities.\r\n\r\n - CLI (command line interface) vs SDK (software development kits)\r\nIaaS providers usually support both CLI and SDK for automation tools developments. After trying on both of them for a while, we consider using SDL would be a better choice. The advantage of using CLI is that it came with built-in basic input verification that would prevent some human errors. But these verifications came with the cost of longer execution time. Eventually, we decided to implement the input verification by our own to maximize the efficiency of the Ccloud.\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "sean_hsueh@htc.com", "speech_type": "Regular Talk", "tags": "IaaS, Cloud service, Deployment", "abstract": "With the scope of cloud services grow from local to worldwide, the need of hosting cloud services across IaaS providers emerged. This brings new challenges to cloud services monitor and managements. The Ccloud is our solution to provide a unified user interface for cloud service managements across IaaS providers. Moreover, the Ccloud serves as an automation service management utility that greatly improves the efficiency and minimizes the possible operation errors.", "additional_info": "OUTLINE\r\n1.\tIntro (8 min)\r\n    - Who we are\r\n    - Why run across IaaS providers\r\n2.\tWhy Ccloud (10 min)\r\n    - Importance of cloud service management automation tools\r\n    - Shortage of traditional cloud service management automation tools\r\n    - Purpose of Ccloud\r\n3.\tWhat Ccloud provides (15 min)\r\n    - The structure of Ccloud\r\n    - Define the cluster in the configuration files\r\n    - Functionalists provided by Ccloud\r\n4.\tUsing CLI or SDK? (5 min)\r\n5.\tQ&A (7 min)\r\n", "reviews": [{"comment": "Kind of sponsor demo talk. Maybe fine if it's a conference sponsor.", "reviewer": "keitheis", "rank": 1}, {"comment": "Seems like a talk for product demo.", "reviewer": "andy", "rank": 1}, {"comment": "cCloud is a product but a technique, and it looks like no technique about Python there.", "reviewer": "apua", "rank": 0}], "id": 46, "duration": "40 mins", "title": "Dealing with cloudy days: managing cloud services across IaaS providers in Python", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Introduce pyirrlicht, the Python binding of the Irrlicht 3D rendering engine.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "fieliapm@gmail.com", "speech_type": "Lightning Talk", "tags": "game, realtime_3d_rendering", "abstract": "Python becomes more stronger in many domains. However it lost some supporting in game development community. Boo will be removed from Unity. Most of active game frameworks, 3D rendering engines, and game development solutions is based on C++, don't offer Python binding. If we want to develop a modern game, what should we use?\r\nTo develop game in Python, we might hear Cocos2d already. But its 3D rendering is not highly customable even if it support 3D rendering in recent version. Fortunately, we can also use pyirrlicht, the Python binding of the famous Irrlicht rendering engine. If we want to make game we developed looks better, I think the elegant structure and rich feature of the Irrlicht framework will become solid stepstone for every Python game developer.", "additional_info": "http://irrlicht.sourceforge.net/\r\nhttp://sourceforge.net/projects/pir/", "reviews": [{"comment": "* I'm always interested to know the multimedia work done by Python.", "reviewer": "drakeguan", "rank": 3}, {"comment": "Game development is one of my favorite topic, with Python!", "reviewer": "keitheis", "rank": 4}, {"comment": "Game engine looks nice.", "reviewer": "liang2", "rank": 3}, {"comment": "Programming a game with Python?! Sounds great.", "reviewer": "yudalin", "rank": 4}, {"comment": "Sounds a very special topic in PyCon. Will you demo some  3D application? Look forward to your project!", "reviewer": "Yen", "rank": 4}, {"comment": "According to abstract and description, I didn`t see how speaker will describe pyirrlicht and Irrlicht. It makes my worry about quality of the talk.", "reviewer": "apua", "rank": 2}, {"comment": "3D game, sounds interesting.", "reviewer": "stanley", "rank": 4}], "id": 21, "duration": "40 mins", "title": "Show your game development idea with pyirrlicht", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "大綱:\r\nA. 數位訊號處理簡介（一小時）\r\n    1. 數位訊號的應用\r\n    2. 用 NumPy 來表示訊號\r\n    3. Digital frequency\r\n    4. 取樣以及實際的頻率\r\n    5. 雜訊、平均訊號以及 dB 是怎麼回事\r\nB. Digital sequences and operations（一小時）\r\n    1. Convolution 與 auto correlation\r\n    2. Moving average filter\r\n    3. 數位訊號運算表示法\r\n    4. z transform\r\n        a. 為什麼要有各種 transform? （非常重要）\r\n        b. z transform 基礎\r\n        c. 系統穩定度\r\n    5. 回授以及他的重要性\r\n    6. 因果系統(Causal systems)\r\nC. DFT（兩小時）\r\n    1. 為什麼又要有個不同的 transform?\r\n    2. DFT 的運作原理，以 8-point DFT 為例\r\n    3. DFT 一些重要的性質\r\n    4. DFT 與 DCT（在影像處理有用到） 的關係\r\nD. FFT（一小時）\r\n    1. FFT 與 DFT 的關係\r\n    2. 在 SciPy 中使用 FFT/FFTW\r\nE. SciPy 在訊號處理上的功能（半小時）\r\n    1. lfilter\r\n    2. filter design tool\r\n    3. Summarize FFT, again\r\nF. 進階功能（optional，依課程進度而決定）\r\n    1. PID filter 以及自動控制的應用\r\n    2. Interpolation: linear, cubic, sinc\r\n    3. Hilbert transform\r\n    4. Wiener filter\r\n", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "alberthuang314@gmail.com", "speech_type": "Tutorial", "tags": "dsp,scipy,IoT", "abstract": "在這個 IoT 興起的時代，程式設計師跟外界實體世界連接的需求大幅增加，舉凡各式各樣的感測器、通訊、語音處理、噪音消除、機器人自動控制、四軸飛行器等等，都有數位訊號的基礎在裡面，然而一般學校的課程要上一整個學期，對於實務上需要使用數位訊號處理的人員來說，花費太長時間建立觀念，講者以他資訊工程研究所畢業，隨後在通訊 IC 的 DSP 部門任職八年的經驗跟 CS 領域或其他非理工領域的人分享學習經驗，本課程著重在如何用視覺化的方式建立直觀，並且用 Python NumPy/SciPy 當作範例讓學員除了在課堂吸收之外，回去還可以操作範例，以建立更深刻的觀念，減緩學習曲線，進而能實際應用數位訊號處理技巧。", "additional_info": "This tutorial could be in English or Mandarin. ", "reviews": [{"comment": "Let's do it.", "reviewer": "marr", "rank": 5}, {"comment": "Seems to be really well prepared.", "reviewer": "tjw", "rank": 5}, {"comment": "豐富且吸引人的大綱，我怎麼可能會錯過這場 tutorial 呢？", "reviewer": "sosorry", "rank": 5}, {"comment": "Digital Python is all time interesting.", "reviewer": "keitheis", "rank": 5}, {"comment": "Nice!", "reviewer": "c3h3", "rank": 5}], "id": 31, "duration": "Whole Day", "title": "用 Python 學習數位訊號處理", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "There will be three topics in the talk: (1) static map applications, (2) interactive map applications, and (3) real time Google Earth applications.\r\n\r\nIn the first topic, the use of python with Google Static Maps API to create static map images will be demonstrated.  By embedding the center and marker locations as query strings in the url, a static image will be created and returned on request.\r\n\r\nIn the second topic, Flask-GoogleMaps and Folium will be introduced to create interactive map applications.  Flask-GoogleMaps is an extension for Flask micro-framework to simplify the creation of interactive maps, and Folium is a python package used to generate HTML files with leaflet.js embedded for manipulating OpenStreetMap. \r\n\r\nIn the last topic, the markup language for geospatial information called Keyhole Markup Language will be introduced.  The network link concept of KML will be elaborated.  A real time Google Earth application with randomly generated coordinates will be demonstrated to conclude the talk.", "talk_perm": "Don't record my talk", "language": "English", "author": "victorgau@gmail.com", "speech_type": "Regular Talk", "tags": "Google Maps, Google Earth, OpenStreetMap", "abstract": "When it comes to creating map applications, javascript is always the first choice among different languages.  Little do people know that it is actually very easy to create map applications by using Python.  In this talk, three topics will be covered: (1) static map applications, (2) interactive map applications, and (3) real time Google Earth applications.  In the first topic, I will demonstrate how to use python with Google Static Maps API to create static map images.  After that, Flask-GoogleMaps and Folium will be introduced to create interactive map applications.  Finally, I will demonstrate how to use python to create real time Google Earth applications.", "additional_info": "1.Google Static Maps API (https://developers.google.com/maps/documentation/staticmaps/?hl=zh-tw)\r\n2.Flask-GoogleMaps (https://github.com/rochacbruno/Flask-GoogleMaps)\r\n3.Folium (http://folium.readthedocs.org/en/latest/)\r\n4.KML (Keyhole Markup Language) (https://developers.google.com/kml/)\r\n5.Python CGIHTTPServer (https://docs.python.org/2/library/cgihttpserver.html)\r\n6.Google Earth (https://www.google.com/earth/)", "reviews": [{"comment": "It's interesting to see the Google Maps, Google Earth, OpenStreetMap, and Flask-GoogleMaps in PyCon.", "reviewer": "keitheis", "rank": 4}, {"comment": "Interesting topic.", "reviewer": "stanley", "rank": 4}, {"comment": "I think it is much about Google API and less about Python. Though it is still a good example to connect tools within Python", "reviewer": "apua", "rank": 2}, {"comment": "looks fine", "reviewer": "tjw", "rank": 4}], "id": 63, "duration": "40 mins", "title": "Easy Map Applications Using Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Scrapy is a open source python web scraping framework. It can extract structured data to simply the data extraction process during web scraping, and it provides some other features which provides a good web scraping tool for python developers.\r\n\r\nSammy started to write his first web scraper in 2000 in perl, and switched to PHP in 2003 and then Python in 2008. In this talk, Sammy will introduce scrapy and demonstrate how to use its XPath selector to extract data from web sites, and store data with its built-in outputs as well as Django web framework.\r\n\r\nSammy released some open source projects to extract different data to promote open data movements in Hong Kong, for examples. weather data, air quality data.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "sammy@sammy.hk", "speech_type": "Regular Talk", "tags": "scrapy, web, scraping", "abstract": "Scrapy is a open source python web scraping framework. It can extract structured data to simply the data extraction process during web scraping, and it provides some other features which provides a good web scraping tool for python developers.", "additional_info": "Scrapy: http://scrapy.org\r\nSammy Fung's GitHub: https://github.com/sammyfung", "reviews": [{"comment": "Lack of originality and the subject are well explored by similar talks of\r\nprevious PyCons.", "reviewer": "liang2", "rank": 2}, {"comment": "Just like a one-page official tutorial?", "reviewer": "drakeguan", "rank": 1}, {"comment": "It looks like a example code on the official web page", "reviewer": "yudalin", "rank": 2}], "id": 49, "duration": "40 mins", "title": "Scrapy: web scraping framework in python", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "The talk will be from a beginner's perspective in Python and listing out all the habits that was picked up along the way. The talk will then give a beginner's perspective on Django and how learning and programming Django forced me to rethink my methods of programming in Python and how to implement things correctly. \r\n\r\nIt will be a journey on how one goes about to learn about Django and how it benefits in improving programming in general.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "rahman@marimore.co.jp", "speech_type": "Regular Talk", "tags": "django, learning, beginner", "abstract": "The talk is basically for beginners by a beginner in Django. It will start with the journey in Python and how along the way bad habits start to form and influence the style of programming.\r\n\r\nThen it will be about the first journey into Django, and how programming in Django forces the bad habit to be fixed just to make it work.", "additional_info": "Learning Python the Hard Way", "reviews": [{"comment": "Might be interesting.", "reviewer": "drakeguan", "rank": 2}, {"comment": "It would be more suitable to give us his sharing in lightning talk.", "reviewer": "stanley", "rank": 2}, {"comment": "May be more suitable in lightning talk.", "reviewer": "andy", "rank": 2}], "id": 67, "duration": "40 mins", "title": "How Django fixed my bad Python habits", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Using Python, I have developed a program that aids in the analysis of packet data for Deep Packet Inspection. Deep Packet Inspection is a process mainly used in network security to ensure integrity of network data sent across the network. Deep Packet Inspection is used to pre-empt and prevent malicious data from being transmitted over a network in order to ensure the security of the organization. ", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "lee.yangpeng@dhs.sg", "speech_type": "Lightning Talk", "tags": "network security, packets, protocols", "abstract": "Almost everybody in the world, including ourselves, is connected by the Internet; we are connected to the Internet at home, at work, and even on our mobile phones. In a commercial setting, network security is particularly important, in order to prevent threats such as commercial espionage and malware infection of the network. In order to monitor a network for security purposes, a process known as Deep Packet Inspection is applied. This is a method of establishing baseline behaviour for the network so that anomalous behaviour can be detected. However, there are two challenges to performing Deep Packet Inspection effectively. The first is to obtain the specifications of the protocols involved in the network. It is difficult to perform Deep Packet Inspection on proprietary protocols with no public documentation. The second challenge is the problem of scale; it is difficult to incorporate knowledge of the large variety of protocols in a typical network setting, especially when they are not even known prior to deployment.\r\n\r\nI developed and evaluated Analytics, a tool that can help in the analysis of packet data for Deep Packet Inspection. Analytics is a library consisting of functions that support manual analysis. Analytics attempts to discover constants, enumeration fields, and strings among packet data; it also provides visualization to aid analysts. My experiments show that Analytics has an average accuracy in detecting constants of 76.8% and an average accuracy in detecting enumeration fields of 88.6%. Analytics is applicable to analyzing network environments with proprietary or unknown protocols.\r\n\r\nFrom my talk, audience can learn about the importance of network security and how a network can be compromised by malicious software (malware). Left unhindered, these malware can destroy an organization by committing commercial espionage, leak company secrets, or control the computers connected to the network to perform illegal activities. Audience can also benefit from my talk by learning about Deep Packet Inspection, a common process used in large organizations to maintain network security and prevent the transfer or malicious data through a network. Experts in the field can appreciate the tool, 'Analytics', that I have made in Python with the main application in aiding Deep Packet Inspection. I will also compare my product with other similar tools used industrially to provide a more insightful talk and keep it relevant.", "additional_info": "Hello everyone! I'm a 16-year-old student in Dunman High School, Singapore! I've learned C++ when I was 13-years-old and Python when I was 15. I have participated in a number of Computing/Technology competitions in Singapore recently, including National Olympiad of Informatics(NOI), Google Code-in, and Google Code Jam. Currently I am studying A-level Computing in school. I have a Python project that was done during my free time with experienced mentors that I would like to share with you! :)\r\n\r\nThis project is currently shortlisted for the Finals of SSEF (Singapore Science & Engineering Fair) 2015, and pending acceptance into IEEE and Pycon SG", "reviews": [{"comment": "Nice Talk!", "reviewer": "c3h3", "rank": 5}], "id": 51, "duration": "40 mins", "title": "Network Security and Analysis system with Python ", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Using Python, I have developed a program that aids in the analysis of packet data for Deep Packet Inspection. Deep Packet Inspection is a process mainly used in network security to ensure integrity of network data sent across the network. Deep Packet Inspection is used to pre-empt and prevent malicious data from being transmitted over a network in order to ensure the security of the organization. ", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "lee.yangpeng@dhs.sg", "speech_type": "Regular Talk", "tags": "network security, packets, protocols", "abstract": "Almost everybody in the world, including ourselves, is connected by the Internet; we are connected to the Internet at home, at work, and even on our mobile phones. In a commercial setting, network security is particularly important, in order to prevent threats such as commercial espionage and malware infection of the network. In order to monitor a network for security purposes, a process known as Deep Packet Inspection is applied. This is a method of establishing baseline behaviour for the network so that anomalous behaviour can be detected. However, there are two challenges to performing Deep Packet Inspection effectively. The first is to obtain the specifications of the protocols involved in the network. It is difficult to perform Deep Packet Inspection on proprietary protocols with no public documentation. The second challenge is the problem of scale; it is difficult to incorporate knowledge of the large variety of protocols in a typical network setting, especially when they are not even known prior to deployment.\r\n\r\nI developed and evaluated Analytics, a tool that can help in the analysis of packet data for Deep Packet Inspection. Analytics is a library consisting of functions that support manual analysis. Analytics attempts to discover constants, enumeration fields, and strings among packet data; it also provides visualization to aid analysts. My experiments show that Analytics has an average accuracy in detecting constants of 76.8% and an average accuracy in detecting enumeration fields of 88.6%. Analytics is applicable to analyzing network environments with proprietary or unknown protocols.\r\n\r\nFrom my talk, audience can learn about the importance of network security and how a network can be compromised by malicious software (malware). Left unhindered, these malware can destroy an organization by committing commercial espionage, leak company secrets, or control the computers connected to the network to perform illegal activities. Audience can also benefit from my talk by learning about Deep Packet Inspection, a common process used in large organizations to maintain network security and prevent the transfer or malicious data through a network. Experts in the field can appreciate the tool, 'Analytics', that I have made in Python with the main application in aiding Deep Packet Inspection. I will also compare my product with other similar tools used industrially to provide a more insightful talk and keep it relevant.", "additional_info": "Hello everyone! I'm a 16-year-old student in Dunman High School, Singapore! I've learned C++ when I was 13-years-old and Python when I was 15. I have participated in a number of Computing/Technology competitions in Singapore recently, including National Olympiad of Informatics(NOI), Google Code-in, and Google Code Jam. Currently I am studying A-level Computing in school. I have a Python project that was done during my free time with experienced mentors that I would like to share with you! :)\r\n\r\nThis project is currently shortlisted for the Finals of SSEF (Singapore Science & Engineering Fair) 2015, and pending acceptance into IEEE and Pycon SG", "reviews": [{"comment": "It seems serious and detail (according to the abstract PDF) given by a young student from Singapore.", "reviewer": "keitheis", "rank": 3}, {"comment": "definitely can not say no to the topic, but she/he did this project all by herself/himself ???!!! ", "reviewer": "jin", "rank": 3}, {"comment": "Young and talent speaker. But I thought the deep packet inspection is not the emerging technology.", "reviewer": "sosorry", "rank": 3}, {"comment": "It's seldom to hear network security application by Python.\r\nIt should be fun~", "reviewer": "stanley", "rank": 5}, {"comment": "Really want to know this genius.", "reviewer": "yudalin", "rank": 4}, {"comment": "cool", "reviewer": "tjw", "rank": 4}], "id": 52, "duration": "40 mins", "title": "Network Security and Analysis system with Python ", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "I'll provide typical use cases of the API (as our CLI uses our API).\r\nSo its not just running commands but also showing the internals of the CLI and how it calls our API. I'll see if its possible to add even some information what happens on our back-end.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "thomas.kuiper@gandi.net", "speech_type": "Regular Talk", "tags": "domain names, virtual machines, paas", "abstract": "Written in Python, Gandi CLI is an open source command line tool to interface with Gandi's APIs. It can be used to create and manage hosting instances (Gandi IaaS and PaaS), generate and manage SSL certificates, manage domain names and their zones, as well as all other domain name-related Gandi services (such as Gandimail, Gandisite).\r\nGandi's API is provided free of charge.", "additional_info": "http://cli.gandi.net/\r\nhttp://doc.rpc.gandi.net/\r\nhttps://github.com/Gandi/gandi.cli/", "reviews": [], "id": 108, "duration": "40 mins", "title": "Gandi CLI", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Sphinx provides a internationalization (i18n) feature.\r\nIf you translate some sphinx document without using the i18n feature, you need to rewrite original document source files. But this approach has three problems:\r\n\r\n1. You must be careful to maintain reStructuredText structure.\r\n2. It's hard to divide translation tasks for a number of volunteer translators.\r\n3. It's hard to pursue the upstream document source that is frequently updated.\r\n\r\nAnd so, sphinx i18n feature will support our translation.\r\nSince Sphinx supports extracting/injecting gettext format translation catalog, you can use helpful tools/services easily that provide translation support features like a translation memory, recommending similar translation, glossary and auto-translation.\r\nBy using such translation support services, document translation with Sphinx can be carried out as follows:\r\n\r\n1. You can translate for each paragraphs (Sphinx will output gettext msgid for paragraphs).\r\n2. You can translate more than one person at the same time.\r\n3. You can use helpful translation support features.\r\n\r\nIf you use such a service, volunteers are more likely to participate in the translation.\r\nSphinx-users.jp team built a translation flow with using sphinx and the transifex service.\r\nIn addition, we have automated the entire process using the drone.io service.\r\n\r\nAs a result of this,\r\n(A) translation source entries on the transifex will be updated automatically when original documentation is changed.\r\n(B) translated document page will be updated when each entries is translated on the transifex.\r\nIn this session, I'll explain 3 things; (1) entier process to translate sphinx docs. (2) automation mechanism for the process. (3) tips, tricks and traps for wrinting docs and translating.\r\n\r\nTarget:\r\n\r\n- Who want to translate documentation written by sphinx into local language \r\n- Who want to forcus to translation\r\n- Who need translation contributors and manage them easily\r\n\r\nOutline:\r\n\r\n* Self introduction (2 min)\r\n\r\n* Sphinx introduction (2 min)\r\n\r\n  * What is Sphinx?\r\n  * Sphinx examples\r\n\r\n* How do you translate Sphinx documentation? (5 min)\r\n\r\n  * Rewriting source files\r\n  * ...\r\n\r\n* Sphinx i18n feature (5 min)\r\n\r\n  * make pot files by using \"make gettext\"\r\n  * translate pot files into po files\r\n  * build a translated document by using translated gettext catalogs\r\n\r\n* Automated translation process with several services (10 min)\r\n\r\n  * github push web hook invoke drone.io\r\n  * drone.io executes \"make gettext\" and uploads pot files to transifex\r\n  * transifex translation\r\n  * transifex invoke web hook drone.io\r\n  * drone.io executes \"make html\" with using po files and deploy html files\r\n\r\n* tips, tricks, traps (10 min)\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "shimizukawa@gmail.com", "speech_type": "Regular Talk", "tags": "sphinx, documentation, translation, internationalization, i18n, ", "abstract": "Sphinx can extract paragraphs from sphinx document and store them into gettext format translation catalog files.\r\nGettext format translation catalog is easy to translate from one language to other languages.\r\nAlso Sphinx support internationalization by using such catalog files.\r\nYou can use your favolite editors or services to translate your sphinx docs.\r\nIn this session, I'll explain 3 things; (1) entier process to translate sphinx docs. (2) automation mechanism for the process. (3) tips, tricks and traps for wrinting docs and translating.\r\n", "additional_info": "- http://sphinx-doc.org/intl.html\r\n- http://docs.sphinx-users.jp/intl.html\r\n- https://drone.io/bitbucket.org/shimizukawa/sphinx-doc13\r\n", "reviews": [{"comment": "Description is very detailed, seems to be well prepared. Wondering how well this approach works. ", "reviewer": "tjw", "rank": 4}, {"comment": "* Getting involved in world-wide open-source project is the must-to-promote topic all the time!\r\n* Documentation is hard to usual developers, but we all know it means something in your coding life.\r\n* I think there is always a need to talk about Sphinx and documentation until we are fully surrounded by well-doced projects.", "reviewer": "drakeguan", "rank": 5}, {"comment": "Great and useful! Really looking forward this talk!", "reviewer": "yudalin", "rank": 4}, {"comment": "We should always encourage the audience to contribute themselves to  open source project.\r\nAnd sphinx is also a good project.", "reviewer": "stanley", "rank": 4}, {"comment": "Special~ It will be a good example of making sphinx add-on", "reviewer": "apua", "rank": 4}], "id": 50, "duration": "40 mins", "title": "Easy contributable internationalizatoin process with Sphinx", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Outline (draft)\r\n\r\n- What is ZoneIDAProc?\r\n  - Linux proc[1]\r\n  - VFS[2]\r\n  - FUSE[3]\r\n- IDAProc\r\n  - Linux proc-like\r\n    - Example: read customized data\r\n    - Example: read/write internal variable\r\n    - Example: expose all interested symbols\r\n  - Instrumentation[4]\r\n    - Example: attach to a live python process and inject code\r\n    - Race condition", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "penvirus@gmail.com", "speech_type": "Regular Talk", "tags": "Linux", "abstract": "ZoneIDAProc provides an easy way to export Linux proc-like interface for python program.  It is intuitive and convenient for showing process internal data; even expose a complex computation.  The talk focuses on demonstrating the magic of ZoneIDA and how it increases your program's versatility.", "additional_info": "[1]: http://www.tldp.org/LDP/Linux-Filesystem-Hierarchy/html/proc.html\r\n[2]: http://en.wikipedia.org/wiki/Virtual_file_system\r\n[3]: http://fuse.sourceforge.net/\r\n[4]: http://en.wikipedia.org/wiki/Instrumentation_%28computer_programming%29", "reviews": [{"comment": "- it's dll/code injection for python process, and you can manipulate other process.\r\n- Little geek. It's security topic.", "reviewer": "AlfredW", "rank": 4}, {"comment": "I think it is a good tool for profiling and hacking.  look forward to benefit all our attendee ", "reviewer": "tim", "rank": 3}, {"comment": "Consider the draft, I think the talk will give a good introduction and demo.\r\nIt is not a hot topic, but about secure, so I think it is important and useful.", "reviewer": "apua", "rank": 4}, {"comment": "It should be awsome.", "reviewer": "stanley", "rank": 5}], "id": 53, "duration": "40 mins", "title": "ZoneIDAProc: Instrumentation-based Dynamic Accessing", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "We utilized 16 networked Raspberry Pi B+s (a credit card-sized computer) and camera modules to construct RPyScan. The cameras will be set up equidistant to the object to capture multiple overlapping photos (http://go.dhs.sg/scannerdiagram). To construct the camera mounts on which the Raspberry Pi rests on, we use 3D modeling and 3D printing to efficiently improve on our initial prototype. A Python script (http://go.dhs.sg/pythonscript) takes multiple photos simultaneously and uploads them to Autodesk Recap 360 which detects the identical points of adjacent photographs and stitches them together into a 3D model. Further editing and improvement of the 3D model can be made manually for better results using 3D modeling software such as MeshLab and Project Momento.\r\n\r\nAdvantages and Possible Applications\r\n\r\nCost\r\nRPyScan is relatively cost-effective at about $1600 and most components are easily accessible from online retailers. (For comprehensive cost schedule and purchasing sources, please refer to 3D scanner cost file: http://go.dhs.sg/costsheet). Most professional scanners can cost in the range $10,000 - $50,000.  \r\n\r\nSpeed\r\nRPyScan snaps photos simultaneously and sends the pictures to the computer within seconds. Hence, it can even capture fidgeting objects (e.g. babies) while most other scanners are not able to.\r\n\r\nHigh Resolution\r\nRPyScan creates high resolution colored 3D models with 120,000+* vertices and 250,000+* faces (*calculations based on our initial prototype).\r\n\r\nScalability & Scanning Size\r\nRPyScan is scalable which allows you to control the quality and dimensions of the 3D model. For example, to increase the size of area scanned, you can add more camera modules easily. Currently, RPyScan can scan an area of about 2m * 2m.\r\n\r\n\r\nApplications\r\nFigurines \r\nRPyScan can be used to create 3D models to be printed as figurines. Since the time required for scanning is less than 1 second, it can be used to capture images of children or pets which have a tendency to move during scanning.\r\n\r\nE-commerce\r\nFor e-commerce, retailers can scan their products and upload the 3D models online. This allows customers to better visualize the product. This is especially true in the case of clothing, where users can try a virtual 'fitting' to check if the size fits.  \r\n\r\nArchaeology\r\nArchaeologists can make use of RPyScan to scan 3D models of artifacts for research or preservation purposes.\r\n\r\nAnimation\r\nWe can add a skeleton to the 3D model which will allow animation studios to construct animations for films!\r\n\r\nPresentation outline\r\n1.Brief introduction of 3D scanning \r\n2.Current technologies\r\n3.Importance and applications\r\n4.Hardware and software implementation of RPyScan\r\n5.Hardware (setup, costs, etc.)\r\n6.Software \r\n7.Challenges\r\n8.Advantages and possible applications\r\n9.Demo\r\n10.Further plans / call for collaboration / Q&A\r\n\r\n\r\nAbout Melvin, Le Xuan and Hannie\r\nWe are students from Dunman High School, Singapore. We have learnt Python for the past few months to one plus year since we studied Computing as an A-level subject. We learnt about the theoretical and algorithmic aspects of computer science (e.g. data structures and searching) and applied this knowledge to practical (Google App Engine) Python projects.\r\n\r\nMelvin is really enthusiastic and passionate about everything related to technology. He loves software and hardware equally. He is currently the chairperson of his school's Infocomm Club and has attained many national and international accolades such as Singapore Management University's InnovateIT and Information Technology Standards Committee's CodeXtremeApps hackathon school category, where he dabbled in home automation and created Internet-connected chairs and cookers prototypes. He also represented Singapore in the APICTA (Asia Pacific ICT Alliance) Awards and was pivotal in encouraging his school mates to contribute towards open source projects where Dunman High was recognized as the top participating school in Google Code-in 2014. When he is not studying, you can find him in his home 'lab' working on his IoT projects. In his free time, he plays video games and fantasizes about owning an Occulus Rift, and also coaches badminton to young kids.  \r\n\r\n\r\nLe Xuan is a budding Computing student who is ever excited to learn more about technology. Though he is relatively new in this area, his huge fascination with gadgets and devices motivates him to consistently find out more about how they work. He frequently creates various kinds of programs as part of this hobby, and can sometimes be found tinkering with pieces of machinery, thinking about how they might be improved. As part of his school curriculum, he has created a web application in celebration of Singapore’s 50th birthday (SG50) using Google App Engine and Python, took part in Google Code-in 2014 and the 2015 IDA National JC Coding Championship, and attended a number of related seminars and talks. He is interested in delving deeper into the areas of virtual reality and artificial intelligence. Besides Computing, he plays the piano and the French horn, enjoys playing video games for leisure, and recently picked up sports to be more active.\r\n\r\nHannie shows a strong interest in both hardware and software. She has a strong determination to learn new things and is not afraid of hard work. In the short few months since she started learning Computing, she created a web application using Python for SG50 and has participated in events such as Google Code-in 2014 and the 2015 National JC and HS Coding Championships. She actively engages herself in infocomm programmes such as an SMU Panel Discussion on “Creating the Future through Computing” and “The Science Behind Thoughts” conducted by A Star Research Institute of High Performance Computing (IHPC). In the foreseeable future, she hopes to explore emerging technologies such as projected keyboards. Besides Computer Science, she has a passion for classical music and plays the Piano, Violin and Viola. She also enjoys sports such as Volleyball and Archery. ", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "foo.mawqing.melvin@dhs.sg", "speech_type": "Regular Talk", "tags": "Raspberry Pi, 3D scanner", "abstract": "With the advent of low cost 3D printers, there is an increasing demand for 3D technology in many diverse fields. However, 3D printing requires a 3D model as input, usually modeled in a computer. But why should we tediously create a model from scratch, when we can simply scan the objects and modify them? In this project, we present RPyScan, an effective and low cost DIY 3D scanner which makes use of photogrammetry to infer depth information from photos. With enough points, this will create a 3D model of the scanned object. This is in contrast to most 3D scanners on the market, which makes use of RGBD (Depth) and lasers.", "additional_info": "", "reviews": [{"comment": "I'm excited to see the demo! The description is so well explained that I don't know how to make further expectation.", "reviewer": "liang2", "rank": 5}, {"comment": "RPi, Python, and 3D Printer are so much fun!", "reviewer": "keitheis", "rank": 5}, {"comment": "cool and interesting projects.", "reviewer": "tjw", "rank": 5}, {"comment": "It's the era of Open Source and Maker.", "reviewer": "yudalin", "rank": 5}], "id": 56, "duration": "40 mins", "title": "RPyScan", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "誰適合參加本工作坊：\r\n1. 會基本Python語法\r\n2. 會基本Html\r\n\r\n誰不適合參加本工作坊：\r\n1. Flask老手\r\n2. 想學習最新Html5網頁技術\r\n3. 想學習最酷炫Javascript技術，如Angular, react...\r\n\r\n課程大綱：\r\n1. \"Hello world!\" with Flask\r\n2. Template Engine: Jinja2\r\n3. Connect to DB: Flask-SQLAlchemy\r\n4. Deploy to real server", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "theonlin@gogolook.com", "speech_type": "Workshop", "tags": "web, flask", "abstract": "Flask是一個用Python開發的網頁微框架(microframework)，易於學習並擁有良好的架構設計，非常適合初學者剛接觸Web的人學習，本工作坊主要目標是希望能在三小時的時間內，藉著手把手教學的方式，帶領使用者開發出一個基本的Web網站。", "additional_info": "Flask:\r\nhttp://flask.pocoo.org/\r\n\r\nJinja2:\r\nhttp://jinja.pocoo.org/docs/dev/\r\n\r\nFlask-SQLAlchemy:\r\nhttps://pythonhosted.org/Flask-SQLAlchemy/\r\n\r\n", "reviews": [{"comment": "Good fit for a half day workshop.", "reviewer": "marr", "rank": 5}, {"comment": "* I think we, as attendees in PyCon APAC, deserve some sort of web application tutorial.\r\n* The proposed agenda looks a little bit too simple.", "reviewer": "drakeguan", "rank": 2}], "id": 57, "duration": "Half Day", "title": "Build your own website with Flask", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "michael.peng@vpon.com", "speech_type": "Lightning Talk", "tags": "data mining", "abstract": "Vpon is a leading mobile advertising company in Taiwan, with hundreds of millions of data from mobile apps everyday. In this short talk we will introduce the real-time data mining framework used in our DSP and SSP systems, including modules for CTR prediction, performance tracking, bid price optimization, mobile traffic prediction and anomaly detection. Performance, robustness and adaptivity are key design goals of this system. Our system can improve advertising performance (such as click-through rates) by adapting to mobile traffic changes in real-time.", "additional_info": "", "reviews": [], "id": 109, "duration": "40 mins", "title": "Real-Time Data Mining Framework for Mobile Advertising at Vpon", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "In this talk, we put emphasis on the anticheating analysis of the mobile advertisement clicking with the aid of the powerful python language", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "james.hsu@vpon.com", "speech_type": "Regular Talk", "tags": "fraud detection", "abstract": "As a leading big data ad technology with leading mobile advertising platform in Taiwan, Vpon receives hundred millions of data from mobile Apps everyday. In this unbounded data sea, our goal is to reduce the complexity of data, to find the valuable patterns or information, and to make the appropriate judgement using this information. In this talk, we put emphasis on the anticheating analysis of the mobile advertisement clicking with the aid of the powerful python language. Such development of techniques not only enables us to efficiently detect the distinctive patterns and anomalies of the advertising traffic, but also improves the overall quality of the mobile advertisement. Ultimately, it can help us to construct important indices and models for data mining in the mobile network.\r\n", "additional_info": "", "reviews": [], "id": 110, "duration": "40 mins", "title": "Click Fraud Detection in the Mobile Advertising Using Python", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "A. 環境設定（0.5 小時）\r\n    1. 使用 Serial + WiFi\r\n    2. 使用 VNC 和 X-Forwarding\r\nB. Raspberry Pi Camera簡介（1 小時）\r\n    1. 標準 Camera 和 NoIR Camera 介紹\r\n    2. Camera 應用介紹\r\n    3. Camera 改裝套件介紹\r\n    4. Camera 安裝與設定\r\nC. 基礎 Camera 使用 （2 小時）\r\n    1. 用 Python 控制\r\n    2. 手機控制與網路串流\r\n    3. 週邊硬體與 Camera 的互動\r\n    4. 串接網路服務\r\nD. 進階 Camera 使用 (2.5 小時)\r\n    1. 影像處理原理\r\n    2. 文字辨識\r\n    3. 人臉辨識與追蹤", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "sorry702@gmail.com", "speech_type": "Workshop", "tags": "Raspberry Pi, Python, Picamera, OpenCV", "abstract": "本次工作坊會介紹與使用 Raspberry Pi Camera，並以 Python 實做各種應用。", "additional_info": "", "reviews": [{"comment": "So we need to prepare separate days and rooms for both Pi workshops.", "reviewer": "marr", "rank": 5}, {"comment": "I love this topic. It's impeccable.", "reviewer": "stanley", "rank": 5}, {"comment": "Experienced speaker, teacher, and attractive PRi with Python.", "reviewer": "keitheis", "rank": 5}, {"comment": "looks fine.", "reviewer": "tjw", "rank": 4}, {"comment": "interesting!", "reviewer": "jin", "rank": 5}], "id": 59, "duration": "Whole Day", "title": "Raspberry Pi Camera + Python 工作坊", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "      近年來語音合成技術逐漸發展成熟被應用於許多的平台上如Apple的SIRI，Google的TRANSLATE甚至利用在許多語言的學習上，其主要目的是針對使用者所需的文字內容提供所需要的語音內容。\r\n\t雖著智慧型手機及平板電腦的普及許人們的閱讀習慣也逐漸的遭到改變，有鑑於傳統的紙本書太重，太占空間，製造過程砍伐樹木會造成全球暖化，攜帶亙是不便，於是漸漸有了把科技和書本結合再一起的構想，因而催生了電子書的產生。其優勢具有攜帶方便，減少污染等，人們閱讀的平台由一般的書籍逐漸轉移到智慧型裝置上。為了克服運用行動行智慧裝置閱讀電子書時的不便，例如:字體太小所造成的閱讀不便時。運用語音合成的技術將文字的內容合成出語音並將語音及文字做結合來輔助使用者來閱讀電子書的內容。\r\n\t本系統主要是藉助於Google的語音合成的API來幫助我們將文字的內容轉換成語音，再運用語音結合文字及配合上文字背景的變化來表達出同步化的效果。其程式執行流程為:\r\n\r\nStep1. 準備一個文字檔(txt)。 \r\nStep2. 將文字檔的內容做文字分析。\r\nStep3. 經由文字分析後將文章內的每個字給分割出來。 \r\nStep4. 將每個字上傳至Google的 API合成語音。\r\nStep5. 結合語音及文字及配合上文字背景的變化來表達出同步化的效果。\r\n以上步驟，圖示於下列網址:\r\nhttp://goo.gl/guxp0U\r\n       為了達到語音成同步的效果我們必須先去求出每個字在語音中的發音位置，在此我們運用了pygame.mixer.music.get_pos( )來擷取出語音中每個斷點發生的位置。並運用從google取得每個字的byte數，來估測每個字在語音訊號中的起始位置及結束位置，來推算語音的發音開始時間及發音結束時間，其估測的公式為:\r\n\r\nBytes of Posi occur  = Posi/Length*sumT\r\n\r\nPos:運用pygame.mixer.music.get_pos( )所取得語音中的斷點(單位:ms)。\r\nLength:運用mutagen所取出語音的總長(單位:s)。\r\nsumT:將所有文字的byte做相加取得語音檔案的大小。\r\n\r\n      經由上述的公式，我們可以輕易地求出文章中每個字和字之間停頓發生的時間點，及每個字的語音訊號在整段語音中的第幾個byte到第幾的byte。運用剛才的結果來做判斷當公式，算出的結果大於語音訊號起始位置或小於語音訊號結束位置時則將文字做特殊的背景處理。\r\n\r\n      有了每個字在聲音訊號中的起始位置及結束位置後，接下來我們必須去取得螢幕畫面中每個文字的位置。\r\n其搜尋文字位置的流程為:\r\n\r\nStep1. 設定開始搜尋的位置為1.0其中1.0的1為文字在畫面上的X座標，1.0的0為文字在畫面上的Y座標。\r\nStep2. 在螢幕畫面中插入我們所要閱讀的文字內容。\r\nStep3. 在每次插入文字時計算每個文字是由多少字元所構成例如:英文字word(包含4個字元)、英文字get(包含3個字元)等。\r\nStep4. 插入文字後從畫面位址1.0開始搜尋文字在畫面中的開始位置。\r\nStep5. 將搜尋到畫面中的文字起始位址和文字字元做加總來產生文字在畫面中的結束位置。\r\n以上步驟，圖示於下列網址:\r\nhttp://goo.gl/eutmtE\r\n有了文字在畫面中的起始位置和結束位置後運用背景高亮的方式將文字顯示出來。\r\n圖示於下列網址:\r\nhttp://goo.gl/9OMDxS\r\n語音和文字同步化的過程為:\r\nStep1. 插入文字於畫面中。 \r\nStep2. 搜尋畫面中每個文字在畫面中的起始位置及結束位置。\r\nStep3. 播放文字的語音內容。\r\nStep4. 擷取語音內的斷點。\r\nStep5. 以斷點做判斷。\r\nStep6. 當斷點的位置大於語音訊號起始位置或小於語音訊號結束位置則顯示出文字高亮的背景，當斷點的位置小於語音訊號起始位置或大於語音訊號結束位置則繼續保持原始的文字狀態。\r\n以上步驟，圖示於下列網址:\r\nhttp://goo.gl/B2oNsZ\r\n程式展示影片網址:\r\nhttps://www.youtube.com/watch?v=0EVeE42qBxU&feature=youtu.be\r\n更加詳細介紹於下列網址:\r\nhttp://changchaokai.blogspot.tw/\r\n\r\n \r\n", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "aw.81761109@gmail.com", "speech_type": "Regular Talk", "tags": "語音合成、語音同步有聲書", "abstract": "本系統主要是藉助於Google的語音合成的API，來幫助我們將文字的內容轉換成語音，再運用語音結合文字，搭配上文字背景的變化來表達出同步化的效果。擷取出語音中每個斷點發生的位置，與每個字在語音訊號中的起始位置及結束位置，來推算語音的發音開始時間及發音結束時間來做判斷，再取得螢幕畫面中每個文字的位置運用背景高亮的方式將文字顯示出來。\r\nAbstract(PDF)於下列網址:\r\nhttp://goo.gl/b39POS", "additional_info": "http://www.tutorialspoint.com/python/python_gui_programming.htm\r\nhttp://docs.python-requests.org/en/latest/\r\nhttp://pygame.org/news.html\r\nhttps://docs.python.org/3/library/tokenize.html\r\nhttps://github.com/leo-labs/gTTS\r\nhttp://tkinter.unpythonic.net/wiki/tkFileDialog\r\nhttps://bitbucket.org/lazka/mutagen\r\n", "reviews": [{"comment": "- I didn't see any interesting usage of python. \r\n- Just an application of Google API. 也許有使用pygame, 但並不是很多。", "reviewer": "AlfredW", "rank": 2}, {"comment": "雖然很簡單，不過如果配合實際 Demo 的話可以看的出來 Python 可以很輕易的把這件事情做出來，我想對於一些初學者來說會覺得挺有趣的。", "reviewer": "andy", "rank": 3}, {"comment": "Interesting.", "reviewer": "stanley", "rank": 4}, {"comment": "I see the future of our world.", "reviewer": "yudalin", "rank": 5}, {"comment": "I see the potential of your project on the topic of \"Education.\" Teachers could transform their teaching materials into a \"Handicap Friendly\" way very easily even though they are not a professional programmer. I think the application that is able to make technology become a big help would be appreciated.  Through it's pity that python play a minor role in your, I still think your topic is attractive, and would be more attractive If you can provide more use-case how to combine this technique to the real life. ", "reviewer": "Yen", "rank": 4}, {"comment": "It gives an example of Python standard library \"tokenize\", and Python application in audio.", "reviewer": "apua", "rank": 4}], "id": 58, "duration": "40 mins", "title": "以雲端語音合成技術為基礎的音文同步有聲書之建立系統", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "What problem do we meet?\r\n    Describe the problem we meet when we want to deploy software. \r\n    Compare with the old technique, we need a more efficient way to deploy software.\r\n\r\nWhat is Docker?\r\n    Introduce the concept behind docker. \r\n    Docker's Client/Server architecture & some simple usage\r\n    Describe how docker improve our workflow\r\n    \r\nHow to use docker?\r\n    Some simple command\r\n    Dockerfile\r\n    DockerHub\r\n\r\nDemo\r\n    Deploy a simple python web app\r\n\r\nDocker Ecosystem\r\n    Docker Machine\r\n    Docker Swarm\r\n    Docker Compose\r\n    SocketPlane \r\n    kubernetes", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "waitingkuo0527@gmail.com", "speech_type": "Regular Talk", "tags": "Docker, Web, Devops", "abstract": "Docker is one of the most popular project in these years. In this talk, I'd like to show you what is docker and how to use docker to improve our workflow. ", "additional_info": "I'm the main organizor of Docker.Taipei. I've given many talks in Docker.Taipei Meetups.\r\nhttp://www.meetup.com/Docker-Taipei/\r\n\r\nI've also given some talks about Docker in Taipei.py\r\nhttp://www.meetup.com/Taipei-py/events/218680274/\r\n\r\nI was the winner of Docker Global Hackathon and gave a talk in Docker Europe in Netherland\r\nhttp://blog.docker.com/2014/11/announcing-docker-global-hack-day-2-winners/", "reviews": [{"comment": "- Entry Level. Good for those who has no experience with dockers.\r\n- And seems it's the only one topic which is focused on docker.", "reviewer": "AlfredW", "rank": 3}, {"comment": "It seems that this talk will mainly focus on docker but less Python. Although docker is a hot topic last year, but I think there's enough entry level material on the web now. ", "reviewer": "andy", "rank": 1}, {"comment": "Look like it is about docker but less about Python", "reviewer": "apua", "rank": 1}], "id": 60, "duration": "40 mins", "title": "Docker for Python Developer", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Python 是基於 imperative 的語言, 但仍參考 functional 提供了一些 programming 上的支援. 這是一大福音, 也是很好的成長方向, 但往往會有人攻訐 Python 在 functional programming 的不足.\r\n\r\nImperative programming 不利於抽象化程式結構, 這裡可以舉出數個例子並解釋 Python 在這種 programming paradigm 中容易發生的謬誤.\r\n\r\n而在 functional programming 方面, Python 會被指責 \"沒有 type checking\", \"沒有 tail recursion\", \"不利於 optimization\", 且事實上 Python 也常因提供了 generator / iterator 就被誤以為適合運用 lazy evaluation....這些問題在 PEP 或 Python document 其實都有說明, 值得一一澄清.\r\n\r\n最後我們會發現 Python 始終沒有偏離初衷. Python 仍然是著重動態型別的語言, 仍然追求平緩的學習曲線, 單純的語法, 高可讀性; 或許這會對優化產生困難, 不過相信 Python 一樣可以當成學習不同 programming paradigm 的跳板, 或貫徹膠水語言的特性與其他程式結合.\r\n\r\n本次 talk 將著重在 Python3 而少討論 Python2 的語法和語言特性.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "Apua.A.Aa@gmail.com", "speech_type": "Regular Talk", "tags": "functional programming", "abstract": "參考 declarative programming, 重新審視使用 Python 語言解決問題時, 可能遭遇的問題 (例如副作用), 提出語言的特性與優勢, 與如何撰寫比較單純少出錯. 並於最後總結 Python 學習優勢與未來建議大家注意的方向.", "additional_info": "Programming Paradigm:\r\n    http://en.wikipedia.org/wiki/Programming_paradigm\r\n\r\nFunctional programming with Python:\r\n    - http://anandology.com/python-practice-book/functional-programming.html\r\n    - https://thenewcircle.com/static/bookshelf/python_fundamentals_tutorial/functional_programming.html\r\n    - https://docs.python.org/3/howto/functional.html\r\n    - http://www.ibm.com/developerworks/library/l-prog/\r\n    - http://kachayev.github.io/talks/uapycon2012/#/7\r\n\r\nThinking Functionally with Haskell\r\n    http://assets.cambridge.org/97811070/87200/toc/9781107087200_toc.pdf\r\n\r\nThe Python trade-off\r\n    - http://neopythonic.blogspot.com/2009/04/tail-recursion-elimination.html\r\n    - http://stackoverflow.com/questions/1017621/why-isnt-python-very-good-for-functional-programming\r\n\r\nUsing :code:`list` is faster than :code:`tee`:\r\n    https://docs.python.org/3/library/itertools.html#itertools.tee\r\n\r\n", "reviews": [{"comment": "看得出來講者想要傳達一些理念，只是不太確定是哪些。", "reviewer": "tjw", "rank": 4}, {"comment": "* The topic is sexy all the time.\r\n* But the speaker might not have clear thoughts to deliver his insight on this.", "reviewer": "drakeguan", "rank": 2}, {"comment": "This topic should be interesting,\r\nneed to talk to author to enrich his talk.", "reviewer": "stanley", "rank": 4}, {"comment": "Functional programming has been a very charming term these days. I am very interested how to code in a functional way as a python programmer. And the advantage and disadvantage of the functional code style in python would be a attractive point of your talks.", "reviewer": "Yen", "rank": 4}], "id": 27, "duration": "40 mins", "title": "....when thinking functionally with Python", "decision": "Undecided", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "Information Extraction is task of automatically extract specific messages from large amounts of data, in real application, we can quickly obtain the related roles or time of the events from a lot of data and collect useful business intelligence.\r\n\r\nIn general, Conditional Random Fields model has good performance on information extraction task, if we want to build the CRFs model to fit our custom demand, it need to provide a corpus that prior annotated by ourself, but the annotation task usually spend a lot of time, so we need a convenient annotation tool.\r\n\r\nTherefore, this talk will introduce an easy to use annotation tool, BRAT, during this talk will give some examples such as upload the corpus, annotate the custom entities from corpus, transform the format … etc.\r\n\r\nAfter obtain the annotated corpus, the next work is pre-processing and feature generation, this talk will present how to use pandas and scikit-learn to generate the training feature, such as Part of Speech (PoS) tags, n-gram and combine them for each traning word.\r\n\r\nFinally, this talk will present how to use pyCRFsuite to binding python and CRFsuite, traning our custom Conditional Random Fields model to labeling the text data, the labeling result is like Apple/Organization, Jobs/Person. After the labeling step, we will give an example about aggregation and document clustering on these labeled text by pandas and scikit-learn.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "sk413025@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "machine learning, natural language processing, data analysis", "abstract": "This talk will present a named entity recognition (NER) system for extracting attributes and values, like person, company, place or time,  from various of text data. I will introduce how to combine several python tools to build this system. First, use a python written annotation tool BRAT to create a custom annotated corpus. Second, use python to link CRFsuite, training a Conditional Random Fields model to labeling our list of text data, the labeling result will be further analyzed by pandas and scikit-learn. ", "additional_info": "BRAT\r\nhttp://brat.nlplab.org/index.html\r\nCRFsuite\r\nhttp://www.chokkan.org/software/crfsuite/\r\nMy previous work\r\n1. kaggle sentiment analysis\r\nhttp://nbviewer.ipython.org/github/sk413025/ncku_sentiment/blob/master/sparse_matrix.ipynb\r\n2. pandas aggregation\r\nhttp://nbviewer.ipython.org/github/sk413025/misc/blob/master/TAAI/Untitled0.ipynb", "reviews": [{"comment": "Honestly language sentiment analysis is not of my field. Though this could be a good example of data extraction with python.", "reviewer": "yuanchao", "rank": 3}, {"comment": "It is not clear to the reviewer what subject the proposer wants to deal with.  It is good if the talk will introduce a fair amount of data-analytic Python packages as described.", "reviewer": "yungyuc", "rank": 2}, {"comment": "OK as a SciPy talk. Building toolchain for data analysis with Python is contributing topic. The abstract does not show practical problems/solutions.", "reviewer": "whosaysni", "rank": 3}], "id": 61, "duration": "40 mins", "title": "Information extraction with Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Reinforcement Learning has been a lasting topic in machine learning for more than 30 years, though several approaches were invented but improvements are limited. The reason is because the learning result depends largely on feature selection, which varies a lot in different types of games. With the help of deep learning, algorithms can find hidden features without the need of constructing them manually.\r\nThe Theano library is ideal for quick prototyping of deep learning algorithms, and the Pylearn2 library is a collection of ready-to-use machine learning algorithms and datasets. With the help of these libraries, deep learning research has become much easier, we can not conduct experiments instantly without having to reimplement algorithms.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "teweishieh@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "theano, machine learning, reinforcement learning, artificial intelligence", "abstract": "Google Deep Mind has proposed a method of Deep Q-Learning, which utilized convolutional neural networks to enhance the process of the conventional Q-Learning algorithm. The result of this new algorithm is astonishing, it only takes raw streaming video and score output from the Atari game environment to learn a policy that can outperform some human players in various games.  In this talk I aimed to reconstruct the experiments stated in their paper using Theano and Pylearn2 (The original experiments was build with Torch7, which was written in Lua), and hopefully I can extend this algorithm to more complex strategy type games.", "additional_info": "Playing Atari with Deep Reinforcement Learning\r\nhttp://arxiv.org/pdf/1312.5602v1.pdf\r\n\r\n", "reviews": [{"comment": "Though the original paper is to demonstrate an implementation of q-learning, it's good to have the same experiment conducted with a ready-to-use python library.", "reviewer": "yuanchao", "rank": 3}, {"comment": "It will be a good introduction to the application of theano and Pylearn 2, as well as machine learning.", "reviewer": "yungyuc", "rank": 4}, {"comment": "Fits as a SciPy talk and the topic is attractive. The author's work seems to be unfinished at the moment so the performance of the talk is not visible. ", "reviewer": "whosaysni", "rank": 4}], "id": 62, "duration": "40 mins", "title": "Python and Reinforcement Learning", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "What is sentiment analysis?\r\nWhy do we need sentiment analysis?\r\nSome background knowledge\r\n    stem\r\n    stop words\r\n    tokenizor\r\n    lexicon\r\n    naive bayes classifier\r\nNLTK\r\n    What is NLTK?\r\n    Some simple usage for NLTK\r\n    How to use NLTK to do the sentiment analysis\r\nDemo\r\n    Ask attendees to reply something to my tweet. Let's see which is positive and which is negtive", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "waitingkuo0527@gmail.com", "speech_type": "Regular Talk", "tags": "Sentiment analysis, opinion mining, ipython, twitter, text mining", "abstract": "Sentiment analysis is useful, especially for the social media. In this talk, I'd like to introduce some background knowledge and how to use NLTK to do the sentiment analysis. Finally, i'll give a demo for the sentiment analysis for Twitter.\r\n\r\nI'll keep the theory part as easy as possible!", "additional_info": "I'm the speaker of \"Data analysis in Python\" in PyCon Apac 2014.\r\nhttps://tw.pycon.org/2014apac/en/speakers/12/\r\n\r\nWould like to introduce something more advance this time.", "reviews": [{"comment": "Many participators might find this topic interesting. Don't know whether there are any thing beyond naive bayes classifier and don't know Chinese language will be handled in this talk.", "reviewer": "tjw", "rank": 4}, {"comment": "Interesting Topic. I hope the topic will cover sentiment analysis  in Chinese", "reviewer": "andy", "rank": 4}, {"comment": "Interesting.", "reviewer": "stanley", "rank": 4}], "id": 79, "duration": "40 mins", "title": "Sentiment Analysis by NLTK", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Long before SoftLayer was a cloud service provider, it was a group of keen developers. One day our developers set out to create the modular, scalable infrastructure services they wanted in order to develop the cloud solution of their dreams. So SoftLayer started with an API that provides precision control and now is constantly working at finding ways to put more tools at developers’ fingertips.\r\n\r\nJoin us in this session as SoftLayer Experts takes the audience though SoftLayer’s journey and his experiences in working on the open application programming interface (API) provides system-to-system access with more than 3,000 documented methods across 180 discrete services.\r\n \r\nBen Cheng, will join the session and talk about how Oursky is building its application on the cloud.  He will also give you advice on how to build an effective cloud backend for your application development and implementations. ", "talk_perm": "Don't record my talk", "language": "English", "author": "", "speech_type": "Regular Talk", "tags": "cloud", "abstract": "Long before SoftLayer was a cloud service provider, it was a group of keen developers. One day our developers set out to create the modular, scalable infrastructure services they wanted in order to develop the cloud solution of their dreams. So SoftLayer started with an API that provides precision control and now is constantly working at finding ways to put more tools at developers’ fingertips.\r\n\r\nJoin us in this session as SoftLayer Experts takes the audience though SoftLayer’s journey and his experiences in working on the open application programming interface (API) provides system-to-system access with more than 3,000 documented methods across 180 discrete services.\r\n \r\nBen Cheng, will join the session and talk about how Oursky is building its application on the cloud.  He will also give you advice on how to build an effective cloud backend for your application development and implementations. ", "additional_info": "", "reviews": [], "id": 111, "duration": "40 mins", "title": "How developers are building applications on the cloud", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "Use the SoftLayer API to provision servers, configure SSH keys, and manage nodes in a Docker managed application environment. Learn about Salt configuration management, Docker applications, and the SoftLayer command line utility. Then, build a blog server using these tools.", "talk_perm": "Don't record my talk", "language": "English", "author": "", "speech_type": "Workshop", "tags": "cloud", "abstract": "Use the SoftLayer API to provision servers, configure SSH keys, and manage nodes in a Docker managed application environment. Learn about Salt configuration management, Docker applications, and the SoftLayer command line utility. Then, build a blog server using these tools.", "additional_info": "", "reviews": [], "id": 112, "duration": "Half Day", "title": "Managing Deployments Using the SoftLayer API, Docker and Salt", "decision": "Undecided", "slide_perm": "Don't publish my slide", "audience_level": "Extreme"}, {"description": "Organizing code is not a easy thing, but there still are some principles to follow. This talk will introduce you to speaker’s own secret principles and detailed examples. Wish it make our code better.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "mosky.liu@pinkoi.com", "speech_type": "Regular Talk", "tags": "organizing, naming, spacing, ordering, practicing, better, literature programming", "abstract": "I will cover the three basic parts: 1. naming, 2. spacing, and 3. ordering.\r\n\r\nIn the first part, the naming is definitely the most important thing in coding. We have million variables, but they can be classified into two groups: a. functions and b. data. Both have their own particular rules to follow. For the function part, we have performance hint, return-value hint, etc. For the data part, we have type hint, structure hint, etc.\r\n\r\nIn the second part, the spacing is also important, but sometimes programmers just ignore it. I will discuss the spacing on line-level, paragraph-level, and section-level.\r\n\r\nIn the final part, actually most programmers even didn’t think of it, but I do have some advices for how to order your code.\r\n\r\nCombine the three parts to make our code better.", "additional_info": "", "reviews": [{"comment": "* I doubt this talk does not cover enough scope for organizing codes.\r\n* The abstract looks quite intuitive and subjective.", "reviewer": "drakeguan", "rank": 2}, {"comment": "Lets conquer PEP8! Clean code and mind are very fundamental of Python. ", "reviewer": "keitheis", "rank": 4}, {"comment": "love to see this kind of issue from an experienced python developer's aspect. Would be perfect if the speaker can cover some PEP8 official guide along with his/her personal suggestions which don't explain clearly in the given abstract.", "reviewer": "jin", "rank": 3}, {"comment": "Everybody knows source code organizing is important and we have the guide line in PEP8.\r\nBut from the abstract, I didn't see any bright spot of the talk.\r\n", "reviewer": "stanley", "rank": 2}, {"comment": "I think it is a great topic,   but need more charming description", "reviewer": "tim", "rank": 3}], "id": 64, "duration": "40 mins", "title": "Organizing Code in a Better Way", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "gRPC is a new high performance, open source, general RPC framework that uses the HTTP/2 standard. The gRPC framework allows you to create small scalable services that fit well into a service oriented architecture. Kubernetes is a cluster manager that allows you to create services that can be scaled easily. Service oriented architecture is a key part of how many companies, like Google, operate their infrastructure to provide robust, and highly available services that operate at a consistently high level of performance for end users.\r\n\r\nIn this talk I will talk about how to use Python to create a scalable gRPC service and then how to actually manage and scale it using the Kubernetes cluster manager. I will cover the basic parts and concepts of each technology and how to use the provided tools. As I explain the concepts, I will walk through building a sample service and illustrate how to scale it and communicate with it using a simple client.\r\n\r\nI believe this talk is important because it makes use of new technologies and how Python can be used with them. With many new languages coming out, Python's future is uncertain but I think that the tools and ease of development with Python still make it a great language for server-side development.\r\n\r\nOutline:\r\n\r\n1. gRPC concepts\r\n   a. HTTP/2\r\n   b. Protocol buffers\r\n2. The Python gRPC tools and API\r\n3. Creating the Python server\r\n   a. Creating the API stubs.\r\n   b. Implementing the logic\r\n   c. Running the app server\r\n   d. Containerizing the server with Docker \r\n4. Kubernetes concepts\r\n   a. Cluster\r\n   b. Pod\r\n   c. ReplicationController\r\n   d. Service\r\n5. Running the service\r\n   a. Defining a service\r\n   b. Running the service in Kubernetes\r\n   c. Scaling up/down\r\n6. Accessing the service\r\n7. Runtime environments", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "ianlewis@google.com", "speech_type": "Regular Talk", "tags": "grpc, kubernetes", "abstract": "gRPC and Kubernetes are two new technologies that make it easy to manage robust, highly available web services that talk to each other using a fast, flexible protocol. Python is well suited to building the logic for these kind of services. Python is a flexible language that can be highly efficient when tuned properly and allows you to make use of the extensive set of Python libraries that are publicly available.\r\n\r\nIn this talk I will talk about how to combine these technologies and use Python to create a scalable gRPC service and then how to actually manage and scale it using the Kubernetes cluster manager. ", "additional_info": "gRPC homepage: http://www.grpc.io/\r\nKubernetes homepage: http://kubernetes.io/\r\n", "reviews": [{"comment": "Thanks for the enlightenment of the future of Python :)", "reviewer": "liang2", "rank": 4}, {"comment": "Cool stuff and could help Pythonist a lot..", "reviewer": "stanley", "rank": 4}, {"comment": "Sounds interesting about gRPC, HTTP2, cluster, and Python!", "reviewer": "keitheis", "rank": 4}, {"comment": "Google is our Gold Sponsor (not confirmed yet, because google is asking workshop, but we don't have capacity for workshop anymore)", "reviewer": "lucemia", "rank": 5}], "id": 65, "duration": "40 mins", "title": "Building a Scalable Python gRPC Service using Kubernetes", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "gitfs is an open-source[1] filesystem which was designed to bring the full powers of Git to everyone, no matter how little they know about versioning. A user can mount any repository and all the his changes will be automatically converted into commits. gitfs will also expose the history of the branch you’re currently working on by simulating snapshots of every commit.\r\n\r\ngitfs is useful in places where you want to keep track of all your files, but at the same time you don’t have the possibility of organizing everything into commits yourself. A FUSE filesystem for git repositories, with local cache.\r\n\r\nThe prerequisites for this talk are:\r\n+  Good understanding of how Git works and familiarity with the Git internals\r\n+  Basic understaning of Operating Systems concepts", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "manu@presslabs.com", "speech_type": "Regular Talk", "tags": "storage, git, git-internals, concurrency, caching, infrastructure, libgit2, pygit2", "abstract": "In this talk we will take a look at some of the crucial aspects involved in building a reliable FUSE filesystem, we will explain some of the design decisions and trade-offs that we made, the steps that we took in handling effectively the git objects (http://git-scm.com/book/en/v2/Git-Internals-Git-Objects), what testing methods we have used and we will also share the most important lessons learned while building it.", "additional_info": "[1] You can find the source here - https://github.com/PressLabs/gitfs and more details here - http://www.presslabs.com/gitfs/.", "reviews": [{"comment": "Very interesting topic with real practice and trade-off made, I'd love to see it.", "reviewer": "keitheis", "rank": 5}, {"comment": "there are lots of interesting technique  considerations on this topic. Not sure how much this talk is going to cover(what is there is a git directory inside the filesystem), but definitely a right topic.", "reviewer": "tjw", "rank": 4}, {"comment": "It definitely is an advanced topic and worth to listen.", "reviewer": "stanley", "rank": 5}, {"comment": "Interesting topic, how could I miss this session?", "reviewer": "sosorry", "rank": 5}, {"comment": "* I will give it 5 if it is based on mercurial.", "reviewer": "drakeguan", "rank": 4}, {"comment": "Interesting ！", "reviewer": "c3h3", "rank": 5}], "id": 66, "duration": "40 mins", "title": "GitFs - Building a Filesystem in Python", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "Outline:\r\n\r\n* Introduction to Discrete Event Simulation and SimPy\r\n\r\n* What DES can do for us in IC design flow?\r\n** Another simulator? What are you talking about?\r\n** \r\n* Examples\r\n** Network Queue\r\n** CPU Bus Transaction\r\n\r\n* Concluding Remarks\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "alberthuang314@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "IC design, SimPy, discrete-event simulation, queuing", "abstract": "More than ten years ago, researchers in network/queuing field often\r\nneed to build their own simulator from scratch. Then there comes some\r\nsimulation packages, e.g. ns-2 or its sucessor ns-3, which is built\r\nwith C++ and Python. Often, we need to build our own tool to tackle\r\nsome problems that are not fully suited into these simulators, then\r\nbuilding a simulator from scratch is often a frustrating process. The\r\nauthor has built three simulators, one in C, one in Objective-C, and\r\nfinally a module in ns-2. By this frustrating experience, the author\r\ntried to search a simulation package that is easy to use\r\nafter graduating from school, and SimPy arises from the horizon. In\r\nthis talk, the author will briefly introduce Discrete-Event Simulation\r\nand SimPy, then gives some examples on how to use SimPy to ease IC\r\ndesign problems. Hope everybody could enjoy the power of Python and SimPy!\r\n", "additional_info": "", "reviews": [{"comment": "Good for an example of simulation with python in industrial. But not sure of this is attractive to the general audience.", "reviewer": "yuanchao", "rank": 2}, {"comment": "It is good to see application and introduction to the powerful SimPy tool in the conference, but the abstract didn't draw a clear link how the tool is helping IC design process.", "reviewer": "yungyuc", "rank": 3}, {"comment": "OK as a SciPy talk. Introductory/sharing-experience talk that would rather suited to regular track/LT. ", "reviewer": "whosaysni", "rank": 3}], "id": 68, "duration": "40 mins", "title": "Using SimPy to Build In-house Tools to Tackle Down-to-earth Queuing Problems", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Coding Style Guide\r\n- 介紹 PEP8 及 Google Python Style Guide 所建意的風格。\r\n- 分析每項風格其背後的原因以及參考實際例子。\r\n- Style 並非 syntax，有些情況還是需要打破原則 (e.g.: Python Standard Library - logging)。Syntax 是死的，而 style 是活的。\r\n\r\n工具的使用\r\n- 如何利用編輯器幫你轉換/檢查 tab。\r\n- 利用 pylint 等工具檢查 coding style。\r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "darkgerm@gmail.com", "speech_type": "Regular Talk", "tags": "coding style, PEP8", "abstract": "Beautiful is better than ugly.\r\nReadability counts.\r\n\r\n如何寫出程式固然重要，如何將程式寫的漂亮、有可讀性、易維護更是重要。不好的風格(coding style)，不僅常會讓未來的你看不懂，也常會讓你的隊友抱怨連連，甚至可能是引起 bug 的重要原因！\r\n\r\n本演講將會以 Python 官方建意的風格 (PEP8) 及 Google 建意的風格 (Google Python Style Guide) 為基礎，介紹如何將 code 寫的更漂亮、更具可讀性。\r\n", "additional_info": "PEP 8 - Style Guide for Python Code\r\nhttps://www.python.org/dev/peps/pep-0008/\r\n\r\nGoogle Python Style Guide\r\nhttps://google-styleguide.googlecode.com/svn/trunk/pyguide.html\r\n", "reviews": [{"comment": "The idea is good and beneficial for general audience, but given the talk\r\nlength, current topic lacks originality which might be better for a lightning\r\ntalk.", "reviewer": "liang2", "rank": 2}, {"comment": "It's more suit for lightning talk or workshop.", "reviewer": "stanley", "rank": 1}, {"comment": "Should be fun to see it in lightning talk.", "reviewer": "keitheis", "rank": 1}, {"comment": "I believe this might be too intuitive as a talk in an annual conference. Further, the referenced materials are way too famous. I believe most of attendants have (or will) read that once.", "reviewer": "drakeguan", "rank": 1}, {"comment": "it is very fundamental.  I think community may need this kind of talk. ", "reviewer": "tim", "rank": 3}], "id": 70, "duration": "40 mins", "title": "Writing Beautiful Code - Python Coding Style Guide", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Sphinx provides autodoc feature that generate document from docstring in your python sources.\r\nThe docstring that contains description and example of the use of function written near the program, makes doc easy to update.\r\nIn addition, the output of the Sphinx will make you understand what to write in docstring. As a result, this will improve your motivation of doc writing.\r\n\r\nTo use the autodoc, you must specify python modules to automodule directive one by one. This is a tedious task, hoswever autosummary extension automate this task.\r\nIn most cases, once developers have developed the API, you only need to run the make html of Sphinx, you get a nicely formatted document.\r\n\r\nSphinx also has coverage and doctest extentions.\r\nThese support writing the documentation to work with autodoc.\r\nThis allow you to check the APIs that have not been documented or you can verify each doctest part is correct or not.\r\n\r\nIf you use such autodoc-related extensions, you can create a Sphinx API documentation in the following procedure.\r\n\r\n1. make coverage; you can get the APIs that have not been documented.\r\n2. Write docstrings that includes the doctest format how to use the API.\r\n3. make doctest; you can verify each doctest part is correct or not.\r\n4. make html; you can generate the HTML or your favorite format.\r\n\r\nIn this session, I'll explain a documentation procedure that uses with sphinx autodoc, autosummary, coverage and doctest extensions.\r\n\r\n\r\nOutline:\r\n\r\n* Self introduction (2 min)\r\n\r\n* Sphinx introduction (2 min)\r\n\r\n  * What is Sphinx?\r\n  * Sphinx examples\r\n\r\n* Have you written API docs for your code? (2 min)\r\n\r\n  * I don't know what/where should I write.\r\n  * Docstrings is needed? Are there some specific format?\r\n\r\n* Getting start Sphinx (2 min)\r\n\r\n  * How to install Sphinx\r\n  * How to start a Sphinx project\r\n\r\n* Generate API docs from your python code (5 min)\r\n\r\n  * setup autodoc extension\r\n  * write docstrings for yuor python module\r\n  * \"automodule & make html\" will generate API docs from python code\r\n  * autodoc pros & cons: docs for many modules\r\n\r\n* Listing APIs automatically (5 mins)\r\n\r\n  * setup autosummary extension\r\n  * how to use autosummary directive\r\n  * no more autodoc directive\r\n\r\n* Discovering undocumented APIs (5 min)\r\n\r\n  * setup coverage extension\r\n  * make coverage\r\n\r\n* Detect deviations of the impl and doc (5 min)\r\n\r\n  * setup doctest extension\r\n  * make doctest\r\n\r\n* Overall picture, tips, Q&A (10 min)\r\n\r\n  * Overall picture of the process\r\n  * Options for autodoc\r\n  * translate them into other langs\r\n\r\n\r\n* Target:\r\n  - Python programmer who is struggling with documentation.\r\n  - Python library author who want to generate API docs automatically.\r\n  - Python library author who want to create a clear documentation which contains python snippets.\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "shimizukawa@gmail.com", "speech_type": "Regular Talk", "tags": "sphinx, documentation, autodoc, ", "abstract": "Using the automated documentation feature of Sphinx, you can make with ease the extensive documentation of Python program.\r\nYou just write python function documents (docstrings), Sphinx organizes them into the document, can be converted to a variety of formats.\r\nIn this session, I'll explain a documentation procedure that uses with sphinx autodoc and autosummary extensions.\r\n", "additional_info": "* http://sphinx-doc.org/ext/autodoc.html\r\n* http://sphinx-doc.org/ext/autosummary.html\r\n* http://sphinx-doc.org/ext/coverage.html\r\n* http://sphinx-doc.org/ext/doctest.html\r\n", "reviews": [{"comment": "Sphinx is a sophisticated documentation tool and it is important to use the autodoc correctly. Happy to see Sphinx team to talk on this :)", "reviewer": "liang2", "rank": 4}, {"comment": "Sphinx is always a welcome topic in PyCon. Given by experienced speaker is even attractive!", "reviewer": "keitheis", "rank": 5}, {"comment": "Sphinx is a good, popular project and also worth to learn.\r\nBesides, according to the description of the proposal,\r\nthe speaker should have well prepare for the talk.\r\nI'm looking forward to the talk.", "reviewer": "stanley", "rank": 4}, {"comment": "This topic is what Sphinx user want to listen.\r\nAnd the speaker is ready. Wonderful", "reviewer": "apua", "rank": 5}], "id": 69, "duration": "40 mins", "title": "Sphinx autodoc: automated API documentation", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "I would like this presentation to be useful AFTER the conference, as well as during. I'll have the code examples on the web before the conference, and I hope the slides and video will be easily accessible after the conference is over. \r\n\r\nI would like this to be useful both to professionals who would like to start using python for easy computing, and for teachers/students who can enhance their understanding of science and engineering by doing interesting and real-world engineering problem simulations in python without a lot of coding experience.\r\n\r\nI won't go over all the examples in detail during the talk, but instead focus on the fun stuff, and how to visualize physics in blender. ", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "david.mikolas1@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "blender, physics, engineering", "abstract": "When I first told my friends and family that I was taking some time off to learn about blender and python for scientific visualization, some of them became confused and worried, thinking I had snakes in my kitchen. In fact, I'm a scientist/engineer and I need an environment to calculate things and show the results, and these two open source packages offered everything I need!  \r\n\r\nPython has become a popular platform in physics for both professional research and teaching settings. Scipy and numpy have most of the goodies we need, and there are plenty of other libraries out there. However, depending on one's previous experience with other tools, learning to really use python \"pythonically\" can sometimes be a little bumpy. \r\n\r\nIn this talk I'll first give a quick tutorial on how to get started doing physics in python the right way - the tutorial that I *wish* I could have read in the beginning. I'll give some examples of interactive programs using the matplotlib widgets as a user interface, for a variety of engineering and physics applications. This is the International Year of Light [1] celebrating a number of optical \"birthdays\", so we'll look at some of those with Python.\r\n\r\nThen I'll show some results where I cast a complicated math/optics problem as a collection of python objects (in python, everything is an object!) to make the solution more tangible. Since blender - a rendering and animation environment with python scripting built-in - eats python objects for breakfast, one can just transfer the code into blender and make animated 3D visualization of the problem setup, calculation, and final results. \r\n", "additional_info": "[1]  www.nature.com/news/light2015-1.16846", "reviews": [{"comment": "Combining SciPy and blender for visualization is very attractive. Would be even nicer to know what physics problems are involved.", "reviewer": "yuanchao", "rank": 4}, {"comment": "Visualizing scientific computation results with animation tools combines two worlds into one.  The tricks involved should be informative.", "reviewer": "yungyuc", "rank": 4}, {"comment": "OK for SciPy talk. The content is tutorial/demonstrative one (rather than a practical science/engineering story, which is more suitable for our track).", "reviewer": "whosaysni", "rank": 3}], "id": 72, "duration": "40 mins", "title": "for physics in blender:   (or, what light looks like)", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "OpenLCDFDM is a finite difference simulation code for liquid crystal device. It can perform parallel simulations through OpenMP. \\\\\r\n\r\nLCD simulation contains three different parts of calculations. The first one is to simulate liquid crystal transition under external electric field, this transition is called Fréedericksz transition. The simulation of Fréedericksz transition is done by solving Poisson's equation and minimizing the Oseen-Frank free energy. The second one is to calculate polarization of light when it propagates through the liquid crystal device. Extended Jones matrix method is used to calculate polarization of light and the transmission. The last part is colorimetry calculation. It calculates human color perception by the light emitted from LCD devices.\\\\\r\n\r\nSimulation codes are written in C++ and Cython is used to provide Python interfaces, so that users can run simulations or build user interfaces through Python while no loss of performance.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "icbm0926@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "numerical simulation, finite-difference, optics, Cython, OpenMP", "abstract": "LCD is a mature display technology and widely adopted in consumer electronics. Being able to simulate LCD device is important to understand how it works as well as improve LCD technology. OpenLCDFDM is a program which uses finite difference method to perform LCD simulations. This talk will give introductions of how an LCD display works and the methods used in OpenLCDFDM to simulate such devices.", "additional_info": "1. Optics of Liquid Crystal Display by Pochi Yeh and Claire Gu. ISBN: 0470181761\r\n2. Fundamentals of Liquid Crystal Devices by Shin-Tson Wu and Deng-Ke Yang. ISBN: 978-0-470-03202-2\r\n3. OpenLCDFDM: https://github.com/xingularity/OpenLCDFDM", "reviews": [{"comment": "Somehow google give zero result with \"OpenLCDFDM\". The author didn't mention about if OpenLCDFDM will be release to public or just for internal use. But would be nice to know how python used in practical simulation.", "reviewer": "yuanchao", "rank": 3}, {"comment": "It is interesting to see continuum-based first-principle simulations with Python.  The abstract didn't contain information about the architecture of the software.  The combination of Cython and C++ is intriguing.", "reviewer": "yungyuc", "rank": 4}, {"comment": "Fits as a SciPy talk. Seems to be based on concrete design and extend use of Python. Would be interesting for practical Python users in engineering.", "reviewer": "whosaysni", "rank": 4}], "id": 73, "duration": "40 mins", "title": "Liquid crystal device simulation with Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "This presentation will explain and demo how Python could be interacted with the popular compiler infrastructure project -- LLVM, and is trying to show Python's great ability to release the productivity of programmers via integration with the underlying software.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "hkli2013@126.com", "speech_type": "Regular Talk", "tags": "Python, LLVM ", "abstract": "1)  Analysis and comparison of the software architecture against various LLVM Python    \r\n     bindings such like the built-in one, llvmlite, llpy and llvmpy, which also includes some\r\n     samples.\r\n2)  Research of the LLDB debugger and its Python bindings, and explain how Python is       \r\n     integrated with the debugger and its application, together with an analysis of PEDA--\r\n     Python helper of the debugger.\r\n3)  Research of the design of the next generation disassembly framework \"Capstone\" --  \r\n     which is based on the LLVM MC, and will demo a simple project of a visual front-end \r\n     for Capstone that written in Python/Qt.\r\n", "additional_info": "https://www.python.org\r\nhttp://www.llvm.org\r\nhttps://github.com/numba/llvmlite\r\nhttps://github.com/o11c/llpy/\r\nhttp://www.llvmpy.org/\r\nhttp://lldb.llvm.org/\r\nhttps://github.com/longld/peda\r\nhttp://www.capstone-engine.org/\r\nhttp://blog.llvm.org/2010/04/intro-to-llvm-mc-project.html", "reviews": [{"comment": "* Can't wait to attend a talk of this topic, the mythical LLVM with Python!\r\n* \"Introduction\" level talk with this sexy topic?! I start worrying if the topic is too intuitive or tough...", "reviewer": "drakeguan", "rank": 3}, {"comment": "It looks like the geek level talk~", "reviewer": "stanley", "rank": 4}, {"comment": "* Should be an advanced topic\r\n* Connect the dots between Python, llvm, and de-compiler\r\n* Also interesting in Capstone", "reviewer": "AlfredW", "rank": 4}, {"comment": "Connecting the LLVM & Python is an exciting and very futuristic topic.", "reviewer": "keitheis", "rank": 5}], "id": 74, "duration": "40 mins", "title": "Python & LLVM", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Our company develops and providing a mobile learning platform “goocus”, which is optimized for smartphones and tablets. The server-side of the platform is developed with the Django framework of Python.\r\n\r\nSince 2013 our company have developed a mobile learning platform called “goocus pro”. This time we spent about a year to refurbish the design and modeling of our service since we start creating the service design of the new “goocus” in 2014.\r\n\r\nThe goal of redesign and remodeling of the service is to achieve a large-scale education and training that existing services cannot offer. That is why we aspired the sophisticated and robust backend system.\r\n\r\nDuring this process of backend engineering we put great emphasis on unit tests. They made it easy to develop a web service that stands up to large-scale use, enhancing the engineering efficiency at the same time. This presentation delivers the real case study where we utilized unit tests for our service development.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "shunsuke_hida@me.com", "speech_type": "Lightning Talk", "tags": "Django", "abstract": "Based on the actual case of our web service development, this presentation reports how unit tests contribute to increase the engineering efficiency in the backend development of large-scale web service.", "additional_info": "", "reviews": [{"comment": "it would be a good sharing in lightning talk.", "reviewer": "stanley", "rank": 4}], "id": 75, "duration": "40 mins", "title": "The Effectiveness of Unit Tests in Django Backend Engineering of Large-scale Web Service", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "       唇語辨識領域是我目前在碩士班鑽研的研究方向，我希望能藉由這次在 PyCon 的分享讓大家知道 \"阿! 原來 Python 也能用在這! \"，就像我第一次參加 Taipei.py 時有的那種大開眼界的體會一樣。\r\n       唇語辨識結合了語音辨識及影像辨識，而其中語音辨識的研究相較於影像辨識是較為豐富且廣泛的，但若只分析語音訊號是不足以適應各種環境上的考驗，如嘈雜地區或收音不佳的環境下，語音辨識的效果就極不樂觀。因此，我從影像方面來著手研究，我收集了許多連續數字的影像檔作為我研究用的資料，以 Python' OpenCV 及機器學習方面的技術開發演算法，試圖找出連續數字中每個數字的開頭時間及結束時間，若能準確的標出每個數字的位置對後續的辨識將提供強大且穩健的基礎，這是我希望能提供給聽眾們的資訊。\r\n       在我的分享中，演算法的部份並不會花太多時間介紹，重點會放在研究點子的起源、結果展現及未來應用上，讓普羅大眾對我的研究領域都能有概略性的輪廓。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "yuchilin43@gmail.com", "speech_type": "Regular Talk", "tags": "speech recognition, lip recognition, pattern recogniton", "abstract": "       我所介紹的內容將著重於唇語的影像辨識上，我們從現實生活的經驗裡能得知，在嘈雜環境下只由聲音來與他人溝通是困難且模糊的，但若你能同時看著對方的唇形，將能大幅提昇對話的品質。為了實現這個目標，我採用 Python' OpenCV 來對影像做分析處理，從影像中擷取出代表性的特徵，進一步觀察連續的字元在轉換時是否具有相似的特徵點。未來將結合語音訊號，增強語音辨識的效能。", "additional_info": "[Paper Reference]\r\n1.  Lucey, P. and Sridharan, S. Patch-based representation of visual speech. In HCSNet Workshop on the Use of Vision in Human-Computer Interaction, 2006\r\n2. G. Zhao , M. Barnard and M. Pietik&auml;inen  \"Lipreading with local spatiotemporal descriptors\",  IEEE Trans. Multimedia,  vol. 11,  no. 7,  pp.1254 -1265, 2009\r\n\r\n[OpenCV]\r\nhttps://opencv-python-tutroals.readthedocs.org/en/latest/ ", "reviews": [{"comment": "We got a few talks from either speech or vision pattern recognition, \r\nbut a talk combining both filed and built on top of practical application? Can't wait to see.", "reviewer": "liang2", "rank": 4}, {"comment": "Interesting. I'm looking forward to.", "reviewer": "stanley", "rank": 4}, {"comment": "exciting new application", "reviewer": "marr", "rank": 5}, {"comment": "I'd like to see the how lip recognition works with Python.", "reviewer": "keitheis", "rank": 4}], "id": 76, "duration": "40 mins", "title": "Python 讓你的眼睛聽得見", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "A. 環境設定（0.5 小時）\r\n    1. 使用 Serial + WiFi\r\n    2. 使用 VNC 和 X-Forwarding\r\nB. Raspberry Pi GPIO 簡介（2 小時）\r\n    1. 電壓、電流和電阻\r\n    2. 數位/類比 x 輸入/輸出\r\nC. 馬達簡介 （1 小時）\r\n    1. 直流馬達介紹\r\n    2. 用 Raspberry Pi 控制直流馬達\r\nD. 遠端控制使用無線網路、藍牙與紅外線 3.5 小時)\r\n    1. 藍牙原理\r\n    2. 紅外線原理", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "sorry702@gmail.com", "speech_type": "Workshop", "tags": "Raspberry Pi, Python, Remote Car, GPIO", "abstract": "本次工作坊會介紹如何使用 Raspberry Pi 做遙控車，包括無線網路、藍牙與紅外線", "additional_info": "", "reviews": [{"comment": "Hands down.", "reviewer": "marr", "rank": 5}, {"comment": "Maker topic always interests people.", "reviewer": "stanley", "rank": 5}, {"comment": "Super cool, can't wait to get both hands dirty.", "reviewer": "liang2", "rank": 5}, {"comment": "期待成品~", "reviewer": "Yen", "rank": 5}], "id": 77, "duration": "Whole Day", "title": "Raspberry Pi Remote Car + Python 工作坊", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "It's 6th years of PyCON APAC since 2010, hosted in Singapore, Tokyo and Taipei. Nowaday, in 2015, number of local PyCONs in Asia Pacific increased to 10. It's a good opportunity for PyCON organisers and teams to meet in Taipei, to discuss the future development of PyCON APAC, and meet with old and new PyCON friends in Asia Pacific. \r\n\r\nSammy Fung, organiser of PyCON HK and committee members at other Asia open source conference/summit will host a session, and invites past PyCON APAC organisers and PyCON organisers in Asia Pacific to meet and discuss the future development of PyCON and python community in the Asia Pacific.", "talk_perm": "Don't record my talk", "language": "English", "author": "sammy@sammy.hk", "speech_type": "Regular Talk", "tags": "pycon, apac", "abstract": "It's 6th years of PyCON APAC since 2010, hosted in Singapore, Tokyo and Taipei. Nowaday, in 2015, number of local PyCONs in Asia Pacific increased to 10. It's a good opportunity for PyCON organisers and teams to meet in Taipei, to discuss the future development of PyCON APAC, and meet with old and new PyCON friends in Asia Pacific. ", "additional_info": "- PyCON HK organiser (website: http://2015.pycon.hk)\r\n- Member, Program Committee, COSCUP 2013: http://coscup.org\r\n- Member, GNOME Asia Committee (organised GNOME Asia Summit in HK, Seoul, Beijing and Depok this year) since 2012: http://gnome.asia\r\n- Mozilla Representative and Mozilla HK Community Liaison.\r\n- Others.\r\n", "reviews": [{"comment": "Good to see the momentum in APAC community is growing.", "reviewer": "liang2", "rank": 4}, {"comment": "We should always have this kind of mindset to keep APAC community growing.", "reviewer": "stanley", "rank": 4}, {"comment": "It's an important topic we care very much. :)", "reviewer": "keitheis", "rank": 5}, {"comment": "A must-have topic for a conference.", "reviewer": "jin", "rank": 5}, {"comment": "If it is just a talk, I think it is better to be a lightning talk.\r\nMaybe it will run with more conversation with audience? If not, I think 40min is too long for this topic, even if \"the future of PyConAPAC\" is a worthy talk.", "reviewer": "apua", "rank": 2}], "id": 78, "duration": "40 mins", "title": "Future Development of PyCON in Asia Pacific", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "Prerequisites:\r\n一台能上網的電腦\r\n基礎python語法認識\r\n\r\nOutline:\r\n\r\n## 小時一、爬蟲穿新衣\r\n    - talk: introduction\r\n        - 網頁資料呈現的形式\r\n    - lab: Facebook Graph API\r\n        - 拆解內容取得想要的資料\r\n        - 今年我被按了多少讚??\r\n\r\n## 小時二、爬蟲肚子餓\r\n    - talk: \r\n        - handling requests (GET, POST)\r\n        - Parsing Tools (BeautifulSoup4, pyquery, lxml, pandas, re)\r\n    - lab:  Yahoo news and PTT\r\n\r\n## 小時三、爬蟲去覓食\r\n    - talk\r\n        - Parser Skills (Encoding, Table, csv, json, xml, and some bad data)\r\n        - database(SQLite)\r\n    - lab:\r\n        - 臺灣證券交易所\r\n\r\n## 小時四、爬蟲去考試\r\n    - talk\r\n        - Web Drivers (selenium, phantomjs)\r\n    - lab: \r\n        - 懶人自動化訂票 or 下單\r\n\r\n## 小時五、爬蟲挖地道\r\n    - talk\r\n        - Advanced Connector Skill (TOKEN, COOKIE)\r\n    - lab: \r\n        - 懶人自動化 (高速) 訂票 or 下單\r\n\r\n## 小時六、自己的爬蟲自己寫\r\n    - Final Project:\r\n        - 擷取當日PTT八卦版前三大戰文\r\n        - Coursera 自動加入”當前沒有班次”的課程\r\n        - 自己提出爬蟲idea來實現\r\n", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "adrianliaw2000@gmail.com", "speech_type": "Tutorial", "tags": "crawler, web", "abstract": "「現在告訴我，我是一個人，還是一隻爬蟲呢？」\r\n\r\n網路爬蟲程式是模仿人類行為自動造訪網站並擷取網站訊息的程式，具有極高商業應用價值。本教學活動透過動手實作，讓您具有網路爬蟲程式的基本概念與實戰能力。您可以從取得新聞、PTT戰文、社群網站內容擷取、懶人訂票等各種範例中，學到征服常見網頁的爬蟲技術。", "additional_info": "public crawler tutorial by c3h3:\r\nhttp://nbviewer.ipython.org/github/c3h3/nccu-crawler-courses-201411/tree/master/\r\n\r\nWeb Scraping with Python: A Comprehensive Guide to Data Collection Solutions http://www.amazon.com/Web-Scraping-Python-Comprehensive-Collection/dp/1491910291", "reviews": [{"comment": "Practical and Appealing. It really is a whole day workshop, for Python, Web / Networking basics is prerequisite. Good to see the materials seem well prepared already.", "reviewer": "marr", "rank": 5}, {"comment": "清楚且明確的大綱, 輔以適合的 lab。相信如果每一段的練習都能實做出來, 一定會有很豐富的收穫。", "reviewer": "sosorry", "rank": 5}], "id": 54, "duration": "Whole Day", "title": "模仿遊戲 用爬蟲類學爬蟲", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "**Improve Your Testing with Pytest and Mock**\r\n\r\n- Why Pytest?\r\n- Installation\r\n- Our First Test\r\n- Testing Exceptions\r\n- Context-Sensitive Comparisons\r\n- Classic xUnit Setup / Teardown\r\n- Pytest Fixtures\r\n- Verifying Calls with Mock\r\n- Stubbing Return Values\r\n- Monkeypatching\r\n- Pytest Plugins\r\n- Time For Questions", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "gabe@avantbard.com", "speech_type": "Regular Talk", "tags": "testing, mocking, tdd", "abstract": "Testing code with Pytest is an absolute pleasure. Less boilerplate makes your test more concise and its fixtures system helps you share setup code while still keeping your tests clear and understandable. I'll tell you all about how to get basic unit testing done, and I'll show you how to use Voidspace's Mock library to test collaborations between your objects, too.", "additional_info": "I gave a version of this talk at the Singapore Python meetup on March 26th, 2015.  It seemed to be well-received, and I'd love to share a version of this talk at PyCon SG, too! =-)\r\n\r\nThere's a video of my talk from the meetup here: https://www.youtube.com/watch?v=k99HSHQDsi4\r\n\r\nEstimated talk time: 35 minutes.  \r\nIntended audience: folks new to testing, or people with experience with unittest who are interested in seeing what Pytest has to offer.", "reviews": [{"comment": "Pros\r\n* Basic Level in using PyTest, \r\n* Covering most of PyTest features\r\n* Joined this talk before (in Singapore), his explanation was clear.\r\n\r\nCons\r\n* Audiences should be familiar with Python and experienced in Python Web Development.\r\n* Lack of usage scenario.", "reviewer": "AlfredW", "rank": 3}, {"comment": "Just compared his talk (from Youtube) and another one (from Live/Youtube).\r\nI'll more prefer the second one.\r\nIn the mean time, due to avoid having similar talk in the same conference,\r\nI just lower the rank of this talk.", "reviewer": "stanley", "rank": 2}, {"comment": "The lecture looks quire well prepared.", "reviewer": "drakeguan", "rank": 3}, {"comment": "Testing is an important and basic topic, and it seems the speaker has prepared.\r\nBut the \"Audience level\" may not be \"introduction\"", "reviewer": "apua", "rank": 4}], "id": 81, "duration": "40 mins", "title": "Improve your testing with Pytest and Mock", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "功能面需求\r\n- 相依性高: 需要複雜 requirement\r\n- 自動辨別工作必須循序執行或是可平行 (corountine) \r\n- 使用 functional 的方式避免重複執行\r\n- 需要群集的方式來 allocate 資源，並且執行，動態調整\r\n- repo 協同作業，使用 docker\r\n- Environment 乾淨，並且可以與 CI, CD 整合\r\n- 除了 coding 以外的東西都整合在一起並且自動化\r\n- 管理方便的圖性化介面\r\n- 彈性的事件觸發 (HookEvent, Cron)\r\n\r\n目錄:\r\n1. Why we create Task Manager (George)\r\n2. [Past] Compare to other framework\r\n3. [Future] How we design Task Manager\r\n    3.1 Container based task management \r\n    3.2 Continues Integration -> Continues Deploy -> Continues Execution?\r\n4. Task Manger Design Principle \r\n5. Sample Usage and Demo", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "lucemia@gmail.com", "speech_type": "Regular Talk", "tags": "django, web, task, docker", "abstract": "隨著功能增加，在資料處理時需要牽涉的服務越來越多, 相互之間的關係越來越複雜, 為了解決每天營運需要處理的資料，服務，流程問題，配合 docker 解決方案，出現能解決掉原本的限制的可能性，才會自幹這個開源的專案．", "additional_info": "Will give talk with George together :)", "reviews": [{"comment": "I doubt it was a sponsor talk.", "reviewer": "stanley", "rank": 5}, {"comment": "Seems interesting on how a startup creates a solution to deal their daily routine. I expected a fun and clear talk.", "reviewer": "keitheis", "rank": 4}, {"comment": "經過實際驗證過可行的分享只能給推了。 希望能介紹演進的心路歷程，讓聽眾能以歷史借鏡有更多的收穫。", "reviewer": "sosorry", "rank": 4}], "id": 80, "duration": "40 mins", "title": "Tagtoo Task Manager", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Present a number of interesting projects that are highly relevant to creating stories with Python. Describe what's great about using Python to create both fictions and nonfictions. Stir conversations about programming in creative writing. ", "talk_perm": "Don't record my talk", "language": "English", "author": "yahsinhuangtw@gmail.com", "speech_type": "Regular Talk", "tags": "Creative Writing, Fictions, Non-fictions, Literature, Python", "abstract": "This talk aims to encourage fiction and nonfiction writers to explore new approaches to writing. We will discuss about the successful projects and the challenges associated with crafting stories with Python. Finally, we will talk about how programming is changing the way we read and write.", "additional_info": "Virtual Muse: Experiments in Computer Poetry by Charles Hartman\r\nIntroduction to Electronic Literature: a freeware guide\r\nBird, Klein and Loper. Natural Language Processing with Python\r\nBorsuk, A. The Upright Script: Words in Space and on the Page\r\nMontfort, N. On Reading", "reviews": [{"comment": "*  Story sharing\r\n*  Know more about python in another aspect.", "reviewer": "AlfredW", "rank": 2}, {"comment": "I can get the idea from the reference, but no more information.", "reviewer": "sosorry", "rank": 2}, {"comment": "A little bit wondering what this talk might become eventually.", "reviewer": "drakeguan", "rank": 4}, {"comment": "The author didn't provide enough information to judge his talk.\r\nIn personally, I'm so curious about how the talk would be represented at the end.", "reviewer": "stanley", "rank": 3}], "id": 82, "duration": "40 mins", "title": "Creating Stories with Python", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "The flow of talk may go like this,\r\n1. Introduce concept of OpenCL\r\n- What's OpenCL\r\n- How can we get benefit from it\r\n\r\n2. Introduce PyOpenCL and basic usage\r\n- OpenCL + Python\r\n- A look to its API\r\n\r\n3. Kernel-mapper\r\n- The idea and why we're doing this. Basically, if you want to use PyOpenCL, you might also need to get familiar with numpy / pyopencl.tools / pyopencl.array, and the data/class are kind of confusing ...\r\n- How we make it simpler than original PyOpenCL in certain usage case. We're trying to define rules (in JSON format) to automatically generate kernel.c/kernel.h for OpenCL usage. And a python file will be generated for python programmer to use. In this case, someone who are familiar with opencl kernel programming can do his job without any experienc in python, and python programmer can wired up the execution logic without knowing how to write opencl kernel.      They are linked by data structures that defined in the JSON.\r\n \r\n4. Demo\r\n- The idea is to demostrate the performance improvement for certain computation in CPU / GPU. \r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "kilik.kuo@gmail.com", "speech_type": "Regular Talk", "tags": "PyOpenCL, GPU, Performance", "abstract": "We'd like to provide a simpler way for people to utilize GPU power via PyOpenCL.\r\nAlso provide a more clearer line to separate tasks easily for people we're good at OpenCL kernel programming & python programming. ", "additional_info": "Wiki - https://github.com/PyOCL/kernel-mapper/wiki/What-is-Kernel-Mapper\r\nCode - https://github.com/PyOCL/kernel-mapper\r\nSlide (Work In Progress) - http://goo.gl/qmy0y7\r\n\r\nThere're 2 authors contributing to this project.  John Hu / Kilik Kuo,\r\nKilik Kuo will be the speaker, but I'm wondering if it's ok to put both authors in handbook once this proposal has been selected ?\r\n", "reviews": [{"comment": "* OK of originality.  The purpose of project is like an \" Interface Wrapper and Generator \", such techs are widely used in SWIG or other frameworks. This one is for OpenCL.\r\n\r\n* It is complicated to map structures and build kernel mapping through pyopencl. You need to study lot of documents to make it correctly. Hope this project could ease the pain of current scenario.\r\n\r\n", "reviewer": "AlfredW", "rank": 4}, {"comment": "My kudo to Kilik Kuo and his given talks I attended. OpenCL is also an interesting topic.", "reviewer": "keitheis", "rank": 5}, {"comment": "An Interesting and challenging topic. ", "reviewer": "yudalin", "rank": 5}], "id": 48, "duration": "40 mins", "title": "Kernel-mapper (Tool to simplify the use of PyOpenCL)", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "目標聽眾：是已經有開發架設網站的經驗，但是卻沒有建置過能乘載c10k以上服務\r\n\r\n背景知識：至少一套以上的Python Web Framework (Django, Pyramid, Flask, and etc)，對於Standard Unix架構與雲端服務有基本認知\r\n\r\n主要是以觀念與實際範例介紹，給予聽眾一些啟發與起頭，並且指引一些後續可以深入的方向", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "theonlin@gogolook.com", "speech_type": "Regular Talk", "tags": "web, architecture, cloud platfrom", "abstract": "當我們開發好網站之後，也順利上線了之後，隨著使用者的人數不停的上升，漸漸一台主機逐漸再也負擔不起經常性的使用者流量，本議程將會介紹各種不同層面的技巧與觀念，協助網站提高服務承載量，包含了頁面Cache的機制，善用非同步訊息佇列，調整單一伺服器的系統架構，到利用最為先進的雲端服務，建置服務叢集。", "additional_info": "", "reviews": [{"comment": "* Sort of fundamental but not-easy-to-master topic. There should be always a demand for this topic.", "reviewer": "drakeguan", "rank": 3}, {"comment": "This topic shouldn't be introductory I guess.", "reviewer": "liang2", "rank": 3}, {"comment": "An pragmatic subject and not easy master. Kind of short description here.", "reviewer": "keitheis", "rank": 3}, {"comment": "How to scale up the system? It's a difficult question to answer. There must be some people suffering about this kind of issue everyday.\r\nFor me, it's good to hear that the speaker would take this challenge to share the scaling experience to audience.\r\n", "reviewer": "stanley", "rank": 4}, {"comment": "Your talk would be very closely related to one of the main focus in Pycon 2015, because we have several cloud-computing service company as our sponsor. I think the application of the cloud service would be popular in our event. ", "reviewer": "Yen", "rank": 4}, {"comment": "Look like the speaker has clear goal and knows what he will introduce. I think it will be a rich talk.\r\nIn addition, it is a very useful topic and there is not many talk about it this year, so I think it is worthy.", "reviewer": "apua", "rank": 5}], "id": 89, "duration": "40 mins", "title": "How to scale up your Web Apps/Sites written by Python?", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Agenda:\r\n  - 一般國中生學寫程式\r\n  - 我為什麼學寫程式\r\n  - 踏出寫程式的第一步\r\n  - MOOC\r\n  - 在家自學的國三\r\n  - 15歲以上未滿16歲受僱從事工作者，係為童工。\r\n  - 等等我還沒滿15歲啊\r\n  - 總結", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "adrianliaw2000@gmail.com", "speech_type": "Regular Talk", "tags": "education", "abstract": "我目前就讀國中三年級，我從十二歲時開始學習Python，這場talk我想分享一些這段時間自學的經驗，以及為什麼能夠比其他學寫程式的國中生突出。", "additional_info": "不要再說雇用童工了 我不是童工 http://bola.gov.taipei/ct.asp?xItem=43585057&ctNode=63848&mp=116003", "reviews": [{"comment": "挑戰講者年紀下限記錄", "reviewer": "marr", "rank": 4}, {"comment": "The learning experience is very important and one of my most interested issue. And the self-teach & Python is my favorite.", "reviewer": "keitheis", "rank": 5}, {"comment": "我們對於熱血的青年都應該給予鼓勵，讓他們有更多機會可以練習。", "reviewer": "sosorry", "rank": 4}, {"comment": "初生之犢不畏虎。\"為什麼能夠比其他學寫程式的國中生突出\"這句話很吸引人啊!", "reviewer": "jin", "rank": 4}, {"comment": "童工 :D", "reviewer": "sponsor", "rank": 5}, {"comment": "It would be insane to see this child presenting on the stage.", "reviewer": "drakeguan", "rank": 5}, {"comment": "It will be a good sharing from junior high student.\r\nBut it seems more suitable for lightning talk.", "reviewer": "stanley", "rank": 2}], "id": 88, "duration": "40 mins", "title": "國中打拍 自學經驗談", "decision": "Undecided", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "This talk would be more like case studies about equity portfolio construction.\r\n\r\nI would share some experience/example...\r\n\r\n(1) what are the most common mistakes when building a equity portfolio? \r\nOne of them is overfitting.\r\n\r\n(2)  what would happen if you run the overfitting model? \r\nDefinitely you will loss money.\r\n\r\n(3) how to examine whether your portfolio is overfitting? \r\nYou have to run some test in order to make sure that your portfolio is safe from the threat of overfiting. I would give some solution by using Monte Carlo simulation, bootstrapping, and some test statistics borrowed from some academic papers. \r\n\r\n(4) What are the useful Toolkit in Python?\r\nI would use lots of data analysis packages, including ipython, numpy, scipy, and pandas,  and some visualization tool like matplotlib and seaborn.\r\n\r\n\r\nWhat I expect to bring to the audience might be...\r\n(1) Always keep asking yourself whether the result is overfiting or not. Without doing so, you would get into a trouble!\r\n(2) Share my experience how Python works in the field of quantitative finance.\r\n\r\n\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "yen.chiayi@gmail.com", "speech_type": "Regular Talk", "tags": "portfolio, quantitative finance, overfitting", "abstract": "You never know how to build a successful portfolio that always gives you significant return, but you definitely should know what would make you build a model that is doomed to be a failure. \r\n\r\nOverfitting is the most common one. In the brief talk, I would like to share some experience how to avoid overfitting. At least in some ways.\r\n\r\nThe examples would be shown in Python toolkit like ipython, pandas, numpy, matplotlib, and seaborn.", "additional_info": "", "reviews": [{"comment": "* ipython! matplotlib! How could we miss this stuff!", "reviewer": "drakeguan", "rank": 5}, {"comment": "It seems very interesting, especially while losing money.", "reviewer": "keitheis", "rank": 5}, {"comment": "We could never reject the topic for earning money.", "reviewer": "stanley", "rank": 4}, {"comment": "Nice sharing!", "reviewer": "c3h3", "rank": 5}, {"comment": "- Good, I need this.", "reviewer": "AlfredW", "rank": 5}], "id": 91, "duration": "40 mins", "title": "Millions way to avoid overfitting when building a portfolio ", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "不論是在學習任何的事物時，「觀察直覺」以及「實作技術」都是最重要的兩大塊。只有深刻的直覺，才可以駕馭藝術般的實作技術；同樣的，也只有在透徹了解「各種實作技術的缺點與限制」時，才能在許多的碰撞與挫折的經驗中，翠練出深刻的直覺與觀察力。\r\n\r\n同樣的，在資料分析的各個領域中，「技術」與「直覺」也常常是相輔相成的，必須一起學習，才能夠深入而淺出！因此，講者特別設計的一套課程，可以讓大家 (甚至是沒作過任何資料分析的人)，都可以運用最方便的技術與工具，在最少的操作障礙之下，體驗資料分析中最重要的「技術」與「直覺」。\r\n\r\n教學的過程，將採取一個短演講，搭配一個長操作的交替方式進行。在每一個主題的前行短演講中，講者將會介紹該主題中，最重要的「觀察直覺」與「思考哲學」，讓大家可以預先「認識問題」、「思考問題」、「了解問題」、或甚至「換個方式看問題」﹍ （這部份的課程，主要著重於「直覺與觀念的建立」與「創意的發想與思考」。）\r\n\r\n而其後所接的操作時段，則是讓大家可以跳脫「憑空想像」，更進一步的「動手去感覺資料」、「和資料互動」、「挖掘問題背後的解答」、並且「感覺解答背後的問題」﹍（這部份的課程，主要著重於「實際的操作並分析資料」與「感覺各種方法的侷限與障礙」。）\r\n\r\n\r\nTimeline :\r\n[3hrs] Probability Modeling\r\n** What is Probability ?\r\nProbability is in your mind ! \r\nHow to guess the probability ?  \r\nWhat is the information behind evidences ?\r\nWhat is a fair coin ?\r\nWhy need Probability Modeling ?\r\nWhat is the difference between Probability Modeling and other methods? \r\n\r\n** Problems in Infinite Dimensional Vector Space\r\nProblems in NLP\r\nProblems in Lottery\r\nProblems in Stocks\r\nProblems in Audio Mining and Computer Vision\r\nProblems in Recommendation System\r\n\r\n\r\n** Hands-on Probability Modeling with Lottery, Stock and PTT Data\r\n無敵的 Join Probability\r\n像微分般的 Conditional Probability\r\nGroupBy 與 Join Probability\r\n兩種不同的 DataFrame：\r\nStates Table\r\nPivot Table\r\nPivot Table 與 Conditional Probability\r\n\r\n** Hands-on Language Modeling\r\nN-Gram Models\r\nModel Smoothing\r\nbackoff models\r\nconstruct new Probability Model from old Probability Models\r\n\r\n** Hands-on Advanced Probability Models\r\nGraphical Models\r\nConditional Random Fields\r\nSturcture Learning Models (不一定有時間講到)\r\nMarkov Random Fields (不一定有時間講到)\r\n\r\n\r\n[3hrs] Learning From Text Data\r\n\r\n** Basic Concept of Text Mining\r\nword segmentation\r\nTF-IDF\r\nTerm-Document Matrix\r\nDocument Similarity\r\n\r\n** Streaming Processing\r\niterator and generator\r\ndata processing with redis\r\nunknown word extraction \r\nevent detection\r\n\r\n** Indexing and Retrieval\r\nLatent Semantic Indexing (SVD)\r\nEvent Clustering\r\nSimilarity Queries\r\n", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "c3h3.tw@gmail.com", "speech_type": "Workshop", "tags": "NLP, Text Mining, CRF, Streaming Data Mining, Probability Modeling, Language Modeling", "abstract": "本課程將透由一連串的實作練習，帶領聽眾學習 Probability Modeling 和 Text Mining 的各種技巧！\r\n\r\n在課程中，你將會學到：\r\n(1) 如何設計，規劃，並建構一個機率模型 (以簡易的樂透下注模型為例)\r\n(2) Text Mining 和 Language Modeling 的各種技術\r\n(3) 文本分析技巧 (以 PTT 或 Facebook 等論壇文章為例)\r\n(4) streaming 文本分析，如何動態抽取新詞，動態觀察熱門關鍵字詞 (可能會搭配 elasticsearch)\r\n(5) 文本的分類與分群問題，如何解決？以及如何加速？\r\n\r\n\r\n本課程有兩位講師：\r\n張家齊，陳嘉葳\r\n\r\n", "additional_info": "http://pycontw.kktix.cc/events/play-data", "reviews": [{"comment": "definitely", "reviewer": "marr", "rank": 5}, {"comment": "It has the well design workshop and has clear learning path. It's definitely worth to be recommended for all level of Pythonists to join the party.", "reviewer": "stanley", "rank": 5}, {"comment": "good workshop topic.", "reviewer": "tjw", "rank": 5}, {"comment": "清楚的介紹，相信這個工作坊可以學習到許多東西。", "reviewer": "sosorry", "rank": 5}, {"comment": "pretty intense course design, good for both beginners and advanced learners.", "reviewer": "jin", "rank": 4}, {"comment": "This topic is truly useful for the project I am working on!", "reviewer": "yudalin", "rank": 5}], "id": 98, "duration": "Whole Day", "title": "Play Probability Modeling and Text Mining", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "In the talk, I'm going to run through many common examples in this manner:\r\n- What are we trying to solve? (In real examples from our daily job)\r\n- What are the problems derived if we solve the problem intuitively? (The beginners' way)\r\n- How can we apply design patterns to avoid those derived problems and make our code simple and flexible.\r\n\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "sushi@zenblip.com", "speech_type": "Regular Talk", "tags": "Idiom, Pattern", "abstract": "The Python community has learned a lot about how to use the language with good practices, and instead of telling you what each of the pattern's definition and philosophy are, this talk is going to give you a series of examples and good ways to solve the problems that I wish I knew when I was a beginner.", "additional_info": "http://legacy.python.org/workshops/1997-10/proceedings/savikko.html\r\nhttp://ivory.idyll.org/articles/advanced-swc/\r\nhttps://www.youtube.com/watch?v=Er5K_nR5lDQ\r\nhttps://github.com/faif/python-patterns", "reviews": [{"comment": "* It's always great to see the talk about suggested pythonic way to solve things!\r\n* The references are good.", "reviewer": "drakeguan", "rank": 4}, {"comment": "Every conference should has this kind of talk to encourage people to understand language more deeply.", "reviewer": "stanley", "rank": 3}, {"comment": "Good to see talk about design pattern and best practice from one's experience.", "reviewer": "liang2", "rank": 3}, {"comment": "a great topic for python developer and future pythonista.", "reviewer": "jin", "rank": 4}, {"comment": "Great topic. community needs the talk. ", "reviewer": "tim", "rank": 3}], "id": 96, "duration": "40 mins", "title": "Useful Idioms and Patterns in Practice", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "I'm in charge of content platform for video streaming service built in KKBOX. One of our task is to process media files on AWS before they get streamed. The processing is a workflow of several asynchronous/synchronous tasks on cloud. The idea of render farm management in VFX and animation industries are borrowed here to build a job (workflow) dispatching system. I will share how we make use of AWS SWF to build the system, the idea and benefits of job script and some real usages of it on processing for video and/or audio stream services.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "drake.guan@gmail.com", "speech_type": "Regular Talk", "tags": "cloud computing, AWS, SWF, workflow", "abstract": "One of advantages about cloud computing is potentially huge-scale resources for your task. And it's especially beneficial to data driven process with heavy computing. In this talk, the idea of job script to orchestrate the execution of workflows across multiple computing nodes is introduced. An implementation based on AWS SWF (Simple Workflow) is described with examples of processing for music streaming and video streaming in KKBOX.", "additional_info": "* http://aws.amazon.com/swf/\r\n* https://github.com/spotify/luigi", "reviews": [{"comment": "Architecture Design and Experience Sharing of a real system. I am interesting in this. \r\n", "reviewer": "AlfredW", "rank": 3}, {"comment": "講題很好，相信一定能有很多實務經驗可以分享。", "reviewer": "sosorry", "rank": 4}, {"comment": "We must could learn how to deal with big scale data on KKBOX.", "reviewer": "stanley", "rank": 4}], "id": 92, "duration": "40 mins", "title": "Orchestrating the execution of workflows for media streaming service and even more", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "This talk is about how python is used in cloud computing as well as while configuring cloud infrastructure. It also gives brief about tools and technologies/libraries can be used for number of tasks while cloud development/execution. Developers and all python lovers are the perfect audience for this talk. They will get the brief about reliable stack of python based tools used in cloud development and also will be sharing the experience with python.", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "boom.shukla@gmail.com", "speech_type": "Regular Talk", "tags": "python, cloud computing, programming", "abstract": "Python in cloud. \r\nKind of services build with python.\r\nPython based tools used in deployment and configuration management for the cloud.\r\nFor every python lovers - How to create a python friendly cloud infrastructure with great reliable combination of many stable tools.\r\nStability.\r\nExperience sharing. ", "additional_info": "I recently presented my talk over python in PyGuj [ a python user group in Gujarat] in a kick start event. The agenda was sharing the best practices over python and also the personal experience on it. Moreover, I also shared the python's usage over cloud infrastructure and building cloud services through it.\r\n", "reviews": [{"comment": "* The topic is quite sexy.\r\n* But the provided abstract and description are not that clear, but just some adjacent terms.", "reviewer": "drakeguan", "rank": 3}, {"comment": "Sounds interesting.", "reviewer": "stanley", "rank": 4}, {"comment": "Kind of intro talk and not sure what lessons in it.", "reviewer": "keitheis", "rank": 2}, {"comment": "Since \"cloud\" is a big idea, I can see any exactly description above, so I think the goal of this talk is not clear.", "reviewer": "apua", "rank": 2}, {"comment": "Your talk would be very closely related to one of the main focus in Pycon 2015, because we have several cloud-computing service company as our sponsor. I think the application of the cloud service would be popular in our event. The more the better.", "reviewer": "Yen", "rank": 4}], "id": 93, "duration": "40 mins", "title": "Python for Cloud Services and Infrastructure Management", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Extreme"}, {"description": "We will present the concept of building, back-testing, and managing our fund of fund portfolio.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "b95042@gmail.com", "speech_type": "Regular Talk", "tags": "financial, portfolio, management", "abstract": "Here we introduce how to use the python specific modules to build portfolio about fund of fund in real life. ", "additional_info": "", "reviews": [{"comment": "Too lack of detail, especially when related talks are available.", "reviewer": "liang2", "rank": 1}, {"comment": "Surprisingly in-complete submission.", "reviewer": "drakeguan", "rank": 1}, {"comment": "It's seldom to hear this kind of topic but it's so pity that lacking more detail information of talk and hard to understand what he will say.\r\n\r\n== from author's email, Benson Ho <b95042@gmail.com> ==\r\n您好\r\n抱歉打擾\r\n由於公司近期有事，自覺無法準備先前於貴單位所提之proposal ：CC-BY-NC-SA\r\n希望能幫我取消此次提案\r\n對於您的不便\r\n深表抱歉\r\n== from author's email ==", "reviewer": "stanley", "rank": 1}, {"comment": "I think it will be a wonderful lightning talk but regular talk.", "reviewer": "apua", "rank": 0}], "id": 94, "duration": "40 mins", "title": "Fund of fund management in python", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "This talk will be delivered by 胡崇偉 and 方銘毅. They are web programmers collaborating with designers or applying available online theme designs in projects. Hopefully both designers and programmers will benefit from this talk.", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "marr.tw@gmail.com", "speech_type": "Regular Talk", "tags": "Web, Front-end, Collaboration", "abstract": "Designers are trained and think differently from programmers. In general, designers work with static HTML while programmers work on codes and frameworks. Often, they hardly collaborate without bumping into each other.\r\n\r\nFor example, Django themes are flexible, but only for programmers. They are not designer friendly. Django templates hate designers who can't code. They need a better way to collaborate among projects, to maximize their productivity.\r\n\r\nDiazo is a smart approach to theming a website. It offers an interface between designers and developers, this brings separation of concerns, and helps to eliminate the gap. While Diazo is a technology developed by the Plone community, it can also work with various web frameworks and deploy with WSGI/Apache/Nginx. In this talk, we will showcase how Diazo works in real world, and the possibility to build a new ecosystem among web developers.", "additional_info": "Some existing demo references:\r\nhttp://www.babywith.me/\r\nhttp://www.mydoctor.tw/\r\nhttp://pypi.python.org/pypi/django_diazo", "reviews": [{"comment": "Sounds interesting.", "reviewer": "stanley", "rank": 4}, {"comment": "* A talk by a developer and a designer, hmm...!\r\n* I think we can expect something beautiful and inspiring in this talk then.", "reviewer": "drakeguan", "rank": 5}, {"comment": "always loved to see this kind of talk that connects people from different discipline, enabling pycon to reach broad audience.", "reviewer": "jin", "rank": 4}, {"comment": "I think this talk will be very worthy, since there will be two related talk in 40min\r\n", "reviewer": "apua", "rank": 5}], "id": 95, "duration": "40 mins", "title": "工程師沒告訴設計師的事 / Happy Together: Designer and Programmer", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "利用Python的分析工具，整理介紹並做簡單示範，著重在已有研究證明可行，或雖未普及但應對臨床較有幫助的項目上，聽眾應可學習對手上資料做簡易分析\r\n\r\n心律：判斷運動強度、心跳變異率\r\n血壓：高/低、長期變化（季節）\r\n血糖：飯前、飯後\r\n活動計：睡眠分析、活動辨別\r\n\r\n入門難度，不需特殊背景知識", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "bright.moe@gmail.com", "speech_type": "SciPy Talk (English Only)", "tags": "healthcare, medicine, data analysis", "abstract": "The market of \"Wearables\" is growing fast. Data generated from fitness bands, mobile phones, and other wearable devices increases every day. However, can doctors really use these information to diagnose diseases, prevent injuries, or promote health?\r\nIn this talk, I will apply analytic tools in Python on blood pressure, blood sugar, heart rate, and data from actimeter (accelerometer), trying to bridge the gap between clinical practice and modern gadgets.", "additional_info": "", "reviews": [{"comment": "All keywords are hot topics nowadays. Looking forward to see how deep the talk gonna to cover.", "reviewer": "yuanchao", "rank": 4}, {"comment": "Data analytics for medical research is a practical subject.  The review expect the audience can transfer the lessons learnt to other applications with ease.", "reviewer": "yungyuc", "rank": 3}, {"comment": "Fits as a SciPy talk and timely topic. However the abstract lacks methods/results/discussions to evaluate how the talk contrubutes to our audience. Better to redirect to Workshop or LT.", "reviewer": "whosaysni", "rank": 3}], "id": 97, "duration": "40 mins", "title": "Data Analysis in Wearable Technologies", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Agilearning is a content network of data science learning resources. \r\n\r\nIn the past 5 months, we developed a platform for people to share their great tutorials. Learners can watch videos and slides and play around with the codes and scripts, without struggling to set up the environment. \r\n\r\nSo far, Agilearning has received great responses from local community users and already acquired hundreds of online users.  We also have a paying customer from commercial bank and news companies to learn data mining and text mining skills.\r\n\r\nAgilearning project initially started as a small project to complete at Docker Global Hack Day in November 2014. It was awarded as Taipei's first place project. \r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "chihchengliang@gmail.com", "speech_type": "Lightning Talk", "tags": "online learning, data science, docker", "abstract": "Ever want to play Sudoku using computer vision? Ever want to learn machine learning skills with readily available coding environment? These now can be all done on your browser. With simple clicks, you can learn data science on the fly. Come and embrace the awesomeness of Agilearning!", "additional_info": "http://agilearning.io/", "reviews": [{"comment": "It's very suitable for lightning talk. Audience will have fun.", "reviewer": "stanley", "rank": 5}, {"comment": "interesting topic. ", "reviewer": "tjw", "rank": 5}, {"comment": "Very exciting topic.", "reviewer": "keitheis", "rank": 5}, {"comment": "Read the description twice and try to match it with the abstract, worrying that this talk could be two topics have a little in common; it appears as a personal geek project from the abstract part, yet looks like a company advertisement for the description. Well, good to see both in a  lighting talk.", "reviewer": "jin", "rank": 3}, {"comment": "", "reviewer": "yudalin", "rank": 0}], "id": 100, "duration": "40 mins", "title": "Learning machine learning Python agilely", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "本身是Python重度愛好者，但在研究上，卻待在C/C++當道的電子設計自動化(EDA)領域，這個talk我主要想分享的是：我在研究所乃至工作期間，如何盡可能地運用Python在EDA的研究上，這比較屬於一個經驗的分享，當然會有少數比較專業的知識和工具介紹，而目前的構想將涵蓋下列幾個主題（同時也是這段期間的一些成果）：\r\n\r\n1. 利用Python撰寫script以幫助實驗進行\r\n    * 如何運用簡單的Python幫助完成flow automation或撰寫parser和converter\r\n    * 同時實做了一個小tool－script-king\r\n2. multiset constraint solving（多重集約束求解）\r\n    * 這主要是我的畢業碩士論文，提出了一種新的constraint系統，可以求解subset-sum    \r\n      problem, bin-packing problem, knapsack problem, PBC ... \r\n    * 用Python實做了一個求解器，同時這也是一個Python套件\r\n3. Symmetry encoding (對稱性編碼)\r\n    * 在EDA領域中，多值層次的設計是直覺且快速的，但編碼勢必成為重要議題，這個研究  \r\n      主要探討如何在編碼中追求最大對稱性\r\n    * 用Python實做了一個編碼器，目前支援三種多值函數編碼，當然包含對稱性編碼\r\n4. 電路分析模擬器 - minickt\r\n    * 主要是參加世界積體電路電腦輔助競賽時，實做來分析電路的工具（使用Python寫\r\n      成），可以對Gate-level的電路，進行分析、模擬、操作和少許的正規驗證\r\n\r\n針對每個主題會分成幾個部分介紹：\r\n1. 研究動機\r\n2. 研究簡介\r\n3. 如何使用Python來幫助研究\r\n4. 成果與工具展示\r\n\r\n預設目標群眾：\r\n1. 想輕鬆聽經驗談的會眾\r\n2. 想了解如何利用Python加速和幫助研究的朋友\r\n3. EDA或CAD領域的朋友\r\n4. 研究演算法的朋友", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "dokelung@gmail.com", "speech_type": "Regular Talk", "tags": "EDA, CAD, algorithm", "abstract": "EDA領域一直是C/C++的天下，從業界到學界，無一例外。\r\n且看一個熱愛Python的小子如何無所不用其及地使用Python，甚至反客為主，闖出一片天下。\r\n這場演講中，你將會看到一個對於Python痴謎的人，分享他在EDA領域中堅持地使用Python奮鬥的經驗和成果。\r\n如果您是EDA的同行，您可以來看看他是如何用Python寫出一個簡單但是好用的電路分析工具，也可以來看看對稱性編碼如何對電路進行特性上的優化。\r\n如果您是喜歡演算法的朋友，您可以來看看除了線性規劃之外，還有哪一種新的模型化方式可以求解K-分割問題、背包問題、裝箱問題、虛擬布林規劃等，同時還有一個現成的Python套件可以馬上使用！\r\n如果您想要了解如何使用Python來撰寫script幫助加速您的實驗，一定要來了解一下script-king這個工具。\r\n當然，如果您只是一個喜愛Python的朋友，也十分歡迎來交交朋友，相互交流。", "additional_info": "[ my paper ]\r\nsymmetry encoding : http://alcom.ee.ntu.edu.tw/publications/iccad13-symm.pdf\r\nmultiset constraint solving : http://handle.ncl.edu.tw/11296/ndltd/68703891060081946284\r\n\r\n[ my github ]\r\nminickt : https://github.com/dokelung/minickt\r\nscript-king : https://github.com/dokelung/script-king\r\n\r\n[ personal page ]\r\nhttp://dokelung-blog.logdown.com/pages/about-me", "reviews": [{"comment": "Well-written description and a topic that might interests friends in relative industrial fields.", "reviewer": "liang2", "rank": 3}, {"comment": "Awesome!", "reviewer": "marr", "rank": 5}, {"comment": "Sounds interesting.", "reviewer": "stanley", "rank": 4}, {"comment": "EDA sounds so interesting, with Python!", "reviewer": "keitheis", "rank": 5}, {"comment": " 這種理論與實際結合的講題正是我們需要的。", "reviewer": "sosorry", "rank": 5}, {"comment": "Attractive and interesting topic.\r\n", "reviewer": "jin", "rank": 4}, {"comment": "Really a great topic for the maker trend.", "reviewer": "yudalin", "rank": 4}], "id": 102, "duration": "40 mins", "title": "Python與電子設計自動化：用愛與堅持實現專業", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "Outline:\r\n  - What's PyCuber\r\n  - Rubik's Cube Notation\r\n  - The architecture of Rubik's Cube algorithm in PyCuber\r\n  - The things we want\r\n  - Implementing object's magic functions\r\n  - reverse, mirror, optimise\r\n  - Summarise", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "adrianliaw2000@gmail.com", "speech_type": "Regular Talk", "tags": "PyCuber, Rubik's Cube", "abstract": "PyCuber is a Python package for dealing with Rubik's Cubes, which also contains a built-in solver. Behind these, the implementation of Rubik's Cube's algorithms (formulae) are really important, it provides several useful functions like reverse, mirror, optimise, this talk will cover all these stuffs.", "additional_info": "http://github.com/adrianliaw/PyCuber", "reviews": [{"comment": "The topic is interesting. After reading some given source code, it *did* implement the solver with some magic function. And I think the experience worth sharing.", "reviewer": "liang2", "rank": 4}, {"comment": "It definitely worth to spend the time and listen it.", "reviewer": "stanley", "rank": 4}, {"comment": "I think the topic and speaker is so much fun. I'd love to see it there.", "reviewer": "keitheis", "rank": 3}, {"comment": "What I like about this presentation is that it is the author explaining  his own project, this usually comes with enthusiasm and inspirations. ", "reviewer": "tjw", "rank": 5}, {"comment": "cool", "reviewer": "jin", "rank": 4}, {"comment": "He will be the youngest and coolest speaker in PyCon TW.", "reviewer": "sponsor", "rank": 5}, {"comment": "It's a good package ! nice sharing !", "reviewer": "c3h3", "rank": 5}, {"comment": "Interesting for a Rubik's Cubes dump likes me. I have never solved Rubik's Cubes since I was born.", "reviewer": "yudalin", "rank": 4}], "id": 99, "duration": "40 mins", "title": "The Implementation of Rubik's Cube Formula in PyCuber", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "演講的大綱如下：\r\n\r\n- 介紹 HDF5 特色\r\n- 介紹 h5py（直接實作 HDF5 API）用 Python 操作 HDF5 資料\r\n- 介紹 PyTables （支援一些 sorting、index 等查詢功能）\r\n- 為什麼不用內建的 pickle？\r\n- 為什麼不用 Database Ex MongoDB、SQLite、PostegreSQL？\r\n- 情境：HDF5 X pandas，可能是多數人最會用到的情境\r\n  　　　使用 PyTables，並講解使用 h5py 的困難點\r\n- 情境：HDF5 X numpy，對大型矩陣計算\r\n  　　　在計算大型影像（超過一億像素）中區域特徵，使用 HDF5 降低記憶體使用量，\r\n　　　  使得平行化變為可能。對多張圖計算時在 16 cores 上機器能達到 10 倍的效能提昇。\r\n- 情境：HDF5 X deep learning，追蹤模型學習記錄\r\n  　　　Deep Learning 是複雜的類神經網路，可以學習的參數常在十萬到百萬量級，\r\n　　　  而常見使用 gradient decent 學習，透過迭代的方式更新參數。\r\n　　　  要追蹤這麼多參數就可以使用 HDF5 記錄。\r\n\r\n為什麼系列之所以會挑 pickle 與 database 有以下的原因：pickle 好處在於 hashable\r\nPython 物件都能直接轉，也是實務上最多人用的，但它的設計並不是為了快速存取大型資\r\n料，故在一些複雜的結構，或資料大小在 GB 級以上就會有問題。Database 是最多使用者\r\n想問題，這部份網路上也沒有什麼比較（因為應用差很多）但在這個講題就會用實際的\r\nbenchmark 來舉例究竟差異有多明顯，提供聽眾在未來規劃分析時的參考。", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "ccwang002@gmail.com", "speech_type": "Regular Talk", "tags": "HDF5, Numpy", "abstract": "HDF5 是一個用來存取數據的函式庫，Matlab 的儲存格式 (.mat) 即基於該格式設計。相較於多數人熟悉的 Database，HDF5 的功能更為單純，它只負責做好讀取、 儲存資料而並不提供 Query、Join 等操作，但也因此在 I/O 表現上更為出色。常見的應用為 sensor、實驗數據記錄與傳輸、大矩陣的操作等。HDF5 在 Python 的接口實作主要有 PyTables 及 h5py，兩者針對不同的使用情境有不同的設計。\r\n\r\n在本 talk 中，會先介紹 HDF5 格式與特色，在 Python 中如何用 PyTables、h5py 存取 與異同，以及與主流資料庫、pickle 物件串流化的比較。最後示範 HDF5 如何有效的完成 以下幾個情境中的問題：存取 pandas DataFrame 物件、在大型矩陣進行區域計算、追蹤 Deep Learning 學習記錄。\r\n", "additional_info": "- HDF5 、h5py 教學參考 Andrew Collette, Python and HDF5, Oreilly 一書\r\n- PyTables 參考官網介紹\r\n- 使用情境為自身經驗分享", "reviews": [{"comment": "* I have to admit that this is the most descriptive description and abstract I have ever reviewed in this conference!\r\n* We all know that one way to tell the great programmer and normal one is how he/she handle tasks, what algorithms get used, and, of course, what data structure are applied. This is the talk about data structure!\r\n* Deep learning!? No kidding!", "reviewer": "drakeguan", "rank": 5}, {"comment": "hopefully the speaker would also give a talk like this in a scipy track.", "reviewer": "jin", "rank": 5}, {"comment": "Interesting！HDF5 rocks！", "reviewer": "c3h3", "rank": 5}, {"comment": "Sounds powerful and attractive.", "reviewer": "yudalin", "rank": 5}], "id": 24, "duration": "40 mins", "title": "Python HDF5 Use Case", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "A python version of my previous [R meetup talk](http://www.meetup.com/Taiwan-R/events/218910632/), and tend to give more hands-on baseball data analysis.\r\nA Taiwan branch of [Baseball Hack Day](http://www.baseballhackday.com/) is my goal.\r\n\r\np.s. Back to the future 2015 and Cubs WIN!!!!!", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "summit.suen@gmail.com", "speech_type": "Regular Talk", "tags": "#datascience, #sabermetrics, #baseball", "abstract": "Have you ever notice that how many numbers had been collected and recorded during a sports game? Not only practice makes perfect; for modern sports players, numbers plays an even important role in improving their performance. This talk will bring a brief introduction of sports data analysis to you, and hands-on practice. \r\n- Introduction to Sabermetrics / Mathletics / Money ball\r\n- Play baseball data (not only R, now with python)\r\n- A simple practice: Let's explore MLB/CPBL data! ", "additional_info": "http://suensummit.github.io/playBall/MLDM_20150105.html\r\nhttp://youtu.be/PjC2Q8f6CMs\r\nhttp://suensummit.github.io/playBallDeeper/", "reviews": [{"comment": "* I don't see any reason we should say no to this proposal after checking the reference: http://www.meetup.com/Taiwan-R/events/218910632/", "reviewer": "drakeguan", "rank": 4}, {"comment": "It combines data science and sport to become an Interesting topic. It's worth to pay our time on it.", "reviewer": "stanley", "rank": 4}, {"comment": "I saw a perfect marriage of  python and R in this topic, how could i say no to it.", "reviewer": "jin", "rank": 4}, {"comment": "What's the excitement that R and Python can bring in PyCon 2015? Let's check it out!", "reviewer": "yudalin", "rank": 5}], "id": 103, "duration": "40 mins", "title": "Play Data, Play Ball!", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "This talk will provide a tutorial for the GDB Python API, a discussion of the theory of operation of source level debuggers for compiled language and will contain many examples drawing from experience debugging programs across C/C++ and Python boundaries and answering frequently asked questions regarding GDB scripting problems on StackOverflow[1].\r\n\r\nThe techniques presented will be applicable both for debugging server software running in the cloud and for bare-metal deep embedded development on what we now lovingly call the internet of things.\r\n", "talk_perm": "CC-BY-NC-SA", "language": "English", "author": "scottt.tw@gmail.com", "speech_type": "Regular Talk", "tags": "GDB, DWAF, embedded", "abstract": "Target Audience: Developers that use both C/C++ and Python\r\n\r\nPython is the scripting language of choice for GDB but debugger scripting and programmatic debugging is underutilized in general because not enough developers are both GDB power users and familiar with Python. This talk aims to remedy that.\r\n\r\n", "additional_info": "* The GDB Python API : https://sourceware.org/gdb/onlinedocs/gdb/Python-API.html#Python-API\r\n\r\n* StackOverflow Questions tagged as \"gdb\" that the speaker had answered:  http://stackoverflow.com/search?tab=votes&q=user%3a676030%20%5bgdb%5d", "reviews": [{"comment": "I expect this kind of talk should be extreme level would attract more people. ", "reviewer": "stanley", "rank": 5}, {"comment": "The topic is interesting and might help shorten the gap of using gdb for python debugging. \r\n", "reviewer": "tjw", "rank": 4}, {"comment": "Great context but too hard for the beginners.", "reviewer": "yudalin", "rank": 3}, {"comment": "Every engineer needs the knowledge ", "reviewer": "tim", "rank": 5}], "id": 104, "duration": "40 mins", "title": "Programmatic Debugging with GDB and Python", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "test11", "talk_perm": "Don't record my talk", "language": "English", "author": "daikeren+program@gmail.com", "speech_type": "Regular Talk", "tags": "test, test", "abstract": "test", "additional_info": "", "reviews": [{"comment": "Review test of wenlien1001.\r\nupdate from 3 to 2.\r\nupdate from 2 to 5. Error, rank should be between 3 and -3.\r\nupdate from 2 to 0.\r\nupdate comments, score from 5 to 4.", "reviewer": "wenlien1001", "rank": 4}, {"comment": "Review test by Stanley.\r\nUpdate Score from 0 to 5. Error\r\nUpdate Comment only. Successfully", "reviewer": "stanley", "rank": 5}, {"comment": "Review Test of yuda\r\n\r\nupdate the comment. \r\n\r\n", "reviewer": "yudalin", "rank": 3}, {"comment": "Review test\r\n\r\nEDIT: change comment.", "reviewer": "liang2", "rank": 0}, {"comment": "A test comment: The best test proposal ever. But let's see if I can change the rank.", "reviewer": "marr", "rank": 5}, {"comment": "Test the review system.", "reviewer": "AlfredW", "rank": 0}, {"comment": "Review the test \r\nNo comment(EDIT?)", "reviewer": "sosorry", "rank": 3}], "id": 106, "duration": "40 mins", "title": "test", "decision": "Rejected", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "大綱如下：\r\n\r\n* 簡介 LaTeX 排版\r\n\r\n* LaTeX 的字型\r\n\r\n* 中文字型編碼\r\n\r\n* 讓 LaTeX 支援中文\r\n** 直接讀取 Unicode: XeLaTeX\r\n** 給中文穿小鞋 Fitting Chinese Characters into LaTeX\r\n** cwTeX\r\n\r\n* 為什麼這個時代還是要寫 LaTeX 中文前置處理器？\r\n\r\n* pycwtex 架構\r\n\r\n\r\n* 結語\r\n", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "alberthuang314@gmail.com", "speech_type": "Lightning Talk", "tags": "latex,unicode", "abstract": "以往 LaTeX 的中文前置處理器為了追求效率，都是用 C 語言所撰寫的，但是 C\r\n語言處理字串相當痛苦；相對於 C 語言，Python 處理字串的能力非常強大與方\r\n便，同時由於近年來電腦速度的演進，讓 Python 的處理速度加快到能夠接受的\r\n程度。講者熱愛 cwTeX 這個 LaTeX 中文前置處理系統所排版出來的高品質，也\r\n熱愛 Python 的方便性，因此使用 cwTeX 公開的檔案結構寫成了 pycwtex 這個\r\n軟體專案以支援 LaTeX 排版 Unicode 中文，讓使用者有更多中文 Unicode\r\nLaTeX 的選擇。在這個講題中，講者會簡介 LaTeX 排版系統以及其字型結構，\r\n如何讓 LaTeX 用前置處理的方式支援 Unicode(或是 Big5)，並且介紹 pycwtex\r\n內部的架構，竭誠歡迎大家來使用！\r\n", "additional_info": "Language is not decided yet, could be in English or Mandarin. ", "reviews": [{"comment": "Not sure, but variety is good.", "reviewer": "tjw", "rank": 4}, {"comment": "It should be fine for lightning talk.", "reviewer": "stanley", "rank": 4}], "id": 33, "duration": "40 mins", "title": "Preprocessing Chinese Characters for LaTeX: pycwtex", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "** Navigation, Searching, Recommendation\r\nWhat is Recommendation? and the problems behind it? \r\nIn the era, there is no recommendation system ... (YAHOO, GOOGLE, FACEBOOK)\r\nFrom business intuition to user behavior orientation\r\nStatic, Passive, Aggressive \r\n\r\n** Where might be a recommendation system in a website !\r\n\r\n** The four important questions behind system: \r\nRecommendate What?\r\nTo Who?\r\nHow ?\r\nHow to evaluate ?\r\n\r\n** Math behind system --- Brief Introduction to Machine Learning \r\nThe Procesure of Mathematical Modeling of Real World\r\nData to Vector ? \r\nTypical Problems in Machine Learning\r\nSupervised Learning\r\nUnsupervised Learning\r\nSemi-supervised Learning\r\n\r\n** Math behind system --- Navigation, Searching, Recommendation\r\nContent-Based Clustering (hierarchical navigators)\r\nPage-Rank \r\nUser-Item (Matrix Completion)\r\nSVD\r\nAlternating Least Square & Tensor Completion\r\n\r\n** Math behind system --- Problems and bottlenecks \r\nThe Hypothesises in above systems\r\nStatic Hypothesis\r\nHypothesis in clustering\r\nHypothesis in classification\r\nupdating rate versus computational complexity\r\nlearning rate versus real-time interactive\r\n\r\n** From Engineering View of Point", "talk_perm": "Don't record my talk", "language": "English", "author": "c3h3.tw@gmail.com", "speech_type": "Regular Talk", "tags": "recommendation system, numpy, pandas, scikit learn", "abstract": "In this talk, I will sharing some of my experiences about building a news recommendation system with text mining tools and web tools in python echosystem. Moreover, I will also share some important concepts, questions and experiences about \"how to design and build a recommendation system with tools in python echosystem.\" \r\n\r\nBesides, every recommendation system would meet large scale data mining problem. In this talk, I will also share some experience about dealing with large scale modeling problem with python. ", "additional_info": "", "reviews": [{"comment": "I think the speaker can give a really good presentation on this topic. But material selection, organization, and time control is really important for this type of talk.", "reviewer": "tjw", "rank": 5}, {"comment": "attractive at the first sight, and was left behind reading through description. maybe i am not the \"focused audience\" for this talk, i mean, can not really tell what it's trying to sell/share.", "reviewer": "jin", "rank": 2}, {"comment": "Recommandation system is the trend for the modern web services. ", "reviewer": "yudalin", "rank": 4}, {"comment": "Machine learning is hot in couple of years and always attracts people. But the content of talk is too wide and hard to believe it could be described well in every single part and the man who is familiar with this part will think the topic is too easy. Suggest to pick up the specific domain and let this talk could be extreme level talk.", "reviewer": "stanley", "rank": 5}], "id": 101, "duration": "40 mins", "title": "How to build a recommendation system with python", "decision": "Accepted", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "介紹：\r\n       運用雲端語音合成技術(Text-to-speech Technology,TTS)，諸如 Google Translate、iSpeech等等，建立一套能夠從一段長篇文章取得音文同步(Speech-Text Synchronization)的技術，並且運用此技術取得的音文同步有聲書的Timed-text檔案，基於電腦輔助語言學習(Computer-assisted Language Learning ,CALL)之目的，以此Timed-text檔案製作一套基礎的有聲書學習系統。\r\n\r\n\r\n研究背景與動機：\r\n     隨著地球村趨勢的來臨，擁有多種的語言能力成為競爭力的一種指標，在聽力(listening)及口說(speaking)上的表達能力猶是，因此如何培養語言的能力，漸漸的受到重視。\r\n\r\n     數位教材在電腦與網路普遍並大量使用之下，已逐漸形成一種趨勢，運用電腦及網路科技輔助的語言教學廣受注意，「電腦輔助語言學習」 (Computer-assisted language learning , CALL )，成為一項熱門的研究主題。\r\n\r\n目的：\r\n      為達CALL之目的，希望能將雲端語音合成技術和音文同步有聲書結合，製作一套輔助語言學習的系統。\r\n", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "j79916@hotmail.com", "speech_type": "Regular Talk", "tags": "Speech-Text Alignment,Text-to-speech,Computer-assisted Language Learning", "abstract": "運用雲端語音合成技術(Text-to-speech Technology,TTS)結合音文同步技術(Speech-Text Synchronization)，建立一套能夠從一段長篇文章取得音文同步有聲書的Timed-text檔案的方法，並基於電腦輔助語言學習(Computer-assisted Language Learning ,CALL)之目的，希望以此製作一套輔助語言學習的系統。大概有以下步驟(1)Text Spliter ─ 將原始文章切割成Sentence-level Text，使其長度能夠讓Google TTS接受(2)Upload to Google translate ─ 利用Python Standard Library 的urllib模組，將字串交給Google TTS(3)Download TTS Audio file ─ 用binary的方式將Google TTS回傳的內容儲存為MP3(4)Timed-text file Converter ─ 將Sentence-level Text進一步黏上時間標籤，製作成SBV檔(5)Audio Converter ─ 利用FFmpeg將MP3檔轉成WAV檔(6)CguAlign ─ 將WAV檔和SBV檔作自動切音，使產生Word-level Text的SBV檔(7)Website Presentation ─ 用javascript製作簡單的網頁能夠流覽Word-level音文同步的文章。", "additional_info": "[1] 黃偉杰，語音辨識之音文對齊技術應用於音文同步有聲音之建立，長庚大學，民國101年\r\nhttps://drive.google.com/file/d/0ByPRx5aruSFcRnVMc3E0aTljZWM/view?usp=sharing\r\n[2]Google Translate https://cloud.google.com/translate/docs\r\n[3]Google 的語音合成 API 之使用 (作者：陳鍾誠)\r\nhttp://programmermagazine.github.io/201309/htm/article2.html\r\n[4]FFmpeg https://www.ffmpeg.org/\r\n[5]Python http://www.python.org/.org/", "reviews": [{"comment": "* Touching different field is the major reason I scored this proposal 5.", "reviewer": "drakeguan", "rank": 5}, {"comment": "Although the topic is not strong related to Python,\r\nbut good to hear the different kind of topic in PyCon.", "reviewer": "stanley", "rank": 4}, {"comment": "It is less about Python, even if it is a special topic.", "reviewer": "apua", "rank": 2}], "id": 34, "duration": "40 mins", "title": "雲端語音合成技術應用於長篇文章音文同步有聲書之建立", "decision": "Undecided", "slide_perm": "Don't publish my slide", "audience_level": "Introduction"}, {"description": "每個寫程式的人都有個寫遊戲的夢想。\r\n\r\n希望藉這次 PyCon 的機會，把一些製作遊戲的心得跟方法傳達給一些寫程式的初學者。\r\n\r\n這次 WorkShop 會帶著大家分析以下這些遊戲:\r\n\r\n* 貪食蛇\r\n* 特訓 99\r\n* 踩地雷\r\n* 猜數字 (電腦猜你的數字，不是玩家猜電腦喔)\r\n\r\n還會帶大家試試看使用 Kivy, 來製作高互動性的遊戲。\r\n\r\n\r\n\r\n本次 WorkShop 計畫分成兩個階段\r\n\r\n第一個階段會在客前聯絡參加者，確認環境已經裝好。\r\n\r\n第二個階段是就是課程當日，一早我們就開始上課寫程式。\r\n\r\n這次課程預期參加者會使用  Python, 並且對於幾何座標的數學運算有基礎(國高中程度可)\r\n\r\n比如說座標相加，斜率等等的定義有了解。\r\n\r\n最後希望上完課以後大家都可以拿起 PyGame, 寫出簡易的互動程式。\r\n\r\n\r\n\r\n\r\n\r\n\r\n講者介紹：\r\n\r\n* Taipei.py organizer\r\n* 2012 年參與 Evernote 駭客松競賽,榮獲台灣區冠軍\r\n* 2014 百度開放雲 Hackathon，獲得最有潛力獎\r\n* PyCon APAC 2014 Chairman\r\n\r\n\r\n\r\n\r\n ", "talk_perm": "Don't record my talk", "language": "Mandarin", "author": "tim.yellow@gmail.com", "speech_type": "Workshop", "tags": "pygame", "abstract": "介紹 PyGame \r\n介紹製作遊戲時需要的架構\r\n介紹各式遊戲需要的演算法", "additional_info": "http://www.pygame.org/news.html", "reviews": [{"comment": "學員可以貪心學到更多範例嗎?", "reviewer": "marr", "rank": 5}, {"comment": "非常貪心地想參加 Tim 的教學。", "reviewer": "keitheis", "rank": 5}, {"comment": "我喜歡講者的風格，但此題材可能比較適合 tutorial 。", "reviewer": "tjw", "rank": 4}, {"comment": "Interesting！", "reviewer": "c3h3", "rank": 5}], "id": 11, "duration": "Whole Day", "title": "如何用 PyGame 打造貪食蛇 ", "decision": "Accepted", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}, {"description": "神經網路演算法使用倒傳遞演算法，修改自Neil Schemenauer前輩的演算法程式來當作本辨識程式之主要演算法。\r\n以此演算法和自己建立數張貓咪圖片來當作訓練以及測試用的樣本資料。貓咪圖片設定為10x10像素，來取出10個特徵值，所以建立以10個輸入神經元。辨識五種貓所以建立5個輸出神經元。隱藏層取8個神經元。建立以上三層的多層神經網路。\r\n網路會把訓練樣本讀入網路來反覆訓練網路，訓練2000次以後再以測驗樣本來測試網路的辨識程度。\r\n\r\n更詳細的程式介紹可以參考我的部落格文章:\r\nhttp://jeng29028.blogspot.tw/2015/01/pattern-recognition-final-report.html", "talk_perm": "CC-BY-NC-SA", "language": "Mandarin", "author": "jeng2604@gmail.com", "speech_type": "Lightning Talk", "tags": "neural network", "abstract": "運用類神經網路之理論，實作出一個辨識程式。能夠辨識一張未知的貓咪圖片然後告訴使用者這隻貓咪的品種為何。\r\n設計兩種方法來比較辨識度的高低，分別是以貓頭辨識和以分成三部位(左耳、右耳、臉)來辨識再加以整合。預期使用三部位辨識會比使用貓頭辨識的辨識率還要高。\r\n最後實際測試的結果如下:品種設定為五種貓，70張訓練樣本與40張測試樣本中，使用貓頭辨識的正確率為40%；而使用三部分辨識的正確率為52.5%。如果是五種品種隨便猜，正確率為20%，可見使用此理論建置出來的辨識程式使得電腦有一定程度的智慧來辨識五種貓咪圖片的品種。\r\n", "additional_info": "演算法程式原作者: Neil Schemenauer <nas@arctrix.com>\r\n貓咪圖片取自於網路", "reviews": [{"comment": "His abstract and description are written in detail, so I'll try make my\r\nfeedback as solid as I could. Using neural network in Python on vision\r\nrecognition is definitely interesting, however I'd like to see a more general\r\ncomparison and exploration, so audience can actually \"learn\" the concept of\r\nneural network and a general experience of the Python implementation after the\r\ntalk, so they could play with these take-home messages themselves.\r\n\r\nFor example, say normal NN models are trained based on backward propagation,\r\nit is good to explain how the backprop works in Python. Numpy may be heavily\r\nused, and there exists some trick for efficient Numpy matrix computation.\r\nAlso, it would be a lot easier to create new models (classifiers) if the code\r\nfor each neural layer is well modularized. Some popular Python NN libraries\r\nare available, they worth comparison (if one wants to) too. One may wish to\r\nleverage the computing power of GPU once the NN structure gets deeper and\r\nlarger. Explaining these general concepts could help audience jump into\r\nthe beautiful and fascinating machine learning world.\r\n\r\nOn the other hand, there leaves some technical stuff to be desired in his NN\r\nstructure design judging from a modern NN view. Firstly, the input size is\r\nway too small, using 10-by-10 pixel reduces the real world complexity too much.\r\nEven the MNIST hand written digit recognition dataset has higher input\r\ndimension. This also poses a limiting upper bound for accuracy. Secondly the\r\nmodel is too simple, most people call this a two-layer (or one hidden layer)\r\nneural network instead of three, where first layer usually doesn't count\r\n(since one \"train\" the input layer). He should try deeper neural network and\r\nvisualizing the weights learnt by the classifier. Current development of\r\nvisual NN heavily relies on the idea of convolutional neural network (CNN)\r\nwhich is biologically inspired so one could actually \"visualize\" those weights\r\nas colorful filters. We are not talking about the giant corporation-like\r\nImageNet CNN model with 10+ hidden layers and requires few days to train. One\r\nsimple CNN layer plus the fully connected layer would boost the performance\r\nsignificantly and brings a lot of insight that decades of research finally\r\nachieve and brings up a frenzy of the CNN era, which he should definitely try\r\nit in a 40min talk. Lastly, why 5 types of cats and why not crawl more cats\r\nfrom the internet? I think by supplying keyword to Flickr one could able to\r\ncreate a clean and large dataset (at least more than a hundred). Let alone the\r\n*evil* data augmentation process that utilizes cropping, color transformation\r\nfor creating more data to alleviate the over-fitting.\r\n\r\nBased on the above reason, the talk could be more constructive and\r\ninteresting. I believe he is absolutely capable of a successful talk, the last\r\nthing he misses is simply letting the imagination go wild.", "reviewer": "liang2", "rank": 2}, {"comment": "認同 liang2 的意見。NN 是非常好用的工具，但最大問題也是其黑箱作業。如果只是使用某種模型來解決特定問題，但缺乏更深入的說明與比較，很容易讓人覺的結果只是 tune 出來。", "reviewer": "sosorry", "rank": 3}, {"comment": "主要的價值在基礎教學、展示這方面。", "reviewer": "tjw", "rank": 3}], "id": 29, "duration": "40 mins", "title": "以倒傳遞類神經網路辨識貓咪圖片", "decision": "Rejected", "slide_perm": "CC-BY-NC-SA", "audience_level": "Introduction"}]